{"showID": "000A9sRBYdVh66csG2qEdj", "show_name": "Kream in your Koffee", "show_description": "A 20-something blunt female takes on the world and gives you her take on it. Enjoy visits from special guests and friends to give insight and input into interesting situations.", "episode_name": "1: It’s Christmas Time!", "episode_description": "On the first ever episode of Kream in your Koffee, Katie talks about tips for Christmas shopping. We also get a little insight into who and what we’ll be hearing about in next weeks episode! ", "duration": 12.700133333333332, "transcript": ["Hello. Hello. Hello everyone. This is Katie and we are here together on our first ever episode of cream in your coffee. Thank you so much guys for humoring me on this podcast Journey. It's been a huge goal of mine for the past few years. I finally just growing a pair and jumping right into it and seeing how it goes. So, thank you again for bearing with me here.", " Alrighty guys, so I figured for the first episode why not jump into a topic that is so exciting for pretty much everybody out there just around the corner and seven or eight days. We have the wonderful Christmas and I'm so excited Christmas is a great time of year for me. I just love the spirit of happiness and joy and the giving spirit. I love every single part of it and I hope that you guys are excited for it to obviously it would definitely", " I say that most people are I find most excited about receiving gifts around Christmas time. I'm definitely the opposite I get really really awkward when someone gives me a gift but I get so excited to give someone else a gift and just to see their faces when they open it. I'd like to think that I'm pretty good with gifts. I usually think of something like thoughtful or I'll even make something for someone so it really just depends on the person obviously, but I don't know doing something nice for someone always feels good, right?", " Anyways, so I wanted to just give a couple tips for you guys because I did work retail for several years of my life and I'm honestly very very happy that I am not this year because I hate crowds and even though I work with people I kind of hate people. So seeing frantic men and women running all over the mall trying to figure out what to buy their loved ones for a holiday. That's like usually two days away is a little stressful for me, but this year I don't have to worry about", " But thank goodness.", " So my first tip for you guys is going to seem probably unhelpful right this minute, but in future Christmases to come it's going to save you big time. It's going to save you stress and it's going to save you money come December so", " I'm going to say tip. Number one Santa knew what was up. Okay, make a list and check that shit twice. I don't mean make a list right before you go out shopping the day of gentlemen. I'm sure your shopping Christmas Eve. Stop fucking doing that. I mean throughout the year make a list of things that your friends and family make comments about so things that they always use things that they want things they enjoy", " And this is going to save you a headache because not only is this list going to have a backup list of things that you can buy if you are totally stuck on gifts, but you also have something to reference all year long.", " When you can pick things up, so this is where it's going to save you financially. You're not coming around to December of next year and you're like shit. I don't have enough money to buy Christmas gifts or you know, you see those memes that are like it looks like people going to be getting a Merry Christmas message for Christmas. That's what my bank account looks like. No, you're going to go it's going to be July and your best friend Janine really likes, you know, Marc Jacobs Daisy perfume. So you pick it up in July and then you have it in your closet for Janine come to", " Brr. Okay, it's going to save you a gift that you have to remember to buy and it's going to save you money in December when you're already forking out the dough tip number one make a list kind of wraps into this number two or tip number two, because tip number two is by throughout the year things are going to go on sale people always get so excited for like Black Friday shopping and Boxing Day sales. I will say Boxing Day tends to have a little bit better.", " Sales, I personally find four things then Black Friday, but I've had this conversation with people before where they're like, oh my God, like Black Friday deals are so good. But people are lined up around the block. I guarantee you that Best Buy has pretty much that same deal on a television Midway through the year. You just don't notice because you're not looking it up. So just be conscientious of what you're looking to buy and when the deals are honestly check throughout the year and you're going to save yourself at least like four.", " Out a chunk of dough in December at least you're saving yourself that financial burden if not finding the deals as well and saving money that way so tip number one is make a list and tip number two is by throughout the year.", " The last tip that I'll leave you guys with for the Christmas season is the three gift rule. So this is something that I initially started doing for children and realize that it was also a really good starting point for gifts for your adult friends as well. So I the gifts are very simple one thing you want one thing you need and one thing to read. So one thing they want something they've brought up something that they've mentioned to you that they would love to have.", " But they just can't afford right now or whatever one thing they need. So ladies, you know, if your man's taking his pants off and his boxers look like moths have gotten into his underwear drawer. He needs some briefs and or Underoos or boxers or whatever the hell you call them. Go get you a man's some underwear. So again, the first two is one thing you want and one thing you need one thing you read. I love this one.", " Honestly, this is great. I love it because I used to read all the time and now it takes me five months to read a book that I would probably finish in two days. So one thing to read gets everyone on that educational truck and gives their brain a little bit of a workout.", " Now the one thing to read is also kind of a fun little gift because it gives the other person that you are giving to an insight into your brain and what you would kind of read or at least what you would suggest for them. So it opens up some Avenues of may be an author that they never thought to look into or some storylines that they might like that they didn't know they would so it's like a gift that keeps on giving you know, it's wonderful.", " So those are my three Christmas tips for you guys tip 1 make a list and check it twice tip to shop throughout the year rather than leaving it as one huge task and lump sum of money that you need to Shell out come December and tip 3 is try the three gift rule.", " So hopefully you guys found those tips at least minimally helpful. I found that anyone that I have told those things to obviously prior to December 17th have actually found that quite helpful to kind of do it throughout the year. Like I said, it just takes a lot of Burden off of you and the third tip at least helps you to have a platform to start with on how and where to start getting gifts.", " So guys, like I said, I'm a huge fan of Christmas as much as I love the spirit of it though. Like if you know me in person, you've seen me dressed up for work for Christmas full on Santa socks the whole getup that being said with all this excitement that I have for the Christmas season. I don't actually decorate my place. Um, I think I have one stocking that A friend gave me several years ago. And that's the one Christmas decoration that I have and that goes", " On my door, so I'm not a huge decorator surprisingly enough. I will be having a guest on next week though for next episode and her family goes all out. So we will definitely be talking with her about her Christmas traditions and how they decorate.", " Now you guys are probably thinking like what the fuck is this person talking about she loves Christmas, but she doesn't decorate what is up with that. I don't know. I'm just not a huge decorating person. It might also be because I have two small dogs and they just get into everything. I also live alone. So I think it just for me at least seems a little silly to set up a whole bunch of Christmas decorations just to take them down for myself to look at them. I don't know if that's just a lot of effort with", " A lot of return I guess. I don't know. I don't like Snow either. So the weather recently hasn't exactly been my favorite, but given that it is Christmas. I will take a nice fluffy layer of snow for Christmas day that's acceptable, I guess so mother nature. Feel free to send us a little bit of snow, but no ice no hail and no freezing rain. Thank you.", " So I'm not a huge fan of snow and I don't decorate my place and I'm not a huge fan of receiving gifts. I mean you guys are probably thinking why does this woman keeps saying that she loves Christmas. So here is why I love Christmas. As I said before. I love the joy that everyone has I love the good mood that it puts most people in although I hate snow. I do like when it looks like a winter wonderland - the slush and the slipping", " So the joy I guess but absolutely my number one favorite thing about this season is seasonal coffees. So eggnog latte is Starbucks. You know, what the fuck is up? That is my favorite. Honestly, eggnog anything throw me some rum in that nog and we got a good time going on and also just the little the cops to", " Like just the festive little cups that they give you I love every part of it. Yeah, if you didn't catch that, I love eggnog. So in case anyone wants to gift me eggnog I can do something fun with that. Maybe I don't I don't fucking know if anyone has any ideas of eggnog cocktails as well. I recently discovered an eggnog colada so fucking good. Maybe we'll talk about that on the next episode but", " Yeah, I mean definitely go check just Starbucks and check out the eggnog latte is because if you seen my stories I pretty much have at least one a day for the entire month of December and then I wonder why I gained weight and it's actually because I've been drinking all the cream and egg. Nog me now as for Christmas traditions, I don't really do much. Typically I hang out with my family on Christmas Day.", " As most people do my family as you know, as you get older people typically end up moving all over the place. So this year we won't be having a big family Christmas. I am lucky enough to have a fantastic boyfriend who is hosting Christmas Eve dinner this year. So I'll be able to spend some time with him and hopefully I will be able to visit my brother and his fiance who are actually expecting so I'm very excited to see them.", " And say hello to their little nugget that is not born yet. But I think I got the right to rub her belly and say hello to the outer womb given. I'm the baby's Aunt I don't know Roxy if you're listening to this, please let me know if I'm not allowed to do that. So I don't make an awkward situation down the road. Anyways guys. Thank you so much for listening. Like I said huge huge.", " Huge shout out to every single one of you that has listened because I am extremely nervous, but I'm really happy that I put myself out there and gave it a try. So thank you so so much guys, and we will see you next episode where I will be interviewing one of my good friends Katarina who like I said, her family is a huge Christmas family, and we'll be learning a little bit more about what they do for Christmas on the next episode. Thanks for tuning in guys. Bye."]}