{"showID": "00A08geZvrEL1woiaAFT9x", "show_name": "Mastering Your Fertility", "show_description": "Do you worry you won’t get pregnant, stay pregnant, or have a healthy baby? Infertility rates are on the rise. Women are waiting until later in life to start a family. It is more important than ever to start understanding exactly how to take control of your fertility. Your hosts are Dr. Haylee Nye, a licensed naturopathic physician, and Kristin Cornett NTP, a certified nutritionist. We dive deep into what truly causes disease, infertility, complications in pregnancy, and what can ultimate lead to a chronically ill child. ", "episode_name": "#61 What to Read: Best Books for Fertility, Preconception & Women's Health", "episode_description": "In episode 61, we share the top books we recommend for preconception, fertility, and women’s health. There are so many incredible authors and experts out there, many of whom we’ve hosted as guests on the podcast over the past year. We wanted to take this week to share our top picks for reading material when you’re trying to conceive and/or trying to work out imbalances with your hormones and cycle. You’ll learn which books we recommend, what you can expect to learn from each one, and who can benefit most from the information shared. You can find show notes for the episode, along with links to all the books we talk about and any corresponding podcast episodes, on our website at https://tinyfeet.co/my-podcast/61. Free course on How to Choose the Best Prenatal Supplements Download your quiz: Are You Healthy Enough to Get Pregnant? Schedule a FREE 20-Minute Phone Consult  ", "duration": 35.4503, "transcript": ["Welcome back to the mastering your fertility podcast. The show is all about reclaiming Health enhancing fertility and preparing for pregnancy. I'm Kristen Cornett a holistic nutritionist and functional Wellness practitioner at tiny feet and I'm dr. Haley my a naturopathic doctor and certified nutritionist at Synergy Women's Health Care in Portland, Oregon our goal for this show is to educate and Empower couples with the knowledge. They need to get pregnant. Stay pregnant and have a healthy.", " Speedy possible", " Alright everyone. Thank you so much for being here with us for another week of mastering your fertility. You're listening to episode 61 where we're going to be sharing some of our favorite book recommendations for fertility preconception and general Women's Health. We have had so many incredible authors join us on the podcast all throughout 2019 and we talked in depth about each of their books as we went through those interviews. We wanted to provide you guys with a summary of our favorites all in one place and help you determine which books will be the most helpful.", " Full for you based on your unique situation. There are also some great books that we haven't talked about on the podcast before a few of which we've just discovered recently. So we wanted to make sure that we shared those with you as well. We're going to be going over 14 different books today. And don't worry. We are not suggesting that you read all of these especially not all at once. We've actually split them up into categories and will tell you which ones we recommend in which situations to help you narrow down your reading list. The different categories will be discussing on the", " episode today in order are preconception and pregnancy nutrition menstrual cycle health and hormone balance genetics and preconception Health preparation miscarriage and recurrent pregnancy loss male fertility egg quality infertility and fertility treatment and chronic conditions affecting reproductive Health which includes PCOS and endometriosis. If you have a specific category, you're interested in hearing about and want to skip ahead you can find the timestamp for where we discuss.", " Category in the show notes for this episode and you can get to those through the link in this week's episode description. Also in the show notes, you'll find links to each of the books we talked about as well as the corresponding podcast interviews that we've done with many of the authors before we get started. We'd like to remind you about a couple of awesome free resources that we have available for you to learn more about how to support your body to prepare for a healthy pregnancy. You can learn all about our top recommendations for essential nutrients and supplements through our", " free online course called how to choose the best prenatal supplements and you can also check in with your health and find out whether you might have some symptoms or issues that need to be addressed before getting pregnant with our free quiz called are you healthy enough to get pregnant? You can find links to both the course and the quiz through the link in the episode description. And lastly if you would like to receive a more personalized advice about what might be next for you on your health or fertility Journey. You can schedule a free 20 minute consult with me through tiny feet and the link to", " Your consult is also in the episode description. All right, guys, let's get started on today's episode. We are going to start by talking about one of our favorite nutrition resources for both preconception and pregnancy. The book is called real food for pregnancy. It's by Lily Nichols. She is a registered dietician who is known for being very evidence-based. So this book is a research supported guide. It has over 900 scientific study references that are all about sharing the most up-to-date.", " Eight research on nutrition for pregnancy and this information is also applicable to preconception. So some of the things that you'll learn from Lily's book is why conventional nutrition advice for pregnancy is pretty outdated and really not based on the best available evidence that we have right now why it's important to focus on real food for the health of your pregnancy and how this can specifically impact long-term health and development for your baby what it actually means to eat real food. And which foods are the most important.", " And to include in your diet during pregnancy and then of course if we're going to talk about what to eat she has to talk about what foods are best limited or left out of the diet during pregnancy. And then Lily also shares a ton of recipes to help get you started on this real food eating journey, and in addition to nutrition, she also shares some evidence-based advice on supplements lab test that you might want to seek out during pregnancy environmental toxins to avoid and then postpartum recovery after baby comes", " so we do love recommending this book to pregnant moms. But if you're in that preconception period this is also going to be a great book for you the same foods and habits that support a healthy pregnancy also support your fertility. So if you're thinking of starting a family anytime within the next few years, you're wanting to know what you can do to proactively prepare with nutrition. This is an awesome book for you to read if you would like to learn a little bit more about the book and here from Lily personally. We do have a podcast interview with her. That's episode 15.", " Podcast and we are actually hoping to have her back on again this year to share a little bit more with you guys. So on to our next recommendation, which is beyond the Pill by dr. Jolene brighten, and dr. Haley is going to cover that one for us. Yep. Thanks Kristen. So the next section of books that we're going to be talking about is on the menstrual cycle and hormone balance. And the first book that we want to mention is beyond the Pill by dr. Joley Brighton. She's a naturopathic doctor here in Portland, Oregon.", " And be on the pill is a fantastic Women's Health Resource that really investigates the risks associated with hormonal contraceptives and provides women with a blueprint to recover optimal hormonal Health after coming off birth control. It can also help women who are still taking birth control mitigate some of the potential side effects and this book is going to help you understand more specifically the risks and side effects of the pill that are often not shared with women when they first begin the birth control pill.", " Including effects on gut health immune function thyroid hormone Liver Health and fertility. Also what post birth control syndrome is so that's post birth control syndrome. This is something that is relatively new that not a lot a lot of doctors know about she kind of coined the term and she goes into more detail on that and how it can affect women in different ways as they're coming off of the pill.", " And then also how specific hormonal imbalances kind of manifest in your body and how to identify whether you have any of these imbalances. So I like how she put this book together in different quizzes. And so you can really break down what type of imbalances you have whether it's like high testosterone or low progesterone and then she'll give you detailed advice on dietary changes testing that you can have done at your doctor and specific supplementation.", " Will help you regain your health and hormone balance based off of pretty much the answers to those quizzes.", " So this book is amazing for anyone who has experienced negative side effects to taking the birth control pill or after you've stopped. It's also a great resource for women who originally prescribed the pill for any other reason other than preventing pregnancy which happens a lot. So if you are prescribed the pill for take or having acne irregular or absent Cycles painful or heavy periods If you experience endometriosis PCOS and", " Other Home hormonal imbalances, so you'll learn about which hormones may be out of balance in the body and then what steps to take so as I explained a little bit earlier you kind of take a quiz and then she'll walk you down that rabbit hole in the book and where you want to go based off of those answers. So we highly recommend this book if you're for those who are planning to or have recently come off the birth control pill or wanting to conceive in the next year and to learn more we", " We did have an interview with dr. Joley in Brighton and discuss the book in detail in episode 23 of the podcast. So the next book that we would recommend for your helping menstrual cycle is the period repair manual and that's by dr. Laura Brighton and Kristen can talk more about that book. Yeah. So this is a great one. This is actually one of the first books. I think I read when I was really wanting to learn more about women's health and hormones. And so this is", " Lie about natural treatments to improve menstrual cycle health. So, dr. Brighton is kind of the the queen of period problem. She spends a lot of time talking about issues that affect the menstrual cycle on her blog on her Instagram and in her book, so she's going to go into information such as why birth control doesn't actually treat period problems. You'll also find some of that information and be on the pill but the context is a little bit different. Dr. Biden also goes over what a healthy menstrual cycle should really", " look and more importantly what it should feel like to each woman and then she goes into pretty amazing detail about how to use natural treatments like Diet lifestyle and specific supplementation to address common period issues. So that includes irregular or absent periods or PCOS endometriosis heavy or painful periods. Also PC and PMs and other mood imbalances breast pain and several other things in the book as well.", " So this is a great one to consider for pretty much all women who are of reproductive age to learn and read more about how our bodies are supposed to work. And what factors might be at play. If you are having problems with your cycle, and if you would like to learn more from dr. Brighton, we interviewed her in episode 24 and 47 of the podcast. So 24, I believe is all about PCOS and then 47 is about the connection between estrogen and histamine, so", " You'll learn different things in each of those episodes but they are both awesome. Yeah. Yeah. Dr. Biden's pretty amazing. I remember when we first interviewed her eye. She has a very motherly voice. It's very soft and nurturing and you just want to talk to her all day because you just feel like you know, she's giving you like a hug over over over the Internet. Yeah. She's pretty amazing to listen to and she's just so so smart. So we definitely recommend listening to those episodes. Yeah.", " The next book that we wanted to talk about in this particular category is the fifth Vital sign by Lisa Hendrickson Jack. She's really amazing. She just came out with this book last year and it's one of our absolute favorite books for learning about the inner workings of your body hormones and especially the menstrual cycle which she it's not. Well the association's say it's the fifth Vital sign, but that's what the book is called. The fifth Vital sign is a mentor.", " Recycle and it's perfect for learning how to track your cycle with the fertility awareness method So Lisa also used a lot of citations in this book over a thousand study citations. And so it's very heavy evidence-based book and it's one of the most well-researched women's health book out there for patients or clients or whoever wants to read it and we've mentioned this several times, but we do think that this book should be a required reading for every", " teenage girl getting her period it certainly can save a lot of women years of frustration and suffering through symptoms that were taught that are normal when they're not so in this book to be a little bit more specific you're going to learn why your menstrual cycle is such an important indicator of your health and what a normal cycle should look like she also takes a deep dive into your fertile signs particularly cervical mucus and how", " to track and chart them. Also how tracking your cycle can help you identify underlying issues with your health or fertility how birth control impacts your body and your cycle even after stopping after you stopped taking it and then also natural ways to support a healthy menstrual cycle and how you can intervene with diet and lifestyle changes to address recycle issues. So once again, this is an amazing resource for every", " Calling female. I recommend it pretty much to all my patients and out of I would say out of the three books that we just mentioned. This one would probably be my top favorite just because of the amount of citations and detail that she goes into and it's pretty easy to read especially if you don't really have any type of specific diagnosis and you're just kind of starting at a baseline. You just want to learn more about the cycle and then of course if you have like PCOS or enemy,", " Atrios osorno period at all. I mean, dr. Laura brightens book or even Jolene bright brightens book would be a great great resource. Also, we have interviewed Lisa twice on this podcast. So hopefully you've listened to her already, but if you haven't go check out episode 26, which is our first interview all about cervical mucus and then episode 55 is about tracking the menstrual cycle.", " And she does also have her own podcast, which is called fertility Friday and many of you may be familiar with that already, but she has been doing that for about five years and has a ton of great information on there as well. All right, so next up we're switching categories a little bit and this next book is the only one in its category which is all about genetics. And so the book is called Dirty Jeans by dr. Ben Lynch. He is a naturopathic doctor and has kind of dedicated his career to genetics nip", " a single nucleotide polymorphism research basically, these are little variations in genetic code that can have a pretty significant impact on health depending on which ones you have and in what combination so this is really about how these specific genetic variants can change the function of these genetic Pathways and can ultimately lead to some issues in the body and the book is really geared toward not just understanding what issues can arise but kind of specifically how to fix them and", " he calls that cleaning your jeans. So the book is dirty jeans and he talks all about how to clean your genes which I think is kind of cute. So there are seven genetic Snips that he goes into pretty awesome detail about and so some of those I'm sure that I'm not gonna remember all seven off the top of my head, but you're going to learn about things like MTHFR PE Mt. D. AO is in there comt of all these sound like Greek then you probably haven't done a genetic test for yourself yet. But if you have heard of these in you're looking to learn more, this is a great.", " To do that in and dr. Lynch is actually very passionate about improving Next Generation Health through preconception care. He owns a supplement company called seeking health and his prenatal vitamin that he formulated is actually one of our top recommendations to our clients and I really think of this book as a personalized preconception roadmap for women and couples if you use this book and kind of figure out what's going on with your body based on some of these genetic pathways,", " Ways you can really use the advice in here to personalize your pregnancy preparation by kind of diving into different areas of your health and investigating and adjusting Things based on the recommendations that he provides. So you'll learn things about diet lifestyle supplements and also advise for further investigation into your health based on some of these areas that he's going to talk about in the book. So we really recommend this to anyone that's interested at all in genetics and how genetic Snips might impact.", " Act reproductive and Childhood Health specifically, this will also be especially interesting to those of you that have had a genetic report run already such as through 23andMe or ancestry or our personal favorite, which is next-gen Labs. So we also have an interview with dr. Lynch on the podcast and we talked about his book as well as how genetics affect preconception Health pregnancy and Childhood Health and episode 35 of the podcast. So definitely check that one out if you're into", " Medics at all and I guess that brings us to our next category which is reducing the risk of miscarriage and investigating recurrent pregnancy loss and we have two amazing books to talk about in this category. Dr. Haley will talk about the first one which is called not broken up by dr. Laura Shaheen.", " Yeah, so, dr. Laura Shaheen is a reproductive endocrinologist from Seattle Washington and she recently wrote a book called not broken and this is based off of recurrent pregnancy loss and she talks about the medical definitions of miscarriage and also recurrent pregnancy loss. And then the statistics Behind these particular issues which are actually very reassuring", " I've used, you know repeated these statistics many times with my patients, which they've also found to be reassuring. So we appreciate her doing the research for us for that. And then she also talks about some possible issues that can cause recurrent pregnancy loss and then how to test for them and reducing sugar talks about reducing the risk of miscarriage through positive Lifestyle Changes, which is a common theme through a lot of these books.", " X and then also using integrative approach to fertility care with acupuncture and Eastern medicine. So this is a really good resource for couples who have been through more than or at least one miscarriage or more and wants an easy-to-understand guide about whether options are for testing and treatment from both a conventional standpoint and an integrated perspective and then the other book is called carrying to term by dr. Jordan.", " Robertson and she's a naturopathic doctor that practices in Canada. And this book is also all about reducing the risk of miscarriage which and what testing and treatments couples are can go ahead and seek out when they've had a miscarriage. She has a very interesting story because she as a student she's had she had multiple miscarriages herself. So that's why she's quite passionate about this topic and then she wrote this this book as a", " Source for her patience, and anybody who would like to read it we did interview. Dr. Robertson on the podcast so you can hear her story and her her inspiration for the book in episode 36 of the podcast, but she's also very evidence-based as well and she goes into some of the available research on things like thyroid testing and proactive Health assessments that you can do.", " And it could be really helpful. Just trying to simplify a very complicated process and helping you understand what test ask your doctor for and what certain terminology means such as like a luteal phase defect and PCOS and things like that. So it could be really helpful. I would say if you've experienced a miscarriage or more than one then these two books are come highly recommended.", " Yeah, I would if I had to differentiate I would probably say that I would recommend not broken to couples that have had at least two and if you're kind of sitting at one, I'd probably start with carrying to term because it's a little bit more about that proactive Health assessment kind of getting things checked out to see whether or not there might be a reason or just making sure that your health is kind of in Tip-Top shape. I also recommend carrying to term for couples that might be concerned about miscarriage for one reason or another because there are a lot of things in there that can help reduce your risk, even if you've never had a", " Loss so yeah, we did interview Dr. Shaheen on the podcast you recall what episode that was? Yeah, that was episode 32 yesterday's episode 32 with dr. Shaheen and it was episode 36 with dr. Robertson great. Perfect. So our next category is male fertility. And this is a this is another category. That only has one book in it because it is one of the very few do-it-yourself resources for men.", " A book is called fueling male fertility and it's by Lauren moniker and she is a registered dietitian. I'm with quite a lot of experience actually and she has recently opened a practice helping couples who are needing some help with nutrition around trying to conceive and you know, improving egg and sperm quality and I really love this book because I think it's good for men to have something that they can just do on their own that doesn't require them to go into a doctor or nutritionist and talk about the intimate details of their", " Sperm quality. I think that's something a lot of men kind of are very resistant to I mean, I know even as a nutritionist my husband doesn't even like to go to the doctor. So having to go to somebody else and talk about his swimmers might not be the most comfortable thing for him to do. So, I really like that. This is something that you know female Partners could listen to the podcast or read the book and be like here honey. Here's something you can do on your own or there's nobody kind of in-your-face asking you about these things. So that's one reason that I really like this and this is another evidence based resource. So this", " Is going to dive into why it's important for men to be focused on their fertility when I'm talking with clients. A lot of times. They're having trouble getting their partner on board. So this is a great explanation for why it's important for male Partners to be on board through this whole fertility process. It also goes over some really as obviously registered dietitian. She's going to be focused on diet what the best available evidence we have around diet and lifestyle factors that have been shown in the research to impact sperm quality and", " fertility success for couples and then how to go how to go about making some of these changes in diet lifestyle and then also supplementation. She goes into the evidence on supplements for things like antioxidants for instance to support a healthy conception. So this is great for couples who already know that they have male Factor infertility or for women who like I said want to gently nudge their Partners toward learning more without having to sit down and talk about this with the doctor or a nutritionist and we", " To interview Lauren on the podcast earlier this year. I guess I should say last year 2019 and that was episode 34.", " Yeah, so yeah, next category is bigger. It has three books in it. And this is all about infertility and going through fertility treatment. So dr. Haley kick us off with our first book. This is one of my favorite. It's starts with the egg with by dr. Are she's sorry not a doctor but researcher Rebecca Fett she's actually from the UK and she's written several books now since the first one came out and she has a", " Addition to it starts with the egg and just like the title says it's basically all about the science and research behind egg quality and how focusing on the health of your eggs can help you get pregnant naturally prevent miscarriage and increase your odds of success when you're going through IVF. So when you read this book, you're going to learn why a quality is really everything when it comes to fertility success, especially going through IVF.", " Owen toxic exposures and your environment that have been shown to affect fertility and how to avoid them. So one example is you really dive deep into BPA Plastics and will tell you why they're so harmful so you can better understand why it's so important to take the actions every day to avoid them also talks about possible contributing factors to fertility issues that your doctor may not have tested for yet. So maybe Spark", " Some thought around that and then also specific nutrients and supplements that support egg quality specifically and nutrition nutritional guidelines that can help support your fertility journey and then also recommendations for your partner to improve his sperm quality. So this is a really great place to start especially if you had it's been a while and you've been struggling to conceive or if you're working with an end a reproductive endocrinologist right now.", " We don't have unfortunately an interview with dr. With Rebecca Fett but we do have a really great episode Pretty popular episode on egg quality with dr. Jacqueline chassis. She's a naturopathic doctor that has been in the fertility specialized in particulate e for quite a long time so you can check that out and episode 27. All right. So next up in our fertility category is a book that is specifically.", " On nutrition for egg quality and IVF treatment. The book is called IVF meal plan and it is by our friend and colleague. Dr. Elizabeth Sheriff body. So this book focuses specifically on nutrition for egg and sperm quality leading up to and during IVF treatment. So it goes over everything that we know from research right now about how it diet affects egg quality and then takes you through 28 days worth of meal plans. So there's four seven Day meal plans in there and this is really going to help you out.", " Overhaul your nutrition to optimize your IVF success as much as you can. There are all kinds of Pearls of Wisdom and tips for Success that are peppered throughout the book and you're also going to receive some helpful advice on other things that impact fertility and IVF success such as avoiding hormone disrupting toxins. So this is definitely the perfect choice for women and couples who want to know how they should be fueling their bodies as they go through fertility treatment. These meal plans are also great for preconception nutrition. So even if you don't have", " Reason to expect that you might need to go through fertility treatment and you're really just looking for a well laid out easy-to-follow way to get started with preconception nutrition. This is a great resource for you. So we have interviewed. Dr. Liz twice on the podcast. The first time was in episode 8 and we talked to her about environmental toxin. She actually has a background in toxicology. So that's a great episode to listen to if you want to know about personal care products specifically that can have hormone disrupting toxins in them that are not good.", " For hormones and fertility and then most recently we talked to her in episode 53 of the podcast and we were interviewing her in preparation for IVF meal plan to come out so that episode is really focused on the book and how its intended to be used and she goes over some examples of what the nutrition and that book looks like. So if you are interested in this one episode 53 is a great one to listen to and that brings us to our final book in the infertility and fertility treatment category and that is called the", " Infertility Cure by dr. Randy Lewis. So dr. Haley tell us about that book. Yeah, this book provides an in-depth Eastern medicine perspective on infertility and how to restore reproductive Health naturally, so we don't have a lot of books or I guess any books on here that is Eastern medicine focused, but I think it's really important to have that perspective and we also hope that we're going to have more Eastern.", " Medicine perspective interviews on our podcast so we'll be looking some of those this year but more about this book is she talks about how to start changing your understanding of infertility and some of the misconceptions in Western medicine about fertility issues. Also, she talks about a discovery process for how to determine what specifically might be contributing to your infertility diagnosis from a Chinese medicine perspective.", " She talks about the Chinese medicine approach to restoring fertility, including balancing your energy changing your eating and lifestyle habits and using acupuncture and Chinese herbal remedies, and lastly. She talks about how Eastern medicine can support Western medicine diagnosis such as luteal phase defect premature ovarian failure PCOS endometriosis fibroids immunological disorders like autism.", " immune conditions and male Factor infertility", " So this is an amazing resource for those who are interested in seeking answers outside or in addition to Western medicine. And if you're considering or using acupuncture for fertility, or you're interested in Chinese herbal medicine, this is definitely for you. And like I said, we don't have a podcast interview yet with dr. Lewis, but we're hoping that she'll be on the podcast this year. Yeah this book. I really enjoyed for kind of how she showed the before and after in particular.", " Certain patients that had specific Western medicine diagnosed issues like luteal phase defect she kind of shows like the before and after of what a chart looks like prior to treatment and after treatment so you can really kind of see the impact of how something that Western medicine doesn't really always put a lot of stock in can can really have a profound impact on some of these diagnoses that we just don't have great treatments for in conventional medicine. So I think this book I'll need to read this again just because they're so much Chinese medicine info.", " In there. It's like it's almost like a little immersion and introductory to Chinese medicine. It's like like the beginning of an acupuncture Masters or something not to make it like overwhelming but you know, she really explains a lot of kind of the process behind how Chinese medicine diagnosis looks at fertility issues and the different organ systems that you might have issues and there's quizzes in the book to determine whether or not it could be like spleen insufficiency. And you know, I'm not I'm not an expert in them.", " Forgive me if you know more about this topic than I do, but it is really interesting. It's almost like you know and be on the pill where you get a quiz to determine what sort of hormone imbalance. It's like you're taking a quiz to see if you have symptoms that are consistent with some of these organ system energy and balances that acupuncture and herbal medicine can help with so it is a cool resource that we did want to include it here for those that are interested in that Eastern medicine perspective.", " All right, so that brings us to the end of our infertility and fertility treatment category and our last category on today's episode includes two books and we definitely wanted to include a couple of books on these topics because they are such common issues affecting women's reproductive health. So chronic conditions that affect reproductive Health at some of the two the two most common are PCOS and endometriosis and we have a book each that goes into these so we'll start by talking.", " About eight steps to reverse your PCOS. That is by dr. Fiona McCulloch, and she is a naturopathic doctor and this book is really aimed at demystifying the whole PCOS diagnosis for women. And as we know from previous discussions on the podcast, and of course for those of you that are experiencing this condition personally, it can be very frustrating and confusing and they're really just aren't that many treatment options for PCOS in conventional medicine. So in this book you're going to learn about", " At the latest research about what's driving the condition how to accurately assess for and diagnose it and how to work through some positive changes that can reverse your PCOS diagnosis improve your health and also boost your fertility in the process. So we highly recommend this book for any woman who has been diagnosed with PCOS or just based on evaluation, maybe suspect that she might have it or perhaps the practitioner is kind of thrown out PCOS is a possibility. This is a great book to read so we don't have", " An interview with dr. McCulloch on the podcast yet. But we do have one with another naturopathic doctor. Dr. Kevin oberoi and that covers many of the same topics that are shared in this book and she she really speaks highly of this book in that episode. So you can find that interview with doctor oberoi and episode 56 of the podcast which is relatively recent. So some of you may have had the benefit of catching that one already so that covers our recommendation for PCOS and our last book that were", " amending this week on the podcast is called the four-week endometriosis diet plan. This is by Katie Edmonds who is a nutritional therapy consultant. So she studied at the same institution that I did. She just got a slightly different certification. So dr. Haley tell us about our last book on end. Oh, yeah. So with endometriosis we know that it's a highly inflammatory condition and so diets going to have a big impact on how we are able to control this specific condition and to", " Boost fertility. So this is a great book that teaches you how to start making positive changes to your eating habits to support healing endometriosis and it provides an introductory guide introductory guide to approach to understanding the different factors that contribute to endow and it also gives you the typical treatment options that are available for Endo and then it will dive into a 28 Day meal plan that you can customize to meet your", " Visual needs so this is a great starting point for women who have or suspect that they have endometriosis and dietary changes alone. Like I just said it can have a significant impact on pain relief and improving fertility for were a lot of these women now, we don't have a interview specifically with Katie on the podcast yet, but we do have two episodes about endometriosis. So if you check out episode 13, it's an overview of the", " And how to address it with functional medicine and episode 14 is an interview with a colleague and a friend of mine who have been using nutrition and functional medicine to heal her endometriosis over the past few years.", " So that is the end of the books that we recommend so we know that we kind of threw a lot of books that you and don't worry. There are all in the podcast description and also on our website tinyfeet dotco for it / podcast. You can find the podcast link and be able to get links to these books. And also hopefully you get a chance to be able to listen more in depth with any particular topic that sparked your interest to the episodes that we mentioned.", " The previous podcast episodes awesome. Well, thank you guys so much for being with us again this week and we will look forward to seeing you back next week."]}