{"showID": "00btWOTB484ro3OgZKDle6", "show_name": "Game Artist Podcast", "show_description": "Welcome to the Game Artist Podcast where we interview amazing Game Artists to find out what makes them tick and how they got the job of their dreams.", "episode_name": "Erick Sosa, Freelance Toy Sculptor & Designer", "episode_description": "\"I believe that the state of your mind controls how you feel. ... And that you can control whatever you think you can achieve.\"  For our final Podcast Episode of the Season, we leave you with some great words of wisdom from Sculptor Erick Sosa.  Season 2 will start in a few months.  Happy holidays and ... See you in the new year. :-)  More about Game Art Institute: www.gameartinstitute.com More about Erick Sosa: https://www.artstation.com/zkulptor  Want to be a Character Artist or an Environment Artist in the Video Game Industry? Apply for your spot in our upcoming Game Artist Bootcamp here: www.gameartinstitute.com  ", "duration": 51.28706666666667, "transcript": ["Hey there, welcome to the game artist podcast. My name is Ryan Kings line. I'm the founder of vertex school where we train creatives for the career of their lives in this podcast. We interview amazing creatives to see what makes them tick and see how they got where they are today. So sit back relax. I look forward to sharing their Journey with you.", " Before I turn you over to the podcast. I just want to remind you that this podcast is made possible because of game art institute. So if you're interested in a career in game Arts either in character arts or environment or one of the other directions that we are moving into in game design, for example a rvr then head over to game art institute.com the specialty the thing that we really focus on there and that's really important is that we pick up where almost all traditional", " Bowling fails we pick up where it really matters when you're trying to get that job right now. You may have gone to school. You may know somebody who's gone to school and they spent $100,000 and they have been woefully unprepared to get that job in the industry because this industry doesn't care. If you went to Harvard they don't care if you know Jimmy Jack Sally Sue they care about your work and that means that you've got to be in a place in a state in a way where you are focused on producing.", " Reducing the highest quality work that you can possibly produce. That's what we do at the boot camp. You come in we get focused and we produce results. So head over to game art institute.com. You can head over to the student work or the alumni page where you can see what our students are doing that'll give you an idea of what people are producing and if you're interested make sure that you apply today so we can get into the phone call with you and we are looking for students and we have spots to fill.", " So make sure you give us a call and I look forward to chatting with you then. All right now back to the programming.", " Okay, welcome everybody. Alright Eric. Thank you so much for joining me.", " Thank you, Ryan. Thank you for inviting me. Absolutely man. I've been wanting to get I was telling my earlier class. I've been trying to get you to teach forever. And so now my strategy is to is to try to teach you how to create your own Academy, you know, because this knowledge that you have like has to get out. I think it's you know, it's really weird that it's not because", " II mean, I don't know if you remember I sent you a message because I saw your email about the creating a webinar. Yeah, and I've gotten to a point in my career now where I don't know. I mean you're probably aware of it, but I'm not freelancing for anybody anymore. Hmm. I decided to retire from that last June. Yep, and I've been wrapping up projects and everything. I'm still finishing some stuff, but I mainly like free to just focus on my own product like this character that you see on screen. That's part of my next.", " And but I feel that it would be a lot more full feeling to actually share, you know, whatever little knowledge. I've acquired like I don't know 20-something years doing this and honestly, I'm thinking I'm thinking I want to do that. You know, I think it's it's a good thing. I'm not saying like full-time or anything but on a more regular basis, which I've I haven't really ever done that so yeah, so why don't we start with a bit of an introduction like what do you do?", " Today like what's the primary thing you do that, you know pays the bills. Okay. Well here well, first of all, I started I started doing this like sculpting when I was like, I don't know like for whatever but before I get into what I do nowadays and when I was in high school my high school teacher got me into Mattel toys and that changed everything for me. Well when you're in high school, yeah, I was in high school I was", " I was I was like 16 at the time I think is my junior or senior year something like I can't remember I'm old now and and it was fun. It was amazing. Just just going into this government type facility where you know, they have like to scan like your badges and everything. You have to go through like two or three security doors and everything. It was amazing and then like I it was like being at Willy Wonka's and I like the doors would open and you see like people play with toys.", " And I people deciding and a bunch of cubicles a bunch of toys. Yeah, it's amazing. I love that face and to this day. I still help them out with with projects and stuff. But mainly I've stopped doing freelancing for for most of my clients as last year and and I've been focusing on on my company prototype studios though. The whole idea behind prototype Studios is just too", " Create product that the truly kind of comes close to what people see in terms of like, you know our ads or like the images that we show the product. So like you know that we're trying to basically create product that comes really close to the Prototype and that's very tough. But but it's possible to create something that looks exactly well not exactly but really close to what", " What you see on screen when people are like shopping for our product. You won't be let down that's what I'm trying to say. So yeah, so that took a lot of effort and work and everything and QC and and a lot of stuff in China. But um, but it's paying off and right now we just released our second character and in our street fighter line Akuma, and yeah, the reviews are great. So so that's what I do. Now. I've been doing freelance for like I think 15 years 16 years.", " I've been in the industry since 93. So it's been almost 24 years or so. And yeah, and now like I'm just looking forward to being able to do not just like earn a living by creating our product but giving back to the community. I just signed up for the Los Angeles Public Library System contacted me and yeah, they wanted to like travel over the city and throughout the state and maybe even the country teaching like half an hour like", " Classes like you know really compact really, you know aim that at children and the youth yeah, you know about like, you know, my career what I did all these years and what it is that you know, they can do in the future what it is that they can expect and it just answering questions showing like little demos and stuff. But yeah, it's that's what I'm looking forward to doing more in the so what would you say your job is your job title digital sculptor toy sculptor. How's that work? I don't know that because I've been a tradition.", " Sculptor since like 93 and well actually professionally. Yeah, but I've been sculpting with Clay my whole life and my approach to 3D is like it's extremely basic and very I don't know just just course, you know, I I just use like the claybuildup brush the clay brush trim Dynamic standard.", " And I don't know pinch the union standard and that's it. That's all I use. So I'm not really technical when it comes to the software. That's all you need. It's all you need. So when you're talking to these kids, do you say like you're a sculptor? Like if somebody's looking at the job that they would do so people like, you know, I'm a toy designer. I'm a sculptor A lot of people go like, oh, what is that?", " And they wanted me to keep doing some some more stuff, but I just decided that it's probably for the best for me to move on and into this New Path. And yeah, that's what I'm I", " They were part of the announcement that you're retiring from freelance. You're going to work with them full-time. Remember a yeah. Yeah. Yeah. And so now is it fair to say that you're starting your own company focusing on IP basically developing IP, actually. Yeah that that's actually correct. I'm actually working on a line right now that is like completely original and I'm exploring the possibility of getting into toys as well. Just original stuff. Is that the issue?", " In our industry right now is like completely completely overpopulated with similar product. Yeah, and getting licenses has become like really tough because when you're about to like get a license, there's already like Q or a line of like 10 companies that want to get the same license. So even if you're able to get it, there's going to be like a lot of competition for basically the same type of license the same type of character some product and you know,", " So that's that's become really tough for the Collectibles industry, but I do believe there's a market there but you're like people can see like original Ip. So that's awesome. So what do you tell people when they say they want to be a toy designer? You know? Well, I think it's a cool thing because like, you know, the toy industry and the Collectibles industry are like basically they're part of the same family in a sense, but the Collectibles Industries like really tiny.", " Brother to the toy industry the toiletries a lot bigger, but if people want to become like for example when they asked me to go I want to become a threat to Center. Yeah, that's feasible. That's great. Pay is great. Obviously depending on who you're working for. But but the Collectibles industry is a lot tinier there is work out there but not the same as before because there's just like there's just like too many companies doing a lot of stuff so that kind of tends to", " to bite back in a sense where whereas you used to like, you know work with one or two clients a year in order to survive. Now, you have to probably like well people nowadays have to like probably have like, you know, try to get like ten clients so that they can get less work for me but enough in volume to survive which is, you know, a little bit tougher tougher in them. So garnet and is Side Show an example of a company working in collectibles.", " Yes, I choose like the king of Collectibles the stuff that they do. It's not just a company that really seems to understand and grasp what it is that people like and and that sense. They come to a point where they're on top. They're they're they're the King of the Hill from my perspective and you know the product they always keep pushing themselves and the product that they're putting out is like just amazing the the signs and everything. It's just great.", " It seems to be like they kind of mix the system that you use and in a large like special effects Studio or a movie like, you know Film Studio whatever and they got into the coal Collectibles, you know Arena and they came up with a really awesome system where you know where you see like how they go about like creating the concept and everything brainstorming and everything. It's just amazing. It's pretty similar to like what happens in", " You know film studios, so it's a pretty cool thing. Hmm. So how does somebody get started? What do they need to learn to get into this? Well, one thing that you need to learn more than anything is like I think it's you need to know exactly what makes you happy for some people it could be like just you know trying to do like, you know more abstract designer toys for other people. It might be something like working for a company such as like, I don't know Sideshow or me.", " Arlen where they require things to be like a little bit more realistic. So in that sense, you need to learn more human anatomy take life drawing classes. I don't know if you agree with this, but I have this point of view that or I believe that if someone wants to get really good at sculpting they need to be really good at drawing then again their sculptures that are great at what they do, but they can't really draw that well, but I think it does work the other", " our way around whereas, you know, someone can be a great sculptor but not really draw a really well. It's really funny that if if you're really good at drawing into the you can get really good at sculpting. So I've seen people like Ray Bill laughing whoo, the sculptor that used to be in the industry in the colliculus industry and he was a kindergarten teacher and he would draw like amazing like in a really cool drawings and one day he picked up Clay and he was a pro like overnight serious.", " No job and I do believe there's a connection there. So yeah, you know, I have a I have this belief that sculpture is the first art and you know, because it's like it's 3D so it's in the you're basically replicating something that is in the same form, right and then painting and drawing our artificial their artifice. You have to interpret. Yeah. I see what sculpting it's more tangible and you can keep you can do that and", " And into the as well where you can actually keep like refining but it's more tactile. It's more. I don't know just more natural. I guess that sense. Yeah, so if we're talking about, you know, sculpting and Anatomy, this is actually a conversation you and I had a while ago because you you dive deep into Anatomy some time ago with Ray Bustos, if I remember right? Yeah. Yeah. Yeah, and so one of the problems I have myself and with my students has an", " Me is you know, you say hey go learn some anatomy and it's like welcome to the next five years of your life. Well, where's like one year disappeared and I well I sculpt better and I know Anatomy but you know, like where's the cutoff point, you know, because the other thing that's important here just to kind of keep going and I notice is specifically in yeah specifically in toy sculpting is you know, there's we're not really focused on realism, you know.", " Like Michelangelo would there's a there's a an impact that somebody's trying to make so the deltoid, you know is not going to be necessarily like say Richard McDonald deltoid. It's going to have some volume and pump because they're going for a style. So how do you manage the style of things with the realistic anatomy of stuff? And where's the cut off so that somebody doesn't just spend a year of their life, you know going down that that black hole. Well, I think I think it is very important to learn the", " Six of structure and atomy I don't necessarily believe that you need to be an anatomist and and know every single tendon in the human body and right. I don't know like, you know artery and everything and nerves everything but it does help to know. I mean if you look at Steve Lord what he can do the man is amazing. He can do anything. Yeah. He's a gift to sculpting first time. Yeah, exactly. But I do believe I can never tell with my anatomy of", " You study my anatomy. I mean anyone that really knows about Anatomy will know that a lot of my stuff is completely exaggerated granted. That's given me in a sense. That's that's kind of set me apart from a lot of people and yeah, you can say that. Well, yeah, but you know, your Anatomy is like wonky here. It is true II, I do believe that's the way it is and that's that's my purpose to create something. That's more of my artistic interpretation of say a bicep.", " You know apps or whatever, you know, Victoria muscles. It's just I I mix what I see in anime. I mix what I see and comic books American comic books and just like, you know art all around me and and and there's these guys like the Shiflett brothers and they tend to make these characters that look so real but at the same time like it's just fantasy anatomy and it's just it just works. It is mind-blowing. Yeah and", " A good example of that in terms of 2D is Simon Bisley. If you look at the the art assignment visually, you can tell that the man knows his Anatomy but he adds muscles that are not there that don't exist. But he just makes my heart all the better and that's the approach I have to it and all of you will go like Eric.", " This muscle right here doesn't exist on my God. No, I just I just thought it looked cool. And that's it. That's my Approach To be honest. And I think you can be a great sculptor and know Anatomy really well, but I've seen some sculptors that can do really really cool things. But it all seems to look like like just the same as their last piece and it's just like the flow the of the anatomy of the", " Everything is like it's a little static, you know, and and and and I think like, you know, you can play with it. You can just you just like, you know been things like I'm really well-known for for example doing things like like I don't know if it's here or not, but I don't know what this Magneto we can see it, but I'll probably like grab like, you know the legs at this point and then just use the move brush and just like basically curve them a little bit just just ever so slightly.", " Lightly and by doing that it just creates this this flow to the whole piece. The silhouette looks a lot cooler and more Dynamic and people seem to be attracted to that. And that's worth for me. I'm not saying that that's the best way to do it. I'm not saying that it is correct. I'm just saying that I like it personally and you know, it seems that there's people out there that like it so yeah. All right, but but now I have to bring this up right because", " Where is well? Let me just say this way and and I'm not trying to be derogatory cuz I'm kind of a fan of his work. I have a couple of this covers up on my up on my wall. But at what point does this become Rob liefeld where? Oh, yeah. Well, I think it's you have to kind of", " Have control at a certain point, you know, when we talking like, you know Comics or whatever you can only go so far. You cannot go to insane. I cannot just like grab this guy and say, okay, I'm Gonna Make You know the pecs like, you know pop out.", " You know a lot more, you know, and boom I got you know that obviously people are not going to like that. You know, it's just completely deformed and it looks like wonky but I mean within the parameters of realism you can I believe that there's leeway for you to play one thing that a lot of artists do is that because you know, I get I'm pretty sure you get those messages constantly as well emails or private messages. They tell me like, oh, you know my family. My mom says that I'm a", " Artist or a my uncle says he's you know that I'm a great artist that I'm going to make a big and then I see the work and you can tell that the person you know needs a little bit more practice, but then I've seen a lot of these people that keep listening to like you no friends or relatives or whatever, you know, you have to understand that these people love you and they don't want to hurt you and for the most part they are probably not artists and they'll say like, oh that looks cool to me, you know, and and that's good good at all. But if you don't", " Don't become your worst critic. You will never grow I think that's the worst issue that us artists have like if we think like we reached the Pinnacle. That's when you stop growing. That's when you stop like learning and and a lot of people like will message me or post like when I'm whenever I post something, you know on Facebook or something, they'll go like oh, thank you master and that really I mean does it upset me? But it just makes me feel uncomfortable because I I know in my mind deep inside.", " Me that I'm still learning. I mean if you look at my work say that just a year ago or six months ago or two years ago. You can tell that I've learned more and more and I keep refining like crap and I just don't feel I'm at that level and I think I'm gonna be 80 and I'm still not gonna be happy with what I'm doing. I mean you can say like I'm enjoying this but I'm not going to say like, oh, wow, this is the best. I am the best. I don't think it works in that sense. And and if you think that way", " You will just like stopped progressing and I think art is about you know, the stuttering learning, you know, and that's what makes it fun. It's a journey it's a journey that to me. I don't think it will ever end. I just don't think so. I don't think I'm gonna be like a hundred and say okay. That's it. I'm done. I learned everything I needed to learn about sculpting. I just don't think so. So, you know, I think my best advice would be", " to check yourself and and and keep searching for", " yeah, I don't know like for that point where you feel that you've grown but but never get to a point where you think okay. That's it. I know everything because that's bad career for you. It's just not cool. Yeah, you know and I think this is one of the things that's really attracted me to this conversation with you is you know, like in the process of me trying to get you to teach I always ran up against this wall. We were like, I'm not I don't feel like I'm a master. I don't feel like I'm ready and", " Don't feel like I'm there to teach and I'm thinking like in the back of my mind. I don't know if I ever said it directly but I'm thinking like that's why you have to teach right? It's because it's because people have to see that so I'm glad we have this conversation. So so people can understand this but I want to dive a little deeper into this because for me in my experience this has been this conversation has been one of the primary conversations I've had with myself which is, you know, I don't have into Anatomy thinking that one side of into", " Me I would be ready to go out there and create something but what happened was is I dove into the anatomy and that made the walls bigger and you know, I saw everything that was really had to be done. And then I saw the people that actually really did it well and I was like, you know, and so all I thought my I would be able to achieve but all I did is I raised my expectations.", " I see what you're saying. You know that just like that's that, you know, put some serious walls up. But what I notice about people like yourself and and some of the other sculptors like Steve Lord that you know are really going out there and creating on a daily basis is is you don't have those walls or if you have those walls. It's like you're jumping those walls all the time. You're still creating you you don't worry about what you don't have you just go.", " Yeah, actually I was going to say that it's not really there's no secret. It's just like you just go and it's not just", " In a sense, it's not just about creating art and just just going and jumping these walls. It's like you also have other things that are other issues that you have to worry about like for someone in my case. I have four kids. I have a wife. I have a mortgage as you know, and and I have to make the best of it. I can't afford to just stay stagnant and not do anything not practice not like I mean I have to be honest. I haven't drawn and a long time but I'm always sculpting every single day and I believe", " When I actually pick up a piece of paper my drawing is a lot better and I that's all I can tell like oh, okay, so I'm getting better. That means that you know, I'm doing something right. But yeah, I just sometimes you just can't afford to stop for many reasons aside from just doing what you love but I think that's a good thing. I think it's a great thing. And so it pushes you to push your boundaries and you know, sometimes you do it right sometimes, you know, you learn and you go", " Like okay next time the project that I make or the next Magneto I make it will be a lot better. I can see the issues with the one I just did like six months ago. Yeah, and I'll try to you know do something better next time around. Yeah, I'd love to dive into that a little more if I can because like that. I see it in students. They have the luxury of stopping to learn and then you get into the library in your library mode and you know Librarians don't go out there and fight the daily battles, right? So but when you're out there in the arena and you have to", " You know what the strategies that Survivor the strategies that win. So what strategies like, how do you get into that mindset where you just keep going? And you don't stop because you're learning but you're also still going so you know, what what kind of strategies what kind of mental like, how do you play that game? Any so that's actually that's actually a great question man that no one's ever asked me that that's actually great question. I this just me personally.", " I am a geek at heart. So one thing that I do is that if I'm actually resemble I wake up in the morning, you know, like 6:00 in the morning. I you know start getting the kids ready for school take him to school come back. I have a really quick breakfast I go to the gym because now I'm working out because I stopped doing that and I recommend that you never stop working out because that's that could also believe it or not that influences your State of Mind totally mere yeah that effect.", " Art that affects your development and I've learned that it's important for me to do it. I mean, I'm not a I don't live there but you know the gym but I go three times a week. I think that's cool. I rest in between you know days and and I'm eating better A lot healthier and I feel a lot better. So when when I'm when I come in here like at 10 in the morning and I'm ready to start sculpting I try to pick up a comic book or whatever it is that I'm going to be doing if I'm going", " to be scoping werewolf. I'll probably watch like, you know, I'll start watching like, you know werewolf movie or anything that's related to the subject that I'm sculpting. I listen to a lot of soundtracks believe it or not really epic soundtrack just like get me pumped up and that helps a lot and then mentally I always try to visualize what the character or the piece will look like completely done. I try to visualize what people will think of it when they see it.", " And I don't just I you know, I think of something like peachy and nice and perfect I think of scenarios that could be negative like oh, well, you know, what about the fur Eric? You know, I'm looking at your piece that you did and the fur doesn't look so clean. So I try to make sure that I cover all bases as much as possible take some notes and as I started developing or sculpting the piece and you know, I can start from a dynamesh ball or like a base mesh or whatever. I make sure that what I saw in my mind.", " I try to go over those notes just to make sure that I'm covering all bases and and just going through the motions like that. It gets it actually gets me pumped up. I believe that your mind the state of your mind controls how you feel and basically you have your own little thermostat, you know, and and you can control how you feel. A lot of people say like no I'm depressed. I really can't control that. I believe personally, this is just for me, you know, this is just", " You can control whatever you think you can achieve. So if I feel sad and I keep attracting or thinking of these negative thoughts. It's going to get me in a bad mood and it's not going to help me get the project the project on but if I start thinking like, you know, if I don't feel well and I'm having like that thoughts or whatever this morning I start thinking positive things. I'd pop in a movie that's positive or whatever upbeat music whatever it starts changing my whole environment from the inside.", " I'd and then that makes me want to give it my best. But if I don't do that, then you know, it's like you know that movie In My Head Starts controlling everything and I'm not going to let that happen because if I do that's gonna create issues with with with the project and eventually I meant might end up living under a bridge so I don't want to do that as much as possible. You know what I'm say, so totally don't have you ever like, you know, come close and and then that", " Jumped you into action. So, you know, you know what the what the results are. Yeah. Yeah it I do it all the time. I do it every day. Sometimes I struggle to be honest. It's come to a point where well, I've come to points in my career where honestly I just don't even want to come into the studio like it's happened. Like I'm just so burnt out and that's one of the main reasons why I quit freelancing systematically. I just honestly I was just", " tired of doing what someone else wanted me to do when I knew that I could probably create my own vision of this or that and and and in the beginning for like the best like I would say like the first maybe 10 years of my career. Honestly. I was just like happy with I was content with sculpting anything. It was like if it was like a hand or a boot or or rock or whatever. It didn't matter to me. I was just like so happy doing that and it's really weird like I started", " And through this transition where I started feeling like, oh, well, this is cool. But we're going to be cooler if I was doing this or if I sculpted this got Scylla this way, like if I elongated that's not a little bit more if I make made him creepier this way, you know, and I started thinking like OK I have to like create my own. I don't know like like platform where I can actually give people what I like and if people like it and they buy it all the better.", " And that's what I did with prototypes. That's how I started doing that and and and to be honest. It's it's something that works. Like if you if you control your thoughts, you can control anything. It's like sculpting man. It's the same process. I believe like you control your thoughts you control your actions you control your actions you control, you know situations if you can control that you can control your destiny basically and I believe that it is possible. It's just a matter of", " Of being aware of your thoughts sometimes like it happens to you. And I man, we're you know, we're tired we wake up we take a shower we're eating like having breakfast and we're reading the cereal box. We're reading the ingredients and that's all we're doing. We're not doing anything else, but what if we control our thoughts and just like when we're focused like sculpting or doing whatever being creative what have we were creative about our thoughts and and start like, you know reinforcing that image in your mind with positive thoughts and then the movie that place in your mind.", " Becomes positive and then then you go. Like whoa, I can do anything. I can achieve this I can do this and then you start getting ideas about oh, you know what I could open a studio doing this or I could create this the next best toy line or something or action figure line or whatever and then you see that as you start working on that to achieve these things doors open. I've seen it with you man. I always there with you when you started doing all these things like teaching classes and you are mighty", " And I will be forever thankful for teaching me that secret surprise that you did and and I saw how you were struggling and trying to get people in and letting people know that you know, this is the next best thing and you need to learn this software. And at first I was adamant I was like no, I really think I need to learn this. I already put in so many years like learning how to work in wax and Clay but you made a Believer out of me and I'm pretty sure had you not been so focused and and", " and so gung-ho about doing this a lot of us probably wouldn't be doing what we're doing and that's that's that's basically evidence that", " Doing things that way can change not just your life but a lot of people's lives so and that's awesome. Thanks Batman. So what I heard there was that like the key component was the prep for getting into the studio. So, you know, do your exercise eat get yourself moving there and then to kind of modulate the time in studio if you're not getting into it and whatnot, you know just have external elements like but some music on", " yeah, read some Comics go to the comic book shop and shop for something that for a comic or it doesn't necessarily have to do anything with with the subject that you're trying to sculpt but maybe you'll find the car book that that has like certain, you know line art that looks amazing that you can Implement into your interior work and and that's what I do and I'm always looking for these tidbits of information coming from", " Different peoples like art or interpretation of the character and I'm working on or or something similar and that actually enriches my my own art. I think that's a it's impossible for you to just say cuz I heard people say like, oh, well, you know, I just want to create something. That's so original that you know it no one's ever done it before there's this video on YouTube that I recommend people watch. It's called everything so remix and I think it's true. You can just grab like, you know elements from this and this and this", " Some type of Art and then mix it blend it and then basically give it your own touch and it becomes magically a new thing and and that's what I try to do man. I'm not doing anything, you know out of the ordinary. I just basically try to mix elements and things that I like. It's like when you're at the I don't know when you're at the what's called a pizza read this place out here in California and you want to make your own pizza and you have all these elements write all these ingredients and", " you just go. Ok. I want to live it of this and this and this and this and then you come up with your own pizza. That's that's basically what I think I'm doing with my stuff, you know Works some people seem to like it.", " Some people don't but you know for the most part it's done well for me. So how important is it in your opinion that people be inspired like on a daily basis. Yeah. I think I think that's the cool thing about being an artist is that", " We have this internal flame, you know and you have to be careful for it not to go out and the way you feed it the way you keep it alive is by by looking and admiring other people's work. I think and just everything around you, you know, and I've heard some are to say that go. Yeah. No, I just don't look at other peoples work. I just, you know focus on my own stuff and it's really those are the people that I see that don't really grow. Like I said, I think", " They're important for you, too.", " You know remain aware that that you know, you need to feed that flame and it could be through a movie Sometimes Ryan. I'm I just I just get to a point where I hit a wall and I think it happens to a lot of us where I just feel like oh, yeah. I can't I have sculptors block. I can't forget that scope in your mat. And and I know in my mind I can but I'm just like, okay. Maybe this is my brain or my heart or whatever. You want to call it telling me that I need to take a break.", " And I'll see what I do. Is that I've learned now that what I have to do is just like, you know, maybe go to the movie movie theater. Sorry go to the movie theater and get inspired by say, I don't know Pacific Rim or whatever sci-fi movie that's playing when I come back man. I'm I realized that that flame has been fed. It's burning inside of me. And all I want to do is like get back to my desk and start sculpting and and finessing and adding all these little details that", " Maybe I might have captured either. You know, I just like really paying a lot of attention to the movie or just like letting myself go and and just trying to bask in the whole amazing. I don't know group of elements that that the movies like throwing at me, you know, whether your dad consciously or not. It is that you're feeding that playing and then when you come back and you bestow that into your work you and view your work with with that kind of", " Inspiration it you'll see you'll see it works. It just you just feel happy to just be doing what you're doing. But sometimes you just need to push and like I said, I explore every single tool that I have and that could be just like Comics or a book or audiobooks which I listened to those much more than actually reading and sometimes I just go to Art station and I spend hours just looking at the work of these magnificent artist out there and", " That inspires me so much man. Seriously, it's whenever I feel like like blue or stock or something. I just look at the work of others and that that kind of like brings me back, you know from the abyss. Yeah it do you think there's ever a time where you know or a benefit to just pushing through, you know, when you're when you're lost or you know, you get that sculptors block or is it something you have to recharge? Yeah, you know one thing that I've noticed and this is again, this is personal. Sometimes I just feel", " Sad, you know like tears I feel like something's missing. Yeah, I feel this way. It's went out my wife. We went to movies. It was cool or we you know, I know we went out to dinner whatever and everything's cool. But then I realized that that I have probably been neglecting that one piece that I started like maybe two months ago. Hmm, and when I get back to it and start working on it, I might not really be as his fired and when I push through", " Then I have actually discovered that oh, wow, this this could be a great piece. For example a few months back. Well, basically your last year I was here and and the studio and I was really tired and I had you know, exactly I had basically an ounce that that I was not going to do freelance. So as soon as I did that a lot of companies are saying okay, can you do this and this and this and this before you and it was I got crazy man. It was cool and I'm grateful for the work. So anyway, so, um,", " But at the end of the day like I was like so burnt out, you know, and but I still felt like like this emptiness that I feel like I don't know why I feel like there's something else I need to do and I'm like when I'm done I've been working on this thing for like all day and then I just grabbed a dynamesh ball and started sculpting just just just without thinking and I ended up sculpting these things called Chi juvies. I came up with that stuff actually came up with the name my friend William and basically", " They look really cute. They're like, you know, I did this like King Kong like baby and they look like little balls of like fur something and they're cute and I actually had a couple of companies like interested in buying them, you know the whole line so I'm actually about to produce these myself. So and it's exactly Kaiju Teeth movies Yak. I do get the machine. Yeah. The machine is just a basic page and you can see a", " But seriously, man, I get a bunch of emails from people saying that I want to buy him. I want to buy him and I still have not started producing them, you know, but does that been wrapping up a lot of other stuff but uh, but I hope these things like an oak and eventually sell at Walmart or Target or whatever and I've been getting quotes from the factories. They tried everything and to be honest like it's feasible. It's possible but that never would have happened had I not stayed that night. I know for a fact that can I not State and push through I never would have seen", " In the birth of these little guys even even if nothing happens even if nothing comes out of these I know for a fact that people like them a lot and that in itself is just just makes me happy knowing that there's a few people that owe some copies because I made some resin copies and we sold out at the signer called last year where we have a couple see those have sold out, huh? Where did people see those at the signer Kang? Oh, yeah. He said there was a website.", " Oh, yeah, it's a monster in the machine.com.", " Nobody's got that URL.", " No, I think I think actually I don't know that name came about when I was watching this. Anime called The Ghost in the Shell and I was like Ghost in the Shell but about monster in the machine anyway, so they're they're awesome. There was like a band. Yeah that anyway, but they're not around anymore.", " But yeah, and did you just cute and they have big old black eyes and everything and and people love them man and my kids like them a lot when they saw my God, he's so cute because it can we get a coffee and so I made a bunch of copies for them. They started painting them different colors everything and but yeah again man, if I had not pushed through when I was at my limit, I never would have come up with these things. I know for a fact because the idea came to me as I was just", " You know, I just grabbed a diner dynamesh ball and started. I inserted a couple of big ol eyes like spheres. Mmm and then adding the eyelids and that's what I know like, oh I can turn this into like a like a baby Godzilla kind of thing and then like into and then that's it. The first one took like three hours and then the rest of like an hour and a half each and that's it. You know, I printed them in my form to", " Had my friend George cast all of them and I started selling them like they're the size of like golf balls, you know? Yeah, and then I made versus are the size of a softball like a lot bigger. And yeah, man, they sold out. They people keep emailing me and asking me and I feel bad because I have not been able to like answer all those emails. It's a thing, you know, that's also I know I might be sitting on a gold mine and I have no idea. All right a couple of questions for you.", " Andrews asking do you still work in clay in wax? Actually I am right now I'm working on I mean I have not done that in like maybe an over a year I go to Japan like every year for this thing called winter wonder Festival. It's a place where all the sculptors in Japan gather and they sculpt their own original Ip creations and they sell mess kits and and basically I", " I did this bus and that was the last piece I sculpted like a year ago and play and wax but right now I'm sculpting Gamera from you know, licensed Gamera Kaiju. It's a turtle kind of looks like Godzilla and that thing is huge. It's the size of I don't know what scale that is because it's a Kaiju so I don't know. It's like 18 inches tall.", " I'm sculpting that like by hand completely in super Sculpey. Oh nice. Oh, that's that's that's going to be a lot of fun because I'm just working on the Armature right now and setting everything up and then I'm going to start covering everything and it's super Sculpey that's going to be fun. I'm going to be showing that on my Facebook wall. Hmm. Yeah people can see like the videos and pictures and everything because I know a lot of people are always asking like, oh can you sculpt something and clay and show us the steps? So I'm going to be doing that so", " Yeah, that's awesome. Yeah, I don't get to that much to be honest. I just don't anymore. Yeah. Yeah zbrush is kind of two essential at this point. Yeah, it's super essential. I believe that if it wasn't because of zebras, like seriously, I literally would be living under a bridge. So just so you get an idea before having my own horn, but I'm a pretty quick traditional sculptor and I used to do maybe like 25", " Projects in a year maybe 20 sometimes but I'm talking like bigger stuff, you know not tiny things and also counting like, you know accessories and things like that. So but now with what the software I can actually I mean I've sculpted I think two years ago. I counted like 75 projects, you know, so so yeah, you can do a lot more like one person becomes like an army of like maybe like three guys, you know, yeah, that's great. I love how all of your problems always end up.", " Under a bridge to so so we always know where to find Eric if the problems get too big. We just gotta find the right bridge but nla is got a lot of them. So yeah, that's true. All right. George is asking it's a bit of a business question. He's asking how much of your sculpting choices are influenced by what you personally like to do versus, you know, finding the popular demand so to speak", " Well one thing that I do to be honest is that I am very active on social media and like, you know forums and stuff like that. And yeah and I listened to what people want because obviously ultimately what I do is actually a business and you have to give people what they want, you know, and you know, I kind of like basically conform or within those parameters of what people like I just do what I want as well, you know, but", " But that's basically what I do. I just listen to feedback and obviously you can't listen to everybody because you know, some people say like, oh that Magneto for example like oh, why are you making them floating? You know why like maybe like 80% of people want them like floating so so I cut to listen to the majority of the people so, you know, but there's been occasions where like a guy will say like, oh that Wolverine he should probably at like", " Maple Leaf, you know because you know, he comes from Canada and that will make the statute look better and I've done that and then you know, I just don't post it or anything they'll post pictures and then when they actually opened the box they see that they go. Oh, wow, this guy listens so that that I think that in itself actually people people appreciate that a lot. Yeah, that's actually connect with your audience. And that sense. It's pretty cool. All right, man. Well, I have an awesome time chatting.", " You and thank you so much for kind of diving into process because that's what you know, I really enjoy just your thoughts and on the philosophy of this. So I'm glad we got to dive into it. Thank you. Thank you Ryan again. I'm not I'm not saying this because I'm talking to you but I am so thankful for everything that you've shared with me and throughout the years. Sometimes you'll send me videos and everything and I thank you for that. And I know that you're always like your main concern is to actually spread.", " The knowledge of these things and a lot of us are super grateful for everything that you do man. Thank you appreciate and thanks and maybe we can we can get you with your own Academy going that would be awesome actually Ryan and you know, I'm serious. Yeah, whenever you have time, let me know when we can talk. I really want to do it. I think the one thing like I said that really makes me happy now is like being able to share these things with people. I mean as you know 3D", " Doesn't have just a few applications. I mean you can actually create stuff that that could save lives like for example, you can actually probably skull, you know, like synthetic years and things like that and we're laying if somehow I can help someone understand that and make the world a better place and that says that would be so cool, man. Yeah if I can help in any way I will hire some yeah. Thanks. Great. Thank you. Thanks guys for your for showing up for being here and all right, Eric.", " Men have an awesome day. All right, man. Just remember you still owe me that chicken tikka masala recipe. Okay. Alright Joe. Thanks, Kev. Bye. All right, so I want to thank you so much for being here and taking the time to listen to this podcast and I want to ask a couple of things from you. Number one. Make sure you leave a comment or you rate this on iTunes or Stitcher or wherever that you're listening to this. It really makes a big difference in helping us get the word out and to help.", " People understand what we do. The other thing is I want to make sure that you know where to find us head over to www.verticaljumpprime.com to learn about all the programs that we have for creatives. Our job at vertex school is to teach you new skills and Creative Tech and help you get a job that matters to you. We lock in on the specific skills and triggers that people are looking for in the industry and what you need to do to prove that you can do this job. We're", " Taking applications right now. So make sure that you head over to www.verticaljumpprime.com and apply today. All right. Again, thank you so much for being here have an amazing day."]}