{"showID": "00bUBQRAVOMU42g1gXlzlX", "show_name": "Losing My Religion", "show_description": "Welcome to Losing My Religion Podcast! In this podcast we have Joshua, his wife Karea and their great friend Tim having discussions where they talk about God, life and everything in between. Breaking away from religion and into relationship with God & others.  www.losingmyreligion.love", "episode_name": "Religious Nonsense Hurts Others", "episode_description": "How we conduct ourselves is very important because we can really hurt one another with our words and actions. We take a look how we treated the recent hurricane and insensitive of our actions afterwards have really hurt others.  ---   This episode is sponsored by  · Anchor: The easiest way to make a podcast.  https://anchor.fm/app  ---   Send in a voice message: https://anchor.fm/losingmyreligion/message", "duration": 16.0415, "transcript": ["Thank you so much for joining. I Losing My Religion podcast. My name is Joshua Preston today. We have a new episode for you. We hope that I encourage you and do discussions to our part our journey and maybe even with the Holy Spirit revealing your heart with it. We hope that it encourages you and helps you on your way helps us to enjoy more of his love for us. Enjoy the relationship that we have with him, too.", "So that we can actually actually be a better human beings be the human beings that he has craziest to be to love one another just as he loves us. So we hope that you enjoyed this episode and if you love our podcast Please Subscribe and share and you can actually come with a podcast contribute if you like to if you don't if you feel that's if you don't you don't and we're absolutely fine with that. So we hope you enjoyed this episode today, and we look forward to having more discussions and with you the future and so", " so enjoy", " If you haven't heard about anchor is the easiest way to make it podcast. Let me explain for one is totally free to there's a creation tools there blow you out of your mind when it comes to recording editing and adding guests to your podcast anchor also with distributor podcast for you. So it can be heard on Spotify up a podcast and many many in that and I mean many more podcast apps you can make money from your podcast with no minimum.", " This initiative is everything you need to make a podcast in one place. Let me tell you I've been using this podcast now for over a year and a half and it is everything for us. And we do we do multiple at podcast on there as well. So I want to tell you download the free anchor app or go to Anchor dot f m-- to get started.", " Welcome to Losing My Religion podcast. I'm your host flying solo today. Joshua Preston. This is episode number 77. Don't worry next on the next very next episode. We're gonna have the whole crew bag. I told you last long the last episode that I'm flying solo for the next two episodes and I hope that you don't mind that one that so with next on the next episode of the episode of 78. We're going to have Korea and Tim back and we're gonna have some guests lined up over the next couple.", " Weeks as well. So this one can't give you a heads up about everything but I just want to thank you so much for your support and your love and your listen your viewership arses that you listenership whatever you want to call it. But I just want to thank you so much today. I'm kind of want to get into a little thing. That's kind of been something that has happened recently. I had some stuff like we we talked about a couple weeks ago. I think last week we were talking about some of the stuff I post on social media. I do a lot of social media", " Mia I'm actually a marketing director for a company I work for as well. And so I do a lot on social media. So I see a lot and so I kind of want to talk about this one thing with the hurricane with you know anything from the East Coast. If you're not from the east coast of the US that's quite a fine. You probably heard about the hurricane Dorian that came up the East Coast. Everybody was a category 5 and course it was supposed to be making straight landfall around right in the middle of Central Florida and all kinds of craziness and and", " You know, what's so funny is they didn't stalling out and then hit it ends before he got to the coast it just hit right up north and when Trout the coastline all the way up to I think the trying right now present Canada, but there was something that came out that seeing a lot of the parts of the by posting out and I read what the picture says so you can understand this is what causes a category 5 hurricane hitting quickly and straight to the Florida Peninsula to pause just before hitting weakening then making making the makes a 7.", " E5 90-degree turn northward prayer and spiritual warfare and what's interesting about that? The one thing that kind of really gets me about that and I apologize for making some noise in the background when it gets me about that portion of it. Is that", " Yes, it was actually the parts of the time it was hitting towards Florida and it didn't stuff had changed. But what happened was they were Thomas Muller they're rejoicing like hey, yo, we basically stop a hurricane from hitting the us and one day they fail to realize is that hurricane hit our countries and killed we all know yet. But in the Bahamas made it just totally destroy the, you know, enjoy that country the shreds.", " Me and that's when the biggest things that we apparently kind of missed when we post this on from like that and the way we act and then I have to I have to be totally honest with you. It's something that I would have, you know, I've dealt with in my life, you know down in the past, you know, thinking like that. Hey we stop this listen to us, you know. Hey the tornado missed my house over the storm hit my house, but don't realize no one.", " As the houses of the hit in the lives are short because I mean we're talking they were talking about, you know, we made a storm stall and then turn yes, but when it started it wreak more Havoc Bahamas, I mean, they're still trying to find by account trying to count them count the bodies. I mean we're talking about people's lives and people die, but then people's lives or shorts during the house is taking, you know hurt, you know, the livelihood what they do is when taken away from them and they're hurting and", " And think like some of this would become very insensitive to that and it kind of reminds me of is in the thinking is that we act like that we prayed it as and hit us but we don't do is think about my name room and it was something mean created was talking about, you know, we were traveling this week. So we were kind of discussing talk about a little bit is", " You know our words do have power but you know, so funny is that we use our words to for ourselves selfish. Very selfishness. Be real. We're very very selfish people human beings were selfish. And the thing is that we know that our words me very powerful but whatever use a words not for ourselves, but for another for instance like we pray like, oh for the tornado not to hit us but yet then it skips off. So we're like, yeah rejoicing my guys great, but then it destroys your neighbor's house.", " And it is it didn't stop and think about this for a moment. Wait that looks to people who are from the outside looking at this who own who are on the outside looking at something like that. This is it really glorifying God.", " Is it really the answer is no, it's not actually making him look pretty bad. It's somehow he he will if you pray he will make sure this hit your house, but if you don't pray, he'll hit your house.", " What kind of guy is that?", " What kind of father is that?", " I mean stop and really think about that for a moment and again as a dad, like if you're a parent would you do that to when your children would you because when your children prayed you will make sure that nothing happens to him because I don't want you just going to let everything happen to him. What kind of parent would you be?", " In this view honestly as a he said bad father, you know, you human fathers we do that how much more does he do that or wouldn't do that? I should say.", " And they stop and think about that for a moment late. It doesn't go if I have one that just that post just have a stuff that we do.", " Just makes us look bad. It makes it look very insensitive. Very very very insisted makes it look very selfish. And that's the news horse. I saw the answer is that we didn't have enough faith.", " People Bahamas that have no faith didn't pray enough and my things and some people use have their devil worshippers. I'm like, wow, they're human beings.", " And in his love is not defined by how much you pray or how much Faith you have is the fact that you're you and he loves you and that's it. It's not about how much Faith you have or how many prayers over how much prayer time you have had determines anything from him secondly loves you. He gives not based on you but who he is he does stuff for you not based on you but", " He is and my snapping understand that.", " But you know so funny though in all of us. Y'all want to talk about spiritual warfare when I'm seeing for what's the relief that's come in to the Bahamas these cruise ships full of supplies of doctors.", " Stationed themselves on the longer coaster Bahamas bringing stuff in taking people off dialysis. They can have a place to put sleep at night cooking hot meals for people these planes like Tyler Perry Lee Perry, you know flying his private jet flying supplies for the people. That's if you want to call it spirit that spiritual warfare. That's that's my dad. So if you want to say any that's him, you won't say anything spiritual warfare.", " that's that", " is what's happening right now as we speak and you might use a new what hey. What can I do Google it? Shoot man, you just give to local your recall so you can help you they can help you. You know me like stop and really think about me and like which one really shows him. I was praying for the storm got to hit us, but it's okay. They fit his others and it does and it's okay and we glorify God like that or yeah, it hit others. So we jump in", " And when they're beside them through what do their hearts and helping them to heal which one go if I is got more and then we stop and really think about that. It really starts to really use start to really know him and understand him and I stand a lot of stuff is not from him. Let's be real and I'm hoping to us as a body as people as human beings we start to understand this because this is huge.", " Because how we treat each other's important how we see each other is important how we did talk to each other is important how we listen to what matters important all of its important and dad knows that and I think how we can begin to see him. Is that how we begin to see each other and understand that we don't know everything.", " But one day we should start now - Noah ham and that's important for us because that's not him. Wow. He didn't make its tolerance how people and kill people and kill people on island people and my thing is would you do that to your own children. I'ma keep these two kids, but I'm going to murder these two kids.", " No, good parent says that.", " How much more?", " Is he then if you're good parents, don't do that.", " And once you start to really realize that and start walking this out because man, I mean, I stretched it out in the previous episode that we had and I talked about the answer. This is crucial man. This is a crucial time and because it's like us being doctors and we had a roomful of hurting people and we just sit there and we do nothing but", " put them down from hurting.", " when we can get we have the ability to heal them with love, but we choose not to", " That's what we're at right now deeply ideally mean like when I see stuff like this because some people's argument was in that when they posted that was, you know, we experts agree that the you know bombing the nuclear bomb on Japan was the right thing to do because it saves more it's a more lives. So it's okay to just worry about other people.", " That's so makes it right.", " I think both were wrong personally.", " Taking a life is wrong.", " So human being and seeing them such changes how you didn't treat them massage.", " In those people I feel for you man. Some horror stories that give you if you have heard man's terrible man to even come up the East Coast this storm hurricane hear about some of these people father watching his son be dragged away from watching a wife looser her husband wants in the husband lose his wife.", " It hurts if you want students to that spiritual warfare that you turned away from Florida, but yet and then killed a bunch of people heard once other people. I don't call a spiritual warfare one minute. I call that.", " stupid religious nonsense", " in all it's doing is making not making people see him and you know him but more or less get them to see you exposing your own self and your flaws to them.", " And frankly, it makes them want nothing to do with him. Isn't that the point though? You were trying to make a we were trying to make a point with that it's so they get to see him but then we're already doing is driving a wedge between that from them seeing him.", " I know why we do it.", " Because I have been in a row.", " Hurt afraid afraid of your own something you hurt and celebrate the fact that you're still alive that you were spared, but not knowing that.", " You're there, but you need to go help others and know that ye might spiritual but it didn't spare the other person beside you.", " and that", " Then you have compassion for them to go in and help there's that.", " And I know this this is craziness. I'm gonna keep it short sweet because I can keep going on my just want you to know that he loves you.", " He wouldn't do that to you.", " And I post is totally wrong. I hope if you that if you're been affected by that. I just want to know you love.", " And that he cares about you just as much as he cares about the person next to you and he will never do that to you.", " We hope you enjoyed today's podcast at Losing My Religion. If you like to show your continued support subscribe and share and if you like you can give monthly of no more than $10 at the link in the description below. It helps us to keep doing what we love to do, which is this. Thank you."]}