{"showID": "00dGTzs1TgUbVtZnWL6qT8", "show_name": "Get Real, Lucille!", "show_description": "Lucille Suell is a podcaster, art historian, business developer, entrepreneur, mom, stepmom and lifestyle improvement motivator. In her “Get Real Lucille” podcast, she offers us an unscripted uplift for anyone who is craving a dose of authenticity and encouragement. Lucy speaks often from personal experience- how she went from being a divorced, struggling, single mom at an emotional rock bottom, to living her life to its fullest potential. This is for men and women who want to regain control over their lives, escape fake drama, and feel good about themselves again. www.GetRealLucille.com", "episode_name": "Episode 2: Authenticity ", "episode_description": "I decided to experiment by quitting social media to focus more on my own goals, away from comparing myself to others. I have had a revolutionary awakening now that I have let go of vices, and I embrace the process of finding and experiencing authenticity. Please email me at lucythorpsuell@lucythorpsuell.com for feedback/ topic suggestions. Lots of love. ", "duration": 3.686166666666667, "transcript": ["Hi, I am back. So I wanted to talk briefly about what authenticity looks like to me. So about two years ago. I decided to quit social media and I don't think there's anything wrong with it. It just wasn't working for me because I kept comparing myself to others. It was terrifying to depart from it, but", " Now that I'm coming up to two years without it. I just find myself more able to focused to focus. I mean and just more aligned with with my own personal specific goals. And so I say this because it might be a little hard to find me. I am going to be developing a website Lucy Thorpe school.com, but please just contact me at my email. It's LLC Thorpe.", " Th o RP @ gmail.com and and just let me know if there's anything that you would like for me to talk about. I will be bringing in some people to interview. There's some great people around the Houston Community and the recovery community and the spiritual community and I'm really really thrilled to get to bring them along. So anyway authenticity. What does that look like? You know, it's it's just it's being", " I'm me and not afraid to be me. I've been trying to please other people for so long. We're all trying to do that. But man once you can just let go of the external forces that are weighing ass down that sometimes that's that looks like drugs alcohol shopping gambling sex when we can let that all go and not cling to it and sit still enough to embrace our authentic selves something revolutionary happen.", " And I'm right on the brink of that and it feels so good and most importantly it feels so good to get to share it with you all because this is a collective struggle and collectively we can all help each other get to the light at the end of the tunnel because again there is that solution and let's just keep talking about the solution and let's help each other get there. It's such a beautiful life. It's such a beautiful day and I'm just really excited.", " To be here. So again email me. It's LLC Thorpe at gmail.com and give me some feedback. Let me know maybe who in Houston you would like me to interview. Let me know which topics you would like to cover because in this podcast we do get real and I am not afraid to cover even though I know my parents might be listening to this. I'm not afraid to uncover some gritty stuff. So", " Again, just email me. I'm looking forward to getting some responses and looking forward to Growing towards a solution together in a real way. Take care guys."]}