{"showID": "00e3nyxpqhhreydZjZag7H", "show_name": "PM in the AM", "show_description": "Looking for a fun way to distract yourself from doing important things? Listen to this hilarious podcast and forget your responsibilities while laughing hysterically. ", "episode_name": "Resolutionary War", "episode_description": "Listen in to this episode as we give an update on our new years resolutions and discuss important things we learned this week. You don't want to miss it!  ---   This episode is sponsored by  · Anchor: The easiest way to make a podcast.  https://anchor.fm/app ", "duration": 26.62865, "transcript": ["Wakey wakey eggs and bakey, welcome back to another week of the porter McNeely and the am podcast order that might have been my least favorite intro that we've done. Sorry guys. I mean, we're trying to come up.", "Catchy intro that I gave it my best shot. Let us know if you guys can help us out with that on our brand new Instagram page that you can tell anything will help stop. That's mean my mom used to say good morning sunshine. Maybe we can try that next week. I like that one. I like that one too. She didn't say eggs and bakey it Rhymes dude it Rhymes. That's that's what bakey it Rhymes. Oh wakey-wakey. There we go. Anyway, and which are real words as before mentioned are.", " Our brand new Instagram page is doing really good. I guess we're up over a hundred followers. We already had leaked. We already have more followers than Porter doesn't is actually kind of hey, hey stop hitting. I told you guys. I only follow people who are important to me. I don't just go off and fall 800 million people like some people do so you hear that if Porter doesn't follow you you're probably not that important. I guess. That's what we learned today. I will follow you. If you follow me first and you'll be important to me digging Instagram first thing first we", " You have some shoutouts to a couple of people that have really supported us first call and Pearson gave us a nice share of our brand new logo that we just made Collins awesome. And he actually got his car booted to come come record an episode with us earlier this year. So that was I guess last month, but that was pretty good commitment the podcast and we're thankful for all his support. Yeah. Laughs we want to shout out my own blood my own sister Haley Pierce now, I guess you don't know your sister's name. Well, okay. Well, it's different than mine.", " My last name so I had to double check in my mind sounded like really nervous. They're like you're gonna mess it up. I live three sisters. They all have different last name that explains it that explains it I but Haley Pierce. She's awesome great sister would recommend that that was a horrible thing to say, but I'm in does a sister. Okay also shout-out to Livi christensen's she also shared our post, but she shared it. She's a true homey. Thank you first things first.", " Is this week? We want to get into just just a little recap of the week. We had some things we did and specifically some life lessons that we've learned. So I'm going to go first yesterday. We got about 5 5 or so inches of snow and me and Dax took the opportunity to do a little bit of sledding, but we learned an important lesson, you know, as fun as a construction site looks to go sledding. It's really just dirt covered in a couple inches of snow. It's not a good idea you like", " Okay, wait, hold on. I've never looked at a construction site and thought hmm. Maybe I should go sledding there. Yeah tell there's snow on it. Yeah just looks like a hill just imagine like a 50-foot Dirt Pile covered in snow it looking at the bottom. There's a crane with a actually it was like a bulldozer tractor. Yeah, that makes it much I'd much rather hit a bulldozer than a crane. No, that's exactly the lesson. I think we learned is like we were going down the hill, you know, you don't really look first and then you sled right into a pile of cinder blocks, which I actually", " Really did almost broke my collarbone or then Daxton on the other hand cut like six feet of hair and almost went right underneath the bulldozer. So that would be my recommendation for you guys before you go sledding just make sure there's no construction equipment on site or to just jump over the cinder blocks as you can do that while you're sweating like some of us weren't D1 down. Sorry Daxton competitive sledding, but what about you guys? What did you guys learn this week? I learned that if you run out of toilet paper and you need to get some really quick.", " Instead of going to the store all I did you just have to make sure that the roommates don't hear you entering in their bathroom. Wait a second. I don't like where this is going. Yeah, dude. I got some nice Charmin Ultra suede is that why it was so much better than the stuff. We usually buy from Adam. It's nice. I had to borrow a roll. No, I found it. Usually it's behind the door, but it was under the sink this time. It's like a roll y'all noticed and we're good weight confession time. I'll give you another role wait. So if you know where it usually is does that mean you've", " Before wait, let me look at what this stuff this stuff retails for like a dollar fifty a ROM and that's expensive. I went to Sam's Club for that stuff. I'm actually really kind of kind of hurt right now. You think I didn't tell you about it? Well, I'm glad you came clean because I'm sure that was just writing down on your conscience. It was that's horrible disappointed in you Dax and disappointed in you. Well speaking of Roommates actually something I learned this week is that if you live in an apartment with six guys and your it's New Years Eve and you", " you're planning on staying in the apartment that night probably might want to double-check with everybody make sure they don't also have the same plans because we have a roommate and it wasn't a problem ended up working out. All right, but how we were just gonna awesome rager. We were just going to get some some food, you know have a movie marathon until midnight, you know, all that good stuff we get there and he goes so what are you guys doing tonight? So I'll probably just stay in here not do much he goes. Oh well, so are we and I look around this just him. I'm like wait.", " Sweet, I guess he had some some people coming over and I mean it sounded like a great party and we ended up just staying in my room eating food and watching conspiracy theories on YouTube, but it was good that does sound like a quality tonight. I just wanted to ask you first though. Like why would you just plan like a movie marathon on New Year's Eve? Couldn't you have thought of anything better to do? Well, I mean, I know you guys are becoming like a boring couple now that you're you're into the later stages of your girlfriend boyfriend ship.", " We're 45 year-old. It shows man. Like what kind of plans were those? There's so many much better things you could be doing like what what was he gonna do go to some some party with 9 million people there or you could have just came out of your room into the living room and gone to the rager that was being thrown by one of our roommates. I was very looking forward to this movie marathon that we were going to have though. So at that point it was too late. I'd already committed to getting food and not doing anything for the rest of the day. I had sweats on it was the time of my life.", " And why is this even a problem? Okay. Well the problem is and being confined to my bedroom floor as compared to a couch. So being forced to do it you're already planning to do rather than just doing it well, but not in the comfort of my desires, you know, that's one thing. I just I just can't wrap my head around like look either way. We're Choice was less than Stellar either way. It worked out fine. We were all.", " Right. I think they all had a good time. I don't even know what they did so we can start the podcast in the comfort of your desire. I do not like that one bit better than bacon. Oh, no, I think those were some really good lessons though. Like those are things I'm not going to repeat next week. You know, I'm not I'm gonna double-check you mean you were gonna repeat them here on the podcast not gonna be that bad.", " No, I've actually been really good for just you care to know about my resolution. I have zero Scooby-Doo. Yeah, I've been really good to Scooby-Doo has been a zero. I think I've only heard two or three chicken sounds and mating calls or down to minimum. Yeah, I have or it's not mating season. So but hey, I'm not the only one who's been working. I found about 15 pounds of Wingers in the fridge yesterday. So Blake has been worked working on his goal of adding a few pounds. So yeah. Congratulations on that.", " Blake I'm coming through for with some food real problem is I was trying to get you guys to gain weight but instead I bought all that Wingers that let me to Wingers. I know that's my problem is I bought like 30 of them and I only let me have two and you're trying to get me fat. Did you just me 28? Did you just call a wing a Winger? I've got a waiter's I don't want to say Sticky Fingers. They were essentially just fancy chicken nuggets regardless. They were really good. Yeah. So as you guys can see we're coming along great on our resolutions becoming new people this year and", " Been a really great transformation, but we're going to get into the news next stick around. We'll be right back. Hey guys, this is Colin with revamp Auto Detail. Just wanted to let you know real quick what we're doing here. We're offering anything from scratch touch-ups to Quick weekly and bi-weekly vacuums and wipe Downs of your car to full details my prices start at $25 for a sedan. And that's for a basic Car Wash and it goes up from there. But your car will be getting its best clean its had in years and possibly its lifetime and this holiday season. I'm going to be offering", " 50% off of any car wash or detail if you reference this ad when booking an appointment and you can reach me at revamp underscore auto detail on Instagram and revamp on a detail on Facebook breaking news. Well, that's better make sure he was it was a step in the right direction it come on guys. I'm really just trying to sound excited and have my good segment intros so", " It excited that's not the problem. We're dead. I think it's better than the bakey say these guys, but they never want to help out or breaking news. Come on. Anyway, we are now going into are not important News segment. We're really excited this week after last week's story. You know, I really posted a very disappointing story and I'm I'm I was like, I don't know what I was thinking about sharing that story. It was horrible. Like I'm disappointed in myself disgrace.", " Just let my family down but I'm not gonna let you guys down this week. I'm really excited. But you tell them what you have to do border. I still haven't done it yet, unfortunately, but I will do it. I promise I will I just haven't had the time or desire to go to Walmart in a wife beater crop top and short shorts and ask a associate about a rash cream. I will do it. You know, I deserve it. I shared a horrible news story and that's on me, but I'm not gonna let it happen again this week and that's why I want to get", " Didn't to my brand new news story which it's pretty wild. So a company is a food company is recalling frozen hash browns and stores in nine states because the potatoes may have pieces of golf balls in them. When I first read this I could not wrap my head around how the heck frozen hash browns would have golf balls in them like it. I just couldn't think of a maybe Here's my thought.", " So the track maybe the potato farm is right next to the driving range or something along that along those lines and the tractor whatever the picks up the potatoes might have picked up golf balls and like when they blend them up to make the hash browns, maybe they were golf balls in there and they noticed that there was one in there and then they probably saw some more and then they realized that wow, we've been doing this for the past six months and so there's probably people baking", " Pieces of golf balls inside of the potato and you're exactly right. That's exactly what happened. Yeah, they inadvertently harvested these potatoes and they found that somebody had been practicing their their 9-iron I guess and just driving these and I guess that would be ironing these golf balls into the you know about golfing do have limited golf. Well, I think shipping they were chipping these golf balls into the hash browns and got that silver.", " Right. I just don't see any other reason for golf ball. You don't think it was like back in the old days. They had to do it by hand. The guy just picked up a golf ball and said yeah that could be a potato and threw it in with the rest of them. But I just think how gross is that? You know, you're frying up some hash browns and you notice a little golf ball sliver in there. And that would taste horrible. That would just ruin hash browns for me even more than I I'm not a big hash browns guy. So ruin your throat. Yeah that if they say that's why they that's why they recalled them because it", " Choking hazard luckily your golf ball stuck in your esophagus the called it. They don't think it's just because of the white color. Hey, luckily, no injuries have been reported. So be careful out there. Make sure you check your hash browns for golf balls. And I guess any other food for any other athletic equipment because you never know what you're gonna find. Yeah. I didn't see that coming guy goes and waffle with watch out frozen waffle with fried plastic.", " Now the first thing that came to my mind, I don't know why I just tried plastic is a common sports equipment. Yes. Okay guys, this is mine American Girl doll releases First doll, that's hard of hearing my believe that how many dolls as the first place. My main concern is that mean that they can hear us before that not this one hearing aids real and I would rather have this tall to be honest, but be quite honest but like what do you guys think of that? Are we just gonna leave that there? Well, I just", " I think that proves it the government is always listening to us even through doll. People are worried about their phones. You know, they talk about something it comes up in an Instagram add but really what we need to worry about is our children's toys. Yeah, the government is using them you just take a little Nancy doing a little tea party. That's he's talking to American Girl doll an American girl. That was like I hate tea don't give me that was like I saw what you did last night get out of your crib. I think what we learned here is that Buzz Lightyear", " is an FBI agent undercover any that all along? I don't know. I don't know why you did not know that but Toy Story has more value than we think they were always keeping an eye on Andy and whoever else which other kids they were with wait. What have you ever watched Toy Story? I think we must seem to us absolutely all four movies wherever just watching kids, but with that I guess we'll go in to go into my new story here.", " So this happened in Scotland, but since you know, we're getting to the point where pretty much International cops shut down a massive 3000 person game of hide-and-seek at Ikea and I think my main question comes into the fact that if these guys were playing hide-and-seek there could be more than 3,000 that we're still in there hiding either that or all those people are just terrible at hide and seek. Well wouldn't you run out of spots? I know it's a massive store. It seems like endless opportunities. Like I've literally been lost in there before so I understand where like", " The hide-and-go-seek part, but how could you play with 3,000 people? I mean, it's I don't know. It's a massive store. I think really the irony of it is the fact that if the cops went in looking for people who are playing hide and seek aren't they also at that point blank. I can see three thousand two people. Those are pretty to pretty good cops. If it only took two of them to find all these people really need to get better at hiding though.", " I mean, I don't know. I think the article at that point it would be hard to like know who's actually playing. He's like there could be these people just walking down with their stroller and then I gotcha. What do you think? I guess it was like a Facebook event that people signed up for kind of like the raid Area 51 thinking. Well, they say it was like a more productive event and they actually did something rather than just saying they were going to I mean, it's pretty impressive. I've always wanted to play hide-and-seek it like Ikea or something like that. So I think we should really", " Lee get a group of people to go do this. I think this sounds like a really good time maybe like 15 not 3000 know that stores big enough where you can find or you can hide 3,000 people you put 15 in there. You're never gonna thousand people. That's all they found 3,000 people. You can't just trying to stick six people in a refrigerator and stuff is moving furniture right now. I mean that's just like my childhood dream. And so I really like that new story. I just really wish that those people were better at hide-and-seek either.", " Of the cops were professional. I don't know what it was. But either way I'm thoroughly impressed. We are talking about Scotland, right? Yeah Scotland Yard, maybe that's how they were so good. But yeah, like I mean with the few less people, I feel like that could be a really successful really really fun thing to do group date at shall we that is free fun. Maybe not ethical but it would be awesome. 1,500 people are invited bring your own date. Yeah.", " BYOD, that's really making an Instagram page about this when putting it on our stories, so remember the date. Yeah, stay tuned for details. It's gonna be awesome after Porter buys his rash cream. Oh, yeah, that'd be like a good punishment. Yeah, if your punishment you have to be the first person to go find everybody that'll be the punishment for that week that actually be real easy. Yeah tell that to the 3,000 people at everything to find one person finding one person and Ikea you think", " Easy out of 3,000. Yes quite yeah. Have you ever been to Ikea yeah, and I never could I've only been out there. I think they literally designed those places to be a maze like apple kind of like Darcy. Will you work at I've gotten lost in it 14 times and I've only been there through teen that's how confusing it is. Yeah, so I work started working there and I literally got lost like the second day. I started wandering around and eventually I just ask somebody where I was supposed to be because I had no clue of wandering. My lunch was in my hand I could", " Find the breaker probably. Yeah, I feel like a little kid on the first day of school lost. You think they would take us out there. If we came to play hide-and-seek there. I could not tell you that. I don't think I'm allowed to say yes or no. Yes, or quite frankly play hide and seek in his own work. Just take off your bag. You should walk around and find customers who are trying to hide from he so really I think I'd be good at it at this point. That was a good way to peace those two things together. I'm very", " Rest by your example. Thank you. Appreciate that on a resume. That is what makes him a great expert hide-and-seek player. Perfect eyes. They're you have the news of this week. As always we're going to have the pulls up make sure to vote for your favorite stories and not just your favorite people so that way we get an honest amount of feedback because I quite frankly I'm tired of winning all the time and one one time you lost all the other ones. I don't want to hear it. I quit. You know what Lee. I'm not looking forward to going to Walmart. So please don't make me have to do it.", " Other punishment again. We are going to put up a new punishment as well for you to vote on. We are not a hundred percent sure on the details yet. So those are going to come later but make sure to do to vote for what you want. The loser of this week's story to do and we'll catch you guys in a moment for anyone who's been thinking about or wanting to start a podcast. I recommend anchor let me explain why anchor has a creation tool that allows you to record and edit your podcast right from your phone or computer and anchor will distribute your podcast for you. So it can be heard on Spotify Apple podcasts and many", " Or streaming services. You can also make money from your podcast with no minimum listenership and it's everything you need to get a podcast going in one place. So download the free anchor app today or go to Anchor dot f m-- to get started.", " All right, guys, we're back here. I don't want to hear you after you said wakey wakey eggs, and bacon or whatever you said, but anyways, as we know as you guys probably can tell through listen to this podcast. I'm a pretty opinionated guy. I have my views on things and I just kind of wanted to run somebody you guys to see what you thought. I should have my views on the world, and I want to see if you can prove me wrong.", " All right, let's do it. Let's do it. I'm ready. I'm always ready. All right, here's my first thought cereal is soup soup is warm cereal is not warm. All right, where does in the definition of soup does it say that it has to be warm? What is one soup other than cereal that you eat cold?", " There's like raspberry soup strawberry soup. But yeah, I don't syrup know I've had them before in Brazil. No, it was on a cruise. So it was technically the middle of the ocean. Okay, here we go a soup by the definition is a liquid dish typically made of by boiling meat fish or vegetables in stock or water typically, but not always have you had any cereal with meat because if you have that is horribly disgusting typically use one that always you can stir around super you don't over stir around Syria.", " Because it gets soggy. Okay, fine. Well, how about this then there's that Pop-Tarts are ravioli. What is see that I can go for because what is a ravioli? It's like a little pasta shells something inside boiled ravioli is ravioli. Even before you boil it. I like a noodles have to be boiled in order to make them ravioli. Well, I mean, oh and that package before and yeah still there still ravioli. Yeah, but they're already cooked. Nobody stuff to cook them. I'm you know, apparently if you just hate it well according to the definition. It's just a small pasta envelope containing ground meat cheese or vegetables, okay.", " Okay, there you have it pasta envelope. Yeah, but what is it pop tart? It's like a cooked pasta. It's not a cook pasta bread pasta. It's a it's a ravioli desert bread pasta and expect me to be okay with it. I just did now believe it. All right. All right - salt of all right. So I already got I already got Porter on my side here. You're the last one pizza rolls are Italian gushers? Okay, I like that. Wow, that's out. There is no death. There we go. There we go.", " Something we can agree on. All right, it's good. Okay, we're good. I didn't have to try to convince you that beef jerky is chewing gum for Cowboys the some doing pretty good here. Yeah. All right note. I think that perfect sounds bad. Now you don't just chew on it chewing tobacco is too real for Napa. There we go. There we go. He's chewing gum doesn't dissolve as it's in your mouth. If you got a chance to convince us of some things. I want to have a quick chance. All right. We'll see what you got. I mean, I don't know if it can be the Italian gushers, but", " That was good. All right, let me give it a shot. Wii Sports is the best video game of all times. Have you ever played Wii Sports Resort? Wow, you just destroyed my argument in one statement. Absolutely. You are right the basketball and ping pong games on there were epic. Absolutely. Love them. No. The best about Wii Sports Resort is the little platform when you can sword fight with you - yeah, that was the best part about Wii Sports Resort or Skydive. Yeah like that that game was masterful like you", " Say that there has been a better game that has come out since then there were so many options. That's the thing you could do. Whatever you wanted. I can you guys argue that or know that you can do whatever you wanted know that that we Sports Resort is I could not die while doing parachute aches just kidding. I can get behind that. I'll get behind that. It was good. Oh wait, although I don't mean to Axton growing up, you know, the the tanks game that we would always play that game was bomb. It was you just driver ahead a good because we don't know what it's called. It was it was on we play I remember that.", " It was called it was called Paint. That's what the game never even heard of that. So that's my vote discrediting that vetoed and accent obviously doesn't have a statement but I'm gonna ask you guys one more thing. This is something I found online. Obviously. I'm not intellectual enough to come up with this but it says college is all about convincing your parents that you are studying and convincing your friends that you are not studying. Do you believe that to be true or not? True? No, I have no idea what you're talking about. I always only study which I have to say because my family listens.", " This podcast exactly Point proven always study. I only always study because yeah exactly. I feel like I've never had to convince my parents and I'm studying. They just don't believe it. Anyways, they just haven't looked at your grades. Now. They know my grades are fine that that seems to me to be like what a big portion of colleges. What about you Jackson? Do you have any questions you want to ask us? Yeah. Well, I got a couple one of them best movie of all time Shrek.", " Absolutely. I cannot argue that I love Shrek the memes they've done with that in the funny videos. They've made of that absolutely incredible animatic art. It lives on forever in the hearts of Americans after literally tonight. We watched don't even know was probably an hour's worth of like just Trek video visit. I don't know if we should admit that to all of our view listening like it wasn't on purpose it just like one thing like, oh that's actually kind of funny at the Dexter. It was either or well tell you if you guys get bored go ahead on YouTube and type in raising.", " Shrek raising Shrek. It's life-changing. It's like 30 seconds long, but you won't regret it. What about this one memes are just dad jokes with pictures see that one. I have a little bit of trouble with because I've seen a lot of memes that have nothing to do with something that a dad would say, that's the thing is like I feel like there's a lot of jokes that say their dad jokes, but like my dad wouldn't say them. Yeah. I think there's only like a few classic dad jokes like a dad joke, really?", " They just means like it's a stupid joke. Really? Yeah, which I'll memes tend to be stupid jokes with a picture but some of them are like, I don't know tied to something newer than a dad wouldn't even understand or know about so I couldn't have no dude. My dad's hit you're saying that because he because of the previous college segment, aren't you? Glad he's studying. He's studying right now. It's gonna go get ready for next semester. I don't waste my time on the", " Annette were making podcasts. I promise but now I see I'm glad to see that I could kind of help you guys get some good views on the world there. I convince you many of the I convinced you for the most part and I'll take my My Double Wear I can wear I can but you guys is I'm still trying to ease into but we'll see how it goes. Thanks for tuning in this week guys. We hope you enjoyed our 15-second debates as you can see. I won basically all of them. What are you talking about? You didn't even participate you just", " Folded gave the best opinions. Absolutely. Thank you like Supino. I gave the best opinions my guess, but thanks for listening again guys. Just a reminder to stay woke this week and we'll catch you next week."]}