{"showID": "00ENEumWcPZcXVgmJdMYMw", "show_name": "Meridian Magazine--Come Follow Me Latter-day Saint Podcast", "show_description": "Each week Meridian Magazine’s founders, Scot and Maurine Proctor, will be giving a 30-minute podcast on the “Come, Follow Me” curriculum for the week. This is so you can listen with your scriptures in hand, or while you are about life’s many other duties. If you want some thoughts about teaching your family or in Church lessons, this can be a place to turn. If you live alone, let us study with you.", "episode_name": "Come Follow Me BofM Podcast 6, “We Lived after the Manner of Happiness” -- 2 Nephi 1-5", "episode_description": "February 3-9 How can Lehi who has suffered so much in the wilderness journey, including the murderous rejection of his own sons, Laman and Lemuel, possibly write that man is that he might have joy? Does he know something that we sometimes forget? We’ll find out as we study together. ", "duration": 34.42851666666667, "transcript": ["How can Lehi who has suffered so much in the wilderness Journey including the murderous rejection of his own Sons Laman and Lemuel possibly right that man is that he might have joy.", " Boy, does he know something that we sometimes forget? We'll find out as we study together. Welcome to Meridian magazines. Come follow me podcast. We are Scott and Maureen Proctor. And today we'll be studying a lesson titled. We lived after the manner of Happiness, which is second Nephi chapters 1 through 5 transcripts for this podcast can be found at Latter-Day Saint mag.com forward slash podcast. If you are not reading Meridian magazine every", " A you're missing out on a daily Feast of inspiration news and insight from scores of writers and once a year for a brief season, we asked our readers and now our listeners for a voluntary subscription. This is that season we are a small operation. But with all the regular cost of a big web presence with server fees hosting fees licensing fees staff the list goes on and on we certainly don't survive from advertising alone. We published.", " Third and 60 issues of Meridian a year and fifty different podcasts. You can become a paid subscriber at Latter-Day Saint mag.com forward slash subscribe. That's Latter-Day Saint mag.com forward slash subscribe. We truly appreciate your subscription support and may I say we feel so close to all of you out there many of you talk to us on the street and we have pictures of a few hundred of you followers of this podcast.", " We look at you all the time and feel very bonded to you. It is an honor and a pleasure to support each other in our scripture Journey Together Scott. Once I was commissioned to write a series of films on the Book of Mormon. And as I was planning them the spirit kept nagging me that I was missing something really important then one day as I was searching these very chapters that we are studying today. I saw what it was I had not focused on the", " The importance of the Covenant and therefore had missed something Central to my understanding of the Book of Mormon. Of course, we know from the title page of the Book of Mormon that one of its purposes is that the remnant of the House of Israel may know the covenants of the Lord and that though this little branch of the Covenant people have now come to a Faraway place. They are not cast off forever being part of the Covenant is Central to their identity their relationship to God their sense of security.", " And their story they trust that as the Lord says in Psalm 105 verse 8, he hath remembered his Covenant forever the word which he commanded to a thousand Generations, which means of course longer than forever yet. I see Covenant stories and moments in the Book of Mormon pass Us by in Sunday schools as if this Central purpose of the scripture is invisible. So let's start by looking at what Lehigh says when they have arrived to the", " the promised land first. He says for behold. I have seen a vision in which I know that Jerusalem is destroyed and had we remained in Jerusalem. We should have also perished. Remember Jerusalem was sacked around 587 or 586 BC then immediately Lehigh rejoices, but said, he notwithstanding our afflictions. We have obtained a land of promise a land which is Choice above all other lands a", " Which the Lord God hath covenanted with me should be a land for the inheritance of my seed. Ye the Lord hath covenanted this land unto me and to my children forever and also all those who should be led out of other countries by the hand of the Lord. This is an interesting phrase a land which the Lord God hath covenanted with me. Let's back up a bit and talk more about the nature of the Covenant. We talked about the Old Testament and the", " the New Testament but in reality the word test a momentum in Latin means Covenant, it has the meaning of an inheritance and a witness. So the Old Testament is actually the old Covenant and the New Testament is the New Covenant the purpose of the Book of Mormon from the title page is to show unto the remnant of the House of Israel what great things the Lord hath done for their fathers and that they may know the covenants of the Lord.", " Of course, the word covenant is in the very title of the Doctrine and Covenants. So we understand what this very central theme of the scriptures is it is teaching about the Covenant its nature its promises what happens when it is capped what happens when it is broken sacred history is about the Covenant. It is the very tool for opening and understanding the scriptures more deeply and the Covenant can only be made because", " cuz of the atonement of Jesus Christ people ask us all the time how they can understand scripture better see it through the lens of the Covenant who is God. He has many attributes, but foremost he is a covenant maker because that is the means powered by the atonement of saving his children from a fallen world and from their own Fallen Nature's which when you get down to it as what hurts us the most", " A covenant is a legal agreement. It is a contract it is a will that says you will be joint heirs with Christ, which means ultimately you inherit his nature. It is security for us on Earth. God sets the terms but most of the performance is on his part the atonement the gift of the Holy Ghost the guidance the support the patients with us when we falter the strength, he lends us.", " He day he asks us to do very little for him to do his work. But give a broken heart and a contrite spirit our place and keeping our covenant is a desire a willingness a seeking to obey it is not that we can give Perfection right now the Lord understands the difficulty of our journey and mortality and unless we willfully rebel against our covenants. He works long and patiently with us.", " He tells us that his gifts and Covenants are given for the benefit of those who love me and keep all my Commandments and him that seeketh. So to do oh, I love that seeketh. So to do phrase in that verse that certainly gives me hope so what are the Covenant blessings? We like to think of them as six peas so that it's easy to remember you can particularly see these when God gives the Covenant to Abraham the first p", " Is protection his Covenant people are protected as a nation if they will keep the Commandments. You see so many stories illustrating this in the Old Testament. Syria is warring against Israel the northern kingdom and they far outnumber the Israelites when the city was compassed all about by a great enemy host. The servant of the man of God was risen early saw the terrifying sight and said to the Prophet Elijah alas my master how shall we do?", " And Elisha prayed and said Lord. I pray thee open his eyes that he may see when his eyes were opened. He saw a mountain full of heavenly horses and Chariots of Fire round about Elijah. That's how the Lord protects his faithful Covenant children. The next p of the Covenant is posterity whose importance is clear in scripture. You see the great concern of the Book of Mormon prophets for what will happen to their posterity.", " And then the next p is priesthood the Covenant is administered and maintained by the priesthood power of God. Any other power will ultimately falter. The fourth p is prosperity. This does not necessarily mean material Prosperity but is instead the sense that the Lord will prosper your way with his presence. That is why Nephi could say with such confidence when asked to do hard things. I will go and do the things which the Lord", " Hath commanded for I know that the lord giveth no Commandments unto the children of men save. He shall prepare a way for them that preparing a way through his spirit is prospering v p is presence the end of the Covenant journey is to be brought into the Lord's presence. That means that he has schooled us and groomed us and pruned us to inherit eternal life. John Taylor said through the world's great.", " Their father they discovered a plan fraught with intelligence and wisdom reaching from eternity to Eternity pointing out a means, whereby through obedience to Celestial laws. They might obtain the same power that he had and if in Fallen Humanity, they might have to suffer for a while. They saw a way back to God to Eternal exaltations and to the multiplied and eternally increasing happiness of innumerable me.", " Millions of beings and if as Jesus they had to descend below all things. It was that they might be raised above all things and take their positions as Sons and Daughters of God in the Eternal world. That's the P of presence a joint heir of Christ because we have his nature. So the Covenant includes protection posterity priesthood power prosperity and God's presence.", " It's the one we have left out. The vi p-- is Promised Land. Abraham was promised it Moses was promised it and we see in these first verses of second Nephi that Lehigh obtains a Promised Land. He understands. This is a covenant blessing it is this Covenant awareness that ties The Book of Mormon to the Old Testament and the place from which Lehi and his family came. What is so important about this gift is it means", " to have a place we find this idea when we say blessed are the meek for they shall inherit the Earth or when Christ says I go to prepare a place for you. Is there a satyr word in the language than homeless or a satyr people than refugees who have no place the Sheikh of the desert which Lehigh was will say to those he takes into his tent Ilan wassailing wahab on which means a family", " Smooth place a wide place you have place with us. That's essentially what Lehigh would have said to zoram as they took him in. It is a covenant phrase Lehigh says wherefore this land is consecrated unto him whom he shall bring and if it so be that they shall serve him according to the Commandments which he hath given it shall be a land of liberty unto them wherefore they shall never be brought down into captivity.", " Then he spells out what those blessings look like in this much as Those whom the Lord God shall bring out of the land of Jerusalem shall keep his Commandments. They shall prosper upon the face of this land and they shall be kept from all other nations that they may possess this land unto themselves. And if it so be that they shall keep his Commandments. They shall be blessed upon the face of this land and there shall be none to molest them nor to take away the land of their inheritance and they", " Shall dwell safely forever because this is a land for a covenant people as long as they keep the Commandments. They shall prosper and be kept from harm by any who would molest them. It is clear. There are Covenant blessings astounding blessings. We call them Baraka barakatuh means Covenant power efficacy and blessing in Egypt. They have a brand of water called Baraka and what could be a greater relief in the", " Desert than water. I love that bought a car when we're in Egypt yet. These Covenant blessings are conditional on are keeping our part of the promise. We must obey the Commandments What happens when we don't when we are willfully rebellious. It is called a covenant cursing and the word for that is gah. Lah, you like to say that don't you Scott? There's a kind of ring to it. Yes. Gallalala. Gallalala. It does sound like a cursing. So here is the Covenant cursing or", " Might call it the consequence for willfully breaking the Covenant. It is a warning upon the promised land and this is what Lehigh says but behold when the time comes that they shall dwell in DeLand unbelief after they have received so great blessings from the hand of the Lord having a knowledge of the creation of the earth and all men knowing the great and marvelous works of the Lord from the creation of the world having power given them to do all things by faith having all the Commandments from the", " inning and having been brought by his infinite goodness into this precious land of promise behold. I say if the day shall come that they will reject the Holy One of Israel the true Messiah the Redeemer and their God behold the judgments of him that is just shall rest upon them. The Covenant is conditional upon obedience. This doesn't mean that if we work with all our heart to keep our covenants, but our flawed human beings repenting and trying again.", " that we are breaking our covenants breaking the Covenant is about willful rebellion, and then consequences follow it is because the Lord then withdraws his spirit and people are left to the ravages and buffetings of Satan to make this point clear when the children of Israel that Moses LED out of Egypt came into the promised land six tribes stood on Mount gerizim and six on neighboring mount a ball those who stood on Mount gerizim", " were to call out the Covenant blessings and those on Mount a ball the series of curses that would follow Disobedience the blessings as all Covenant blessings are were powerful blessed shalt thou be in the city and blessed shalt thou be in the field blessed shall be the fruit of thy body and the fruit of thy ground and the fruit of thy cattle the increase of by kind and the flocks of thy sheep blessed shall be thy basket and I store blessed.", " Shalt thou be when thou comest in and blessed shalt thou be when thou goest out the Lord shall cause thine enemies that rise up against thee to be smitten before thy face Thou shalt come out against the one way and flee before these seven ways the Lord shall command the blessing upon thee in thy store houses and in all that thou settest thine hand onto and he shall bless thee in the land which the Lord thy God giveth thee. It goes on and on the blessings that we are most", " in need of to have a secure and happy mortal experience, but these promises would slip away and be revoked if the people became rebellious and worshiped other gods as we know I the Lord am bound when you do what I say, but when you do not what I say, you have no promise this Covenant on the promised land is mentioned constantly in the Book of Mormon. Someone has calculated 38 times. You can't miss this theme more than that it also", " So lets us see the why of what happens in this book more clearly. The nephite nation is decimated because they utterly turn from the Covenant. But if that is not enough to demonstrate what happens when a people turned from the Lord we get the story twice. We also learned of the Jared I to turn from their covenants and were also destroyed the Book of Mormon has been called a witness and a warning the witness, of course is the Divinity and the atonement of Jesus Christ.", " Christ the warning is of prophets who passionately plead with us not to turn our backs on God and His covenants The Book of Mormon insists that the calamities and warnings. It describes our for our day Maroney is Frank Jesus Christ hath shown you unto me and I know you're doing it might be jarring to think that a prophet who has seen our day delivers a book to us. That doesn't just give us sweet platitudes about the importance of being good.", " But also spells with such muscle the tactics and smooth talk of Satan as he Woo's a covenant people from their lord knowing all this Lehigh pleads with Laman and Lemuel. Oh that ye would awake awake from a deep sleep. Yay Ethan from the sleep of hell and shake off the awful change by which you are bound which are the chains which bind the children of men that they are carried away captive down to the Eternal Gulf of", " Misery and woe chains and deep sleep are very powerful images depicting what Satan does to those who had been promised so much now Lehigh, of course is nearing the end of his life and will give blessings to his worthy sons in his first words to Jacob Lehigh reveals. Another Covenant promise acknowledging that Jacob has had a rough time, especially because of the rudeness of his brothers Lehigh said the Lord", " She'll consecrate thine afflictions for thy gain. What a critical piece of knowledge. This is sometimes it seems that our suffering is random on this Earth and many think that life itself is just suffering this Covenant Assurance is that the suffering we face has a purpose it is for our development and growth and goodness understanding the purpose for suffering and opposition and turning to the Lord for Comfort can utterly transform.", " Our afflictions president Allen a chokes said the Apostle Paul taught that the Lord's teachings and teachers were given that we may all attain the measure of the stature of the fullness of Christ. This process requires far more than acquiring knowledge. It is not even enough for us to be convinced of the Gospel we must act and think so that we are converted by it in contrast to the institutions of the world which teach us to know something.", " The Gospel of Jesus Christ challenges us to become something other scriptures in large Upon This by referring to are being judged by the condition we have achieved that's a powerful word the condition we've achieved sometimes I think we imagine that we will stand before the Judgment bar and roll out a list of the things we have achieved a sort of resume of Earth are busy task list. That won't be necessary for the Lord will look at what we are and who we have", " become our being will be transparent strong solid and clear before him Preston Oak said a parable illustrates this understanding a wealthy father knew that if he were to bestow his wealth Upon a Child who had not yet developed the needed wisdom and stature The Inheritance would probably be wasted the father said to his child all that. I have I desired to give you not only my wealth but also my position and standing", " Man that which I have I can easily give you but that which I am you must obtain for yourself, you will qualify for your inheritance by learning what I have learned and by living as I have lived, lehi's blessing to Jacob is a reflection of the man Jacob had both seen the Lord and had great Affliction. Thusly High tells the creation story to him in a different way than it is expressed in Genesis or a", " Abraham here the emphasis is on the need for choice in the face of opposition painting a vivid picture of our mortal experience Lehigh explains. It must needs be that there is an opposition in all things. If not, so righteousness could not be brought to pass neither wickedness neither Holiness nor misery neither good nor bad why Lehigh continued the Lord God gave unto man that he should act for", " Off where for man could not act for himself save it should be that he was enticed by the one or the other. So God is really giving us our moral agency because of opposition men and women would be placed in the way of constant choice and with each choice. They were choosing who they were in fact building who they were Moment by moment before all of the choices of life and in the face of extenuating circumstances.", " We choose courage or cowardice love or the bitter ashes of resentment obedience or apathy Devotion to Christ or to today's popular opinion discipline over appetite. These aren't just random choices because one accumulated on another build one's very Soul because the opposition is so real the enticements. So compelling there is a grounding power that comes from good choice.", " In the face of real opposition it reminds me of a sculpture. We saw once by Gary Price. It was a self-portrait of the sculptures sculpting himself choosing what he was stroke for stroke and chisel line-by-line opposition. Was there from the beginning and to bring about his eternal purposes in the Garden of Eden there was an opposition even the forbidden fruit in opposition to the Tree of Life the one being sweet and the other bidder, Preston Oaks.", " Said if Adam and Eve had not made the choice that introduce mortality Lehigh taught. They would have remained in a state of Innocence doing no good for they knew no sin from the beginning agency and opposition were Central to the father's plan and to Satan's Rebellion against it as the Lord revealed to Moses in the Council of Heaven Satan sought to destroy the agency of man that destruction was inherent in the terms of Satan's offer.", " He came before the father and said behold here. Am I send me I will be lie son and I will redeem all mankind that one Soul shall not be lost. And surely I will do it wherefore give me thine honor president has continued the Satan proposed to carry out the father's plan in a way that would prevent the accomplishment of the father's purpose and give Satan his glory Satan's proposal would have ensured perfect.", " Equality, it would redeem all mankind that not one Soul would be lost. There would be no agency or Choice by anyone and therefore no need for opposition. There would be no tests no failure and no success. There would be no growth to attain the purpose the father desired for his children all of us experience various kinds of opposition that tests us. Some of these tests are Temptations to sin some are mortal challenges apart from personal sins.", " Some are very great. Some are minor some are continuous. And those are the hardest I think and some are mere episodes. None of us is exempt opposition permits us to grow toward what our heavenly father would have us become our development Demands a tough road for the Lord isn't making party guests of us, but Sons and Daughters who have become like him through a process. He has designed think about a world without law.", " Law there really would be no goodness or evil there would be no standard to appeal to to interpret. What was right or wrong all would be chaos. And what happens in chaos, somebody's will finally prevails. It is often the strongest or the most ruthless or the Tyrant who has a Will To Power we can see that in our secular world that has given up any sense of Truth or Eternal law the highest standard we can come up with is", " Moral relativism or as so many put it you do you when there is not a sense of right or wrong any terrible thing goes though. This experience on Earth would teach us competence and character and though our choices are of Paramount importance. Ultimately. There is no flesh that can dwell in the presence of God save it be through the merits and mercy and Grace of the Holy messiah. In other words. We are not earning our way to heaven art.", " Time on Earth is prolonged and is a probation so that we may repent and take this glorious gift Adam feel that men might be and men are that they might have joy experiencing the sweet and the bitter was necessary and the joy even through the opposition is real because we have a savior just as Jacobs blessing is particular to him. So is Joseph where Lehigh quotes at length from Joseph of Egypt's words on the plates of brass.", " He truly prophesied concerning all his seed and the prophecies which he wrote. There are not many greater when she loved to have access to those plates of brass that are filled with the words. We do not have the words of Xena can Cena Sani. Mm and the great words of Joseph who was sold into Egypt and then save the house of Israel. That would be so exciting.", " And great were the covenants of the Lord which he made unto Joseph. Joseph was told in a blessing from his father Jacob that he is a fruitful bough by a well his branches run over the wall. We also learn from the Joseph Smith translation Genesis chapter 50 25 that of his people a branch shall be broken off and shall be carried into a far country nevertheless. They shall be remembered in the covenants of the Lord. This is", " Old in large measure by Lehi and his family who leave the boundaries of Jerusalem and the old world. They had known to find their way to a promised land in the Americas one day pondering this. I was taught something by the spirit and you know, how you love it. When all of a sudden there's an Aha and you know, it's been a gift when Joseph had to leave the rest of the children of Israel his family behind to go to Egypt. It was for a purpose it was to feed them and save them when the world was in famine.", " And later, I realized that Lehi and his family had followed the same type They too had been sent away from their people. They were the branches that run over the wall for the same purpose. What they would create the Book of Mormon was also to feed the world in a time of famine it echoes what the Lord says in Amos chapter 8 verse 11 behold the days come saith the Lord God that I will send a famine in the land.", " And not a famine of bread nor a thirst for water but of hearing the words of the lord. We also learn in this blessing that Joseph of Egypt more than 3,000 years before Joseph Smith's birth spoke of him for Joseph of Egypt truly saw our day and was told a choice Seer will I raise up out of the fruit of thy loins? And he shall be esteemed highly among the fruit of thy loins and unto him will I give Commandment that he shall do a work?", " Work which shall be of great worth even to the bringing of them to the knowledge of the covenants, which I have made with thy father's there's that same teaching again that they will remember those covenants and his name shall be called after me and it shall be after the name of his father and he shall be like unto me for the thing, which the Lord shall bring forth by his hand by the power of the Lord shall bring my people unto salvation.", " Consider this before Moses led the children of Israel out of Egypt before the Red Sea was parted before he received Ten Commandments on Mount Sinai long before when Joseph was serving in Pharaoh's Court about 1500 BC so far back in The Mists of antiquity. We cannot see much Joseph of Egypt already knew of Joseph Smith. In fact knew of him by name this detail of God's orchestration expands our puny.", " Mine's I just love that I do too. It's interesting that in early America fathers often named their oldest son after themselves and Joseph Smith's father was indeed Joseph Smith, but that is not how it went in the Smith family. The oldest son did not get his father's name first Lucy and Joseph had an infant son who is not named then their family order goes like this Alvin Hiram sophronia Joseph the Joseph.", " Who is the prophet of the restoration was the fifth child? And why did they finally get around to naming a son Joseph? They did not know they were fulfilling a prophecy that had been in place for at least 3,000 years Joseph of Egypt also knew that his descendant named Joseph would bring forth the Lord's word that would also convince the people of the word that had already gone forth among them an important role of the Book of Mormon is to Bear testimony of the truthfulness of the Bible. So", " Now we get to what I know is one of your favorite parts of the Book of Mormon Marin its second Nephi chapter 4 and we call it Nephi's Psalm because of their sins Lehigh does not give blessings to Laman and Lemuel but he does give them to their children who have inherited their wicked teachings. He promises these grandchildren that they will not utterly perish and the Lord's Mercy will be upon them. Then Lehi dies and Laman and Lemuel are murderously angry at Nephi one more time.", " In these conditions Nephi begins to sorrow and we see a glimpse of his inner life and vulnerabilities in the last verses of chapter 4 beginning with verse 16. He writes behold my soul delighteth in the things of the Lord and my heart pondereth continually upon the things which I have seen and heard nevertheless notwithstanding the great goodness of the Lord in showing me his great and marvelous Works my heart exclaiming with oh", " Wretched Man that I am yay my heart sorrow with because of My Flesh my soul grieveth because of mine iniquities. I am encompassed about because of the Temptations and the sins, which do so easily beset me. Nephi is really low here and he shares this with us freely. He has reason to struggle but look what he does with it. He says o Wretched Man that I am and my heart's so Earth because of My Flesh yet. He", " has learned how to move out of this place of inner heaviness and darkness. It is a lesson. We can all learn from him. He not only turns to the Lord he moves into the light by embracing true ideas. Here is the Turning Point these important words. Nephi says I know in whom I have trusted that's right. He has to acknowledge this truth and from that Central truth. Everything else can be good. What?", " The Lord done for him. Nephi says he hath filled me with his love. He has confounded mine enemies. He has had Visions in the nighttime in angels ministered to him. Mine eyes have beheld the great things Che even to great for man. Clearly. Nephi leaves the blindness of his wretchedness behind when he begins to focus on the truth of God's unwavering support for him. There's your pattern for your dark days. That is the time to remind yourself of the truth.", " If I may be having a hard time now, but I really do know that God is there I do remember times I felt his love I do know that he has been there for me before he's answered my prayers. He's come through in every circumstance and just talking about that truth begins to fill your soul with light even in the darkest time. It does that always lifts you to have that truth go through your mind and heart it's because truth is light we can say with Nephi. Oh Lord, I", " Have trusted in me and I will trust in thee forever. We love you listeners your dear to us. We think about you all the time. We are preparing these podcasts. Thanks for so many of you who reach out to us. Tell a friend about these podcasts with a new one every Friday. Thanks to Paul cartel for the music. We'll see you next week when we were talking about second Nephi chapter 6 through 10. Oh how great the plan of our God"]}