{"showID": "00f13q3KxUWM67GjNv12ij", "show_name": "X-Pac 12360 - A Wrestling Podcast", "show_description": "Hall Of Fame Superstar Sean “X-Pac” Waltman, and co-founder of AfterBuzz TV Keven Undergaro are teaming up together to bring a podcast with a full circle look at life from outside the squared circle.  AfterBuzz TV presents X-Pac 1 2 360. X-Pac has many stories to tell that may help listeners relate, inspire them in their own lives, or just be entertained. And of course, there will be guests. So plan on seeing his group of usual suspects along with a mix of wrestlers, celebrities, and comedians. X-Pac has known and shared many road trips, locker rooms, and life moments with these guests.  Support this podcast: https://anchor.fm/x-pac-12360/support", "episode_name": "Sean Waltman Talks G1 Climax & RAW Highlights, Paco Alonso Passes Away | X-Pac 1 2 360 #146", "episode_description": "On today's episode of X-Pac 12360, Sean Waltman, Denise Salcedo, and Ty Matthews are breaking down all the updates on the G1 climax as well as our thoughts on last night's WWE Monday Night RAW! Also, in more somber news, Paco Alonso has passed away. We remember Paco and discuss his role in the community as well as stories from his life.   Sean “X-Pac” Waltman and Co-founder of AfterBuzz TV Keven Undergaro have teamed up to bring a podcast with a full circle look at life from outside the squared circle. PodcastOne presents Xpac12360. X-Pac has many stories to tell that may help listeners relate, inspire them in their own lives, or just be entertained. And of course, there will be guests. So plan on seeing his group of usual suspects along with a mix of wrestlers, celebrities, and comedians. X-Pac has known and shared many road trips, locker rooms, and life moments with these guests. Where these conversations will go? No one knows, but we do know they will be entertaining. About The Show: AfterBuzz Tv's Keven Undergaro alongside Sean “X-Pac” Waltman bring you a podcast with a full circle look at life from outside the squared circle. AfterBuzz TV presents X-Pac 12360. X-Pac has many stories to tell that may help listeners relate, inspire them in their own lives, or just be entertained. And of course, there will be guests. So plan on seeing his group of usual suspects along with a mix of wrestlers, celebrities, and comedians. X-Pac has known and shared many road trips, locker rooms, and life moments with these guests. Where these conversations will go? No one knows, but we do know they will be entertaining. With X-Pac, guests are just friends hanging out having a chat about old times and new frontiers. Listening to these conversations will make you feel like you are a fly on the locker room, green room, or bar wall.  ---   This episode is sponsored by  · Anchor: The easiest way to make a podcast.  https://anchor.fm/app  Support this podcast: https://anchor.fm/x-pac-12360/support", "duration": 63.93421666666666, "transcript": ["Hey afterbuzzers, before we move on to your next topic. We just want to say thanks to our sponsor. Anchor. If you haven't heard about anchor it's the easiest way to make a podcast. Let me explain it's free. Plus there are creation tools that allow you to record and edit your podcast right from your phone or computer. Also anchor will distribute your podcast for you. So it could be heard on Spotify Apple podcasts and many more plus you can make money from your podcast with no minimum listenership, and it's everything you need to make a podcast in one place download the free anchor app or go to Anchor.", " Um to get started presented by AfterBuzz TV and hosted by Hall of Fame Superstar Sean xpac Waltman. This is X Hulk One Two Three Sixty and now your host WWE Hall of Fame Superstar Sean x hawk Waltman. Welcome to xpac one to 360.", " Hey, so yeah, do you guys have a good long Fourth of July weekend? Absolutely. Yeah a lot of wrestling to catch up with it was kind of hard. Yeah, would you do I worked all weekend actually fall for days. I was working. So literally on Sunday, I was catching up with the G1. I was catching up with slammiversary. I was just like wow, there's so much happening and then I gotta have everything done and watch while the next day. Okay. I was too much.", " My girlfriend and I we took a few days. I like the third and the fourth and we went and rented the air B&B right on the beach on Malibu ice white legit like the walk that when the when the waves hit they Splash up onto the front window right like the dog like, oh, wow, that's right fucking there. Yeah and just stayed there. You know, like, I mean, I went to the grocery store and filled the fridge up with groceries and and really just didn't leave like for two days.", " And watch the fireworks all up and down, you know like up from from where we were you could see all like Malibu's there's two there were two displays going on in Malibu and Santa Monica didn't have any but like Marina Del Rey did and like all the other cities down going south down the coast, right and you could see all of it was ridiculous. That's awfully nice getaway kind of connect a little bit Yeah and Lou, you know, Lou loved it. She", " The wave-like one of the Waves came up and like it pretty much covered her though. Yeah, it was it was fun. That's awesome. Yeah, what's fun? And and so I kind of forget about this until I'm right now I'm thinking about the weekend like so we left.", " and I'm driving back home from Malibu going down the PCH and there's a fucking", " you know the cops have someone pulled over on, you know, the opposite, you know the other side of the highway and", " and now we're driving a pretty small car and I'm driving and", " this fucking dipshit in a big-ass pickup truck just fucking slammed right into the back of rear-ended the fuck out of us. Oh, fuck. Oh, yeah. My girlfriend's like a", " Fucked up, you know I had to you know get looked at and you know lawyers like, you know want me to go get looked at and I'm just sure it might be something wrong with me, but I don't I can't tell yet. Like there's you know, I feel fine, right is that right is I'm all like, you know, I mean like I'm just used to it, you know, I live in chronic pain. So it was", " And this is when you guys were coming back obviously. Yeah. Yeah, so he just rear-ended you guys that would happen but we wasn't paying attention. He was looking he was fucking rubbernecking what I mean by that Rubberneck is like looking around when you're looking at the accident or even like well they say when another accident happens if you're looking at it, that's when another accident just like when you're when you drive in a big-ass pickup truck", " You can't like be a dipshit like that. Right? And that's a tricky stretch Road. Anyways, yeah, you know, I mean like yeah. Anyways, yeah, so", " I'm just my body is used to trauma sure. It wasn't a huge thing for me. Right but you're a little bit banged up. Yeah, is she? Okay like right now or I mean she's able to go to work and everything. But yeah.", " Fuck that's a second car is like that's been rear-ended last few months. What was the first coming to my house? I got no way to my house and 134 one night. I don't know how many months ago. It's been now. Yeah. So yeah for her poor thing anyways, all right. Yeah. Well at least yeah, I love you guys are okay that kind of shit as a good.", " My fucking weekend. Hey guys, I got a like yeah. What about the earthquake? Oh, yeah, we were there. Oh, yeah. Yeah, and then when we got home the next day I was so we got a ran a rental car right is the cards all fucked up and it's like a pickup truck and I come in to pick up in the parking lot or in the driveway at house, and I'm like the car.", " I started up and I'm like get ready back out and I don't know I stopped for some reason. I'm fucking around and in the driveway and all of a sudden the truck starts shaking. I'm like, yeah, what a piece of shit just our kids like this fucking thing is he's shaking. All right. Yeah, you know, my girlfriend comes running out like I'm like, I'm like what?", " Earthquake. Oh my God that it was definitely not fun at all. Everybody. I was just kept thinking like I really hope that the big one isn't like coming, you know, because everybody's always talking. Yeah a big one the big one where I like things are going to break apart. Well, that's the thing luckily. Luckily the epicenter of this was far enough away because it technically was bigger. That was the bridge Quake. Yeah. That was a big one. Yeah both but I mean like they just were like the one that you know, the one that's closer to the city or the fucking State of California Falls.", " I just keep thinking to myself like God like, you know, just don't let it happen. You know, I guess when you get I mean not like I'm this old fucking man already heard, but I mean, we I'm gonna do a little been to a thing or two like I mean, yeah, it was an event but it's not it wasn't really that big a deal right? And also when you when you live here", " It becomes massively Mexico and which could segue us into the next thing we want to talk about when I lived in Mexico. I had been in a pretty badass apartment building like and there was a six-pack a five or six that mmm, you know, Mexico City and the fucking building hit the neck like it was shake it so much it hit the floor next to it. So but they make those buildings down there.", " I think probably here to especially down there but there's much seismic activity. Yeah. Tell her I said that hey guys Mike activity. It's goes on down there. Like they make the even the foundation's I think are you know, like make the building so it's able to move exactly. Yeah. They say it's supposed to sway, right? Okay, right. But yeah, you mentioned living in Mexico your involvement with Lucha Libre. Obviously a lot of talk about locating the world. Let's go ahead.", " This weekend major news broke that the president of cmll pocket Alonzo has passed away at the age of 67 very unexpected. We still don't know the exact cause of death since he is a very private man. The family hasn't actually came out and said specifically what happened. All we know right now is that there was no actual plan in place. At least none that has these crazy for who is going to take over the company. So just a little background on this Paco has actually been running the", " P'nay since 1987 prior to that the company was founded and being run by his uncle Salvador who was running the company and was founded the company in 1933 making it the first major promotion oldest major promotion in Mexico. So it's probably in the world. Yeah. So this is like a big deal the fact that the person that was Reno in charge since 1987 is now, you know, God and we don't know what's gonna happen as of right now the person that is the", " I guess you can say the face of the company. It's his daughter Sophia Alonso who is 28 years old has a marketing degree, but apparently is not very knowledgeable of wrestling and wrestling so it's kind of like a very big only the wise words are circling right now, right the more ways than one unfortunately. Yeah Power grab I can see like everyone scrambling and yeah, I you know similar thing happened with with AAA with", " Antonio Pena when he passed away I was like, okay who's going to fucking run this thing? And that's how you know, Dory and ended up running. You know, what's 23 24 years old at the time sure, you know before that. He was the guy that brought me my pee when I came down to AAA and he gets to look like indoor use huge wrestling fan, right and just you know, all of that and in still like it was it was chaos.", " You know like how things were run after paying it passed away. And so it's yeah, there was I mean, it sounds like it's kind of a similar situation, you know not but people expected Pina actually when paying a past like he was sick for a while, right? So there was a little bit different but still without having any successor or you know, any kind of thought.", " Like I mean, I don't know, you know, whether he had you know thought about things like that. I'm sure you probably had mean wooden anybody in that sort of position would have to think about you even people that you know, they don't have much to their names. So your regular ordinary Jane Doe it's also going to think about stuff that you know, when you pass away your children money or if you don't I don't know if you have anything. But anyway, that's what I'm trying to say. Like even the regular person thinks about this. So I would believe that maybe they would have thought something about this but here's the thing too. Is that the family", " Self never cared about wrestling in the sense where their money and their big life focus is on real estate. So Paco was the one that was running things because he was the only one that I guess you can say wanted to you know, so now it's kind of like, you know, you could either have wrestlers that are you know, trying to get to that position but it's kind of that moment where you're like who rightfully goes to this. He was just like he wasn't the booker right? I got out of the booker. Who is it? Welcome, okay.", " They don't like him. That's how things go when you get a new person charged you get the people out that you're doing and I'm fat, I guess anyways, but I", " I have deal. I have my experience with Paco. I I can't I only met with him one time and I just nothing but positive wonderful guy wonderful wonderful guy and I'll tell you the story in a second and in that but everyone I know that work for him.", " Even people that like he had a grudge against iconian. I had nothing but good things to say about him. Hmm, you know, so my experience with Paco is you know, I don't think you spent a whole lot of time being mad at me, but I probably wasn't as favorite person after this and I could totally understand why so back when I was in", " In Mexico when I was living there and you know, I had I don't like it all off into what happened with me down there because that goes into a whole different direction. Anyhow, really bad thing happened with me down there and I went away for a while and I came back. It was basically okay was my suicide when I hang myself fuck might as well just say it right and so I went away for a while like four months. I was at this place.", " Houston is you know facility where I got better, you know menninger clinic by the way, just to give a shout-out to my anger clinic. So anyways, I when I leave there I go back to Mexico and you know, I was told like AAA was okay. They were they would give me work if I came back and honestly, I can totally understand them not wanting to book me after what happened with me.", " You know, like that's a major, you know, it's a huge thing and it's like what the fuck right is going to do this again if we bring him back to work so I get that but anyways, I go back down there thinking I got work no work. I'd lose my apartment like because I didn't have money to pay for it. Yeah, and so I ended up in living with Moody Jack Melendez who used to he was like kind of the booker. He you know edited the TV show did all kinds of shit there.", " And Moody also the computer Eco use, you know behind the scenes of big, you know, part of Puerto Rican wrestling wonderful guy. I love Moody. I miss him. He has my cat one of my cats still. Oh, yeah, Puerto Rico. So yeah, I'd have been homeless. I was basically homeless in Mexico and so I in this is where Mark jindrak you guys know, Mark jindrak for sure. Yeah, Marco Corleone. He's getting pushed pretty good, but", " But not as good as he could have and should have been sure and the MLL but CML, I'm sorry. Anyways, like so I would go connect what Mark while I was down there and you know like Mark talked to Paco because AAA wasn't fucking using me. So Mark talk to Paco Paco like watch some stuff in me and just really liked what he saw right? I call the WWE stuff and", " Anyways, he brought me in and you know, we had a meeting and they had this big 75th Anniversary. Show me the Mexico and yeah, so like I made a deal with them and he gave me a great deal like it was great. And so then they had this big announcement and press conference. I'm going to wrestle Ray bucking arrow for the like junior or light heavyweight belt and", " At the Big Show and honestly I got was I wasn't in I wasn't no kind of shape for a singles match like that. Right? Right, and I'd a me money like to try to prepare I fucked up. So but as soon as as soon as the big announcement happens and I'm on the magazines and everything. I'm going to go to Arena México for this now all the sudden Dorian AAA. Like whoa, what do we have to", " To do to get you to stay. Mmm. And like honestly, I wasn't prepared to have that fucking sick single night, like full disclosure being, you know thousand percent honest. I wouldn't I went prepared to have a matched singles match that quick. I looked like shit a lot of things and so and I was I knew AAA for better or worse I knew that and but so on I told", " Them, you know and I told my wanted and so to read in Mexico wasn't doing anything really with Rocky Romero or Alex Kozlov. Yeah, so I'm like, yeah give those guys a job too. And and and so but he really dirty and really wanted jindrak I see right and so like he's like, can you get a until I was okay Dorian, you know part of the deal was he had to give me a front.", " Cash bonus to come back signing bonus and so it's he's like, I'll give it you the bonus but you got to get a meeting with you know, Ginger at sudden meeting up with jindrak. So that happened. And anyways, Rocky and Alex came over with me and we started that group called degeneration Max. Right? Right, which worked pretty good like it was over pretty good.", " For Bunch baby, you know, you know American bases, right? Usually if you're an American, you're fucking heal. Yeah, right. So anyways.", " Yeah, and then jindrak came and so obviously I kind of reneged on the deal with paco right? And so you never ended up having them every but narrow never went to cmll after that after there was a big roll out the red carpet and everything. So yeah, see how he could be a very upset after that. I don't know how upset he was or wasn't but like yeah, did you guys ever talk and never after that? Never know?", " No.", " No, so but yeah, that's the story. Yeah. Yeah. I mean I'm not I felt like it was the best thing for me to do and it was right but I would not have been doing myself any favors going and having that singles match at Arena México sure at all so I know but I can see how like he know he gave me another just not right? Yeah.", " Yeah, it's crazy. Okay. So so anyways the deal I have with AAA so then like serves me right? It's my fault for fucking taking anyone's word for it. It wasn't a month or two or they he went back on his deal and I didn't end up like a pretty much fucked and oriented. Oh, yeah. Yeah, he knows it too. Yeah, I saw Dorian that double or nothing. Oh, yeah, we came up to me was you know, really cool.", " You see me. I was happy to see him. You know, I hope so, I think so, right, you know, I don't think he's who could like. I've said some shit about him like worse than you know me. Just telling the story right now, you know at times being mad about certain things and then like blown up on Twitter just stupid Twitter shit. That's right, you know, he kind of wish you didn't do afterwards. But yeah, so now I'm so pretty heartless like that is what happened, but I'm not only grudges over.", " And I wasn't the easiest guy. I like to I mean there was we had some complaints but nothing major Ryan's in major. I wasn't doing anything then I showed up at work. I did a great job at work. Hmm, and you know now I wasn't clean and sober but fuck who the fuck was in that locker room me a break shit. Wow. All right. Sorry. I'm just like blown away this story. Yeah. Wow, what a huge loss.", " Right great, man. Definitely and you know, yeah, so you think bummed out that that's my eat on the way that right there hands with Paco ended. So so what do you think's going to happen? Do you think it's just going to be like a just War brief lots of drama to come there's gonna be a lot of", " Yeah, that's going to prove. I just hope it doesn't result in like the ends of the company like whoever takes over. I hope that they just make wise decisions and it's a good pick someone else. There's a lot of things that like, okay for one thing. I never thought things. I never thought I'd see I never thought I'd see a AAA show an arena México. Hmm. That's fucking blew me away when I heard that right? I mean, I know they they rent the shelves out. I mean, I know like Arena México.", " I was renting it out to other promotions, but you're not their main competitor. Right? Exactly. You know, I mean, they run it out to the circus and like all kinds of shit like that and they make huge money Arena. México makes huge money on parking interesting. Yes, because it's you know, the that's basic kind of downtown is Right. Mmm. Well every fucking part of every it's all downtown. It's like Mexico's biggest fucking city in the world. But yeah, I know.", " Yeah, even when they're not running events, they have that parking lots full. Yeah, so all right. Well, we actually have to continue talking on so the few days prior to the death to the announcement of the death of Paco. It was announced that perro perro Aguayo passed away at 73 years old old biggest draw on masked wrestler. Yeah the city ever did. Did he ever wear a mask? I", " Remember that he was? Okay, so he okay. So I know that Conan beat him for his hair and he unmask Conan. Yes, so I don't recall him ever wearing a mask, but I could be wrong though in the state's, you know, like a pretty sure Kona and have had LA Sport's Arena or SoCal stay or anyways, where they had this big the cage match and sure, you know, the three-way Feud with Conan and CN goddess. Yes in cars, and then he", " Also had an in this Feud with Conan itself, which was you know, what how put Conan on the map started wrestling in 1968 help fund help fine found found. I can't even talk anymore AAA in 1992 his son as we all know died in the ring better Aguayo Junior in 2015 at the age of 35 breaking his neck after an enduring accidents. So that was you know, that happened just a few years ago, and now you know, he passed away and I know he had dementia, but I don't know of that.", " It's like the cause specifically in this death that may tie into it. We should imagine it probably had something to do with it. But in terms of you know a legend in Lucha Libre, this is like about as big as they get. Yeah, I mean just sort of like El Santo, right? Yeah. Exactly. Yeah everyone else.", " He's as big a star as anyone you could think of. Yeah, sure. So just like two big things that happened in the world of you know, Lucha Mexican wrestling literally within days apart. So it's kind of like, I don't know. It's pretty crazy. I think yeah. Wow, I just you know, it's so cliche a to go out thoughts and prayers and you know, all that wrap up me. What do you say? Yeah, we're saying, right.", " I'm just you know.", " and I'm not the big religious guy either about yeah, I know I", " I", " I'm sending some prayers their way. Sure everyone down there. Yeah, definitely had definitely a lot of a lot of big chicken up in the world of this really rare for sure. All right, so going to be more stuff to come special the whole cmll thing. So we'll keep updating people as we go but now we're going to go ahead and switch gear. So last week we were kind of talking somewhat of like what possibly could be great news for impact, which was possibly their move to access but now so good news for talent, but bad news for it.", " Packed so both Ali X and Johnny impact are gone from Impact Wrestling after slammiversary. What just happened in the Sunday actually in Dallas and okay. So let me just give you a brief break down Allie X has both offers from aw and WWE obviously if they go with aw, they're going to have really good competition terms of tag teams and the Bucks nutria Bros SCU Angelico Jack Evans got some competition that they could work against and you know how PW build their tag team division even more", " Obviously if they go to a WB either still a lot of great opportunity in terms of really good impact for for positive change or maybe growth I guess you can say yeah.", " Before we continue one of the ways we keep all these shows for you free is by our amazing sponsors. And today Spotify is one of our sponsors on Spotify. You can listen to all of your favorite artists and podcasts in one place for free. You don't even need a premium account Spotify as a huge catalogue of podcasts on every topic including the one you're listening to right now on Spotify. You can follow your favorite podcast. So you don't miss an episode premium users can even download episodes to listen to offline wherever they are and you can easily share what you're listening to with all your friends and following on Instagram you", " Done. So already be sure to download the Spotify app and search for AfterBuzz TV on Spotify or browse podcasts in the your library tab. Also, make sure you follow us you never miss an episode of AfterBuzz TV. Okay. Yeah. I'm interested to see where the because they're like", " It's somebody knows all there the best tag team in the world like you might have a different opinion John like you can't go all that's fucking crazy right now. They're dying up there for sure. I thought that was like best tag team in the world stand by the statement and then I found out the news that I was like, I'm not shocked at. All. Right, honestly like not shocked at all because in the ring, they're crisp they do these crazy things that you would think would come across as maybe looking a little sloppy, but no, they're done clean their hands to get a very very their", " Properly and you know, they have a lot in terms of the whole their whole thing like Persona Etc. And then with Johnny Johnny Johnny impact same thing like he can pretty much go anywhere. I'm assuming he's probably gonna go with aw. I don't know that's just my opinion, whatever wherever he goes. I hope he gets a great deal. He's he's very valuable still I think yeah, definitely more so far so I know he is", " I know he's definitely looking looking to get into more acting as well. So anywhere that might be able to kind of help that along so I wonder what's up with Taya her contract doesn't end with impact until I believe the end of the year. Okay, he still has a bit more to go and not so here's the thing about that. You know, we were talking last week about Access TV, you know, and then being in negotiation, but if you know huge part of", " Huge part of your wrestling promotion as your fucking roster, right? Right, right, and those are huge hits. So it's you know wonder what who do we have up there? I mean, we still have some there's pretty good cages. They're definitely cry. They had a lot of really good stuff on slammiversary Tessa Tessa and Sami callihan went had a really great inter-gender match and I'm saying this because when you watch that match it felt natural state", " Tessa in that ring against Tommy Callahan. It didn't feel like oh, this is a girl versus a guy and I'm so noticing that this is a woman in this match. No those storyline the story in the match was great. The match was great and they just had a lot of different things on the show that worked really well compared to this last year slammiversary. I think last year slammiversary was was was better to be honest and the hype and all of that Jimmy from last year where they went with slammiversary to now kind of it kind of sucks because last year they had so much.", " Type and how everybody was super excited and then this year it's kind of like, oh we're losing talent and you know, we're trying to get a TV deal. I think at this point it's like they need to get something right now because they just need something to kind of keep them pulling forward because you know, if they're their talent is being raided by both WWE and aw it's going to be like, you know, they got to have something to keep that talented. That's how it interested in staying with the company and I kind of feel like that's probably not there right now the talent we don't know what's going on, you know.", " Obviously, it could be being told one thing or another we don't know. So I guess it just kind of depends on that. Well, you definitely cannot blame.", " Any of them for you know doing what's best for them these these, you know, boom periods in the industry. They they last so long, right? Right and you got a fucking you got a score there's a window and you got fucking score while you can during these times, right? Yeah, the fact that there is so many options, right? Yes is a good thing. So alright good for them and then actually before", " Get to that I I'm gonna since you know, I'm just gonna throw this that I know as an order but because he said that there was a lot of opportunity it kind of ties into what's going on with galison Anderson re signing with WWE. So it's been noted that they signed five-year contracts apparently prior to this they were offered 500 thousand and that was rejected. We don't know the actual number in terms of what they got. But obviously it's going to be more than that 500k. So one can only assume they're talking like some big like in the millions type of money for them.", " M so considering the fact that they weren't, you know, really a focus on with the company prior to this and now, you know the are with the club and AJ Styles and all of that, you know big move for them, but your fingers use them properly. They're really fucking valuable right don't have doing stupid shit. Right exactly. You know, like the fucking shit. They were having them do like the little ha ha fucking when the kind of first came around. Well even like I don't know if it was when they first but I can just remember even", " You know not that long ago. I'm right not that many months ago like like, um, like kind of like, you know, like I don't know there was a their segments like there was an attempt at comedy though, right exactly, but just know know which end they and I understand the the the temptation to do that because they are so funny and we've seen them before, you know with like South Pain stuff like that really use their sense of humor, but hopefully they they can get taken seriously this time around", " round now that the bring the club back now that they're putting them with AJ. So I just wrote since we're talking about Gallows and Anderson and this is going off into the weeds just a bit but it's I saw a match from a few years back just the other day and it was Carl Anderson. He beat ton of Hoshi. Yeah. What a great fucking match. That was absolutely. No. I just saw it the other day, and I just wanted to give you", " Props to that and I'll fucking great Anderson wasn't yeah. He did all my God. He did so much good stuff in Japan even even before, you know, like both of you can use him as a singles guy. Yeah you like I mean wait ways. All right. I just think like in terms of like talking real big money. Like they're one of those people is that afterwards when all of this like grabbing Talent thing. It's sort of like, you know slowed mellow down. It's kind of like they're going to be one of the people that really", " It it from this whole time right thing. Mmm. All right, let's move on. Let's talk about Sean spear. So there was a little bit of I guess you can say controversy. So Shawn Spears was pulled by aw from Limitless wrestling. He was supposed to do a show Friday night on July 12 a day before fight for the Fallen fight for the fallen on July 13th. So essentially what was noted was that this was already set in place prior to him signing with aw. They were already, you know.", " He was he was committed to that bright and aw was like, okay, you know, you're gonna come out July 13th, that's fine. You'll be there. So apparently they kept sending flight information to aw and kept saying like oh like is this the good fight for him because a good flight for him. Apparently, they weren't hearing back and they were like not getting a correct answer and then afterwards apparently what happened was that after the flight thing they basically say like, okay we're going to pull him off because he's", " Going to have to do a photoshoot the day before. So after this came out and they and Limitless wrestling posted this online, you know, some fans were very upset and they and the Bucks and Cody did face some backlash after this. So because of that the backlash and all of that he is now put back and he's now still doing Limitless wrestling but a lot of people did raise some, you know, some concerns over that. Okay. All right. Well, I mean, sometimes those things happened. Hmm, and I sometimes you know,", " yeah, so", " what do you do though as a new company? Like how do you say like, you know, obviously both aw and Limitless wrestling had their Pros like, aw obviously needs him for you know, their photo shoot all of that stuff whatever and so does Limitless Limitless wrestling. They also have the thing where does aw say like we're going to put our foot down in this one because well, it depends how you know, apparently it wasn't it wasn't", " That big a deal after all like when they really thought about it, but it could have been something where it was like no, we really do need to pull him and that would have just been hey like sorry. Yeah, that sucks. But like if there was something like yeah, we're I mean, that's his bread and butter. I think I don't know what his deal is. I mean, I don't know what the nature of their deals are there, right? But I think I know I imagine that someone realized that at this point it's not", " That bad publicity, you know if this was something that was already set in stone way before he even signed you try to provide some sort of moral values. Yeah. They were going to provide Tommy Dreamer. I believe well, it was aw going to provide that or did Limitless secure that on their own. Oh that I don't know but I think because that was Tommy Dreamer that was the replacement but we don't necessarily know if that had anything to do with in terms of ghosts.", " But now they're kind of in an advantageous position where they get both now, so hopefully it all everyone's happy. Alright moving on so mlw has announced that their first pay-per-view is coming November 2nd in Chicago Saturday night. Superfight. Yeah. Is it going to be at that same place? They all they've been running Cicero Stadium", " Drum, I watch their show that was on yesterday yesterday. They what's it called fuck now. I can't think of the name of their show. They had right? Anyways, it was where Jacob fought to one title from Tom lawlor. Okay, and there was some other stuff on the show. I mean, I enjoyed the show. Yeah. I enjoyed it. You know, there was some things regular I wouldn't have", " the guy I would have put over in that or hatch or whatever, you know little things but", " Overall, like I appreciate what they're doing. Yeah, you know in the industry that was Kings of Coliseum gangs of Kasi. Mm. Thank you. Thank you Jeff. No worries terms of in terms of them building on the current hype and family that they have right now. This is probably better time than ever to do, you know to do a pay-per-view and stuff like that so I can call for them the people they're catering to a really enjoy the product. You know, it might not be everyone's cup of tea, right but", " I I see a lot of people that really enjoy it, you know and I watch the show and and I enjoy watching it and enjoy watching it. Hey, this is odd. We'll talk about it when we get to Rock Street profits. So yeah, alright. Alright moving on. We also had G1 climax this this weekend as well. A lot of really good matches a lot of talk. Let's first kick it off with let's talk about the audience and the crowd because there were some people that", " that were kind of pointing out the flaws of what was happening in terms of like how the production shot the audience and how the audience was and then there's people on the other side that are like no like the okay. So essentially people were sort of some people online were sort of pointing out like, oh look at you Japan. They didn't draw this many people Etc. Look at all these empty seats, but then there's other people that saw like, no like they had a great audience. Yeah granted. It wasn't sold out. We know that so big", " Let though they had a very engaged audience of her hot audience people that were into the show from start to finish what you know, Sean is not always easy to keep a audience fully engaged in the show, but there was a lot of conversation on that. Yeah, and so it's weird like people have a short memory of how fucking tough it was to put asses in seats not too long ago right to where they going all they can't even sell out a fucking American Airlines Arena. Hmm. They fucking over.", " Half that mean it was over half full. I think they said the number wasn't it the number like 4,000 or something. I don't know. It's it looked more than that. Okay. I bet I've wrestled in that building but you are you'd also mentioned a little bit before we went live that a lot of the crowd was on the the hard camp site. Yeah that happens and they're not a might just be presentation and that's not there like we were talking about before we went on air Access TV produced at right? Yes, so", " They're not in the rest in this tree where they are used to have to for cosmetic reasons like move people shot it like a real sport Charlotte like, you know, everyone else would shoot it. Yeah, right. And and yeah, so yeah, I would probably look better like aesthetically if you know, there were more people I thought the crowd the just fine. I thought it was very respectable because there was some shots like for example, there were certain shots where they had the, you know, the guy's head and then here on the right side or left side. That was just all these empty seats.", " So it's kind of like, you know for a fact that if that was your boy that's tough never they would have worked around it. There's certain ways. All they had to do is buy the stage put some black tarps on those those seats that were, you know, being used move the audience around a little bit and they would have had the energy and everything maybe dim the lights which I know they did it, but maybe the could have I don't know, you know, so I love and they've done it before like that's like I've they did it at the Cow Palace. Hmm. But lights would dim there after I watch the show.", " Alive I didn't watch it back on on TV. So I didn't see that but I see what you mean. They weren't them. Yes all fair criticisms, but I can we get past the criticisms to recognize all the great things about the show sure and like about the crowd and you know, like I mean in Dallas like downs, I'm pretty sure Dallas isn't", " Many have some Japanese ever Japanese Community there, but it's not like fucking Torrance, California. Right? Sure. Anyone that lives out here knows Torrance California has more fucking Japanese people that yeah, probably Japan. It's just like yeah, so honestly like for like for me in terms of like I had heard about these issues prior to watching the show because I watched the show the day after and I was just like, okay, but it kind of did make me upset that people were saying this because I was like,", " You guys are taken away from what's Happening inside the ring. Like people want people have been saying. Oh we want that a wrestling. We want better wrestling on TV. We want better wrestling. There it is. There it was natural turn itive. And so when you put on a show like that for that many people when you go back next time, they're going to be way more people right? That's usually how that works. Yeah. So, okay, you you the people that came were really fucking happy they went right?", " As opposed to going to show and being like, oh fuck that was too long. Some of them, you know, most of matches weren't that great, right, you know, so in many ways I didn't I don't think I saw every single match hmm. Definitely some fantastic a Block matches we can talk about the a balk matches. Yeah for sure. So, let's kick it off with Will Osprey and Lance are charged. Everybody was talking about this one. Yeah, and I have I saw a couple little things that could", " Been tightened up, but I'm not even going to mention them. Hmm. That's just me because it was it was great. That's how you know, as someone that my specialty was that style of match a David and Goliath. Yeah match right and and I just thought it was done. You know, I was done really well osprey.", " I think he's the best guy they have right especially for like, you know.", " The global expansion like can you know like say here in the States, you know blond hair fucking kill a blue eye, you know, right sure. Good luck and fuck her too, right? Yeah is Gears all you know and point. Yeah. I was hoping he would when rants did great though. I'm actually happy for Lance really happy for Lance. Yeah. Yeah. He's yeah, I hope", " Hope they do. I hope they use Lance more like moving for I pay you some better. I think that one of the highlights of this match was the fact that will Osprey sort of made Lance Archer kind of go up a level, you know, like obviously we know that will a spray, you know was the highlight of the match carrying everything Etc. But Lance Archer was in all the right spots, you know, it's you know, it's funny because I was actually saying it sounds like dude all lands Archer has to do is be in the right spot work magic cetera, right?", " Comment people going. Oh, they didn't sound like this and that I canít just fucking I just got a chuckle at some of these people. Okay, it was some of them with the psyche and all the cycle. There is no psychology. Look, I think I know I think I know a thing or two about in ring psychology and it was okay. It was a different kind of psychology. It was a different way of selling.", " And there was done very well very well. Yeah.", " So, all right. Let's talk about bad luck Folly defeat an evil.", " I didn't watch it. I'll match it was what you would expect from both guys. Sure so yeah, sounds good. Oh, there you go. All right. Well, let's talk about Sonata beating Zack saber jr. And wasn't really great technical magical fun considering that Sonata has you know, he was able to incorporate some of his like Lucha Libre techniques into this. So it kind of added for very good counters against Xavier Junior and I think he was what he's probably one of the few guys that could really change Russell with him in that sort of way where it", " It's not your average chain wrestling match with a little different. He ties like guys up front where they can't get out like and then he kicked him in the butthole, right? Yeah pretty much know that I don't I think did I miss it. You know, I mean my thing with that Junior is that every time I see one of his matches and I think", " I got it all figured out and I know he's gonna do next. No. Yeah, it's always something so different and you just think to yourself. Like how did you get from there to there are clouds in matches like that lately. I don't know it's coming puzzle and I think with him joining Suzuki wagon, he's been doing such good character work as well. Like not only is he one of the best in the ring, but he's doing such amazing character word. He said having a match like that for American wrestling fan just like reading Shakespeare to dog. I love that. Absolutely. I love that quote when I saw it.", " Yeah. Yeah, I think him and Sonata are two of the most well-rounded guys that they've got. So yeah, so in it was this match and I did think about it during like the Osprey match to but it was in this match right heard crowd the crowd react to some things that like", " You gotta be an educated crowd to be reacting to you know what? I mean? Some of the more intricate like yeah things like trademark things that maybe like someone that just is a casual watch her wouldn't pick up on right exactly. The whole crowd was they knew they know? Yeah, you know, so yeah, that's one of the things we mentioned off air was that this particular crowd where New Japan fans like you can tell, you know, some of these people had been following the product for a while not just when it kind of got that boom here.", " U.s. You know so I think that's kind of what made this, you know, we're really help the show, you know, obviously. Alright next match a Kenta defeating defeating Coda a Bushi. I enjoyed it a lot of other people that meant more to them than it did to me because I wasn't like I wasn't really up to speed on our cantor's work. Like I wasn't like into was at NOAA that he was a big deal in Yemen are Fuji and I like", " I was saying a different place in my life where I was at to actively, you know, not following everywhere. And so I'm happy to see him. You know after the WWE, right? Yeah, and I can have a good showing like that. Yeah, I get back to a style and a speed that he's kind of more suited to that was you know, so they used to boo boo. She you know, that was a that's a big win for for. Yeah for Continental. Yeah, definitely and I kind of figured", " That's probably what you know, what would happen but still wasn't sure because it boosts she's a big deal, right? Yeah. Definitely. I think that code is probably going to be one of those guys that go super far super far on this one. All right afterwards. We had okada versus Tana Hoshi. Yeah. Yeah can't go wrong with the other people like in that's another, you know, the crowd knew what they were watching and I thought they thought they were the crowd was a tub was a really good match. Yeah. Yeah.", " Always as yeah, and I really it's just you know, I've seen them I've seen their Matt. It was just nice to have a you know card a ton of Hoshi match in the states. Yes night but that being said I got was they didn't take it to the next level compared to their other matching solid. Yeah. Absolutely. Yeah, like it wasn't it wasn't one of their it wasn't one of the wrestling and that's fine, which is yeah. I think they should yeah.", " Yeah, because I think yeah when New Japan really started getting on a lot of people's Radars out here was during okada and Tanaka. She's kind of first real rivalry. And so yeah to have that sort of match in the states is really big and so also something that okay. That was okay. The match was over but that wasn't the end of the TV show. Hmm. They had backstage press conference. Right? And I love that the press conferences are all this awesome have to know what they're saying, right, you know.", " Nice to know subtitle and what oh, I know. Yeah the fucking The Interpreter though. Oh, they could have had a better internet. That's my only complaint. Right? Alright, so there you go. That was like that's what we have here with the the G1 climax next shows on Saturday. So Makemake probably talk about that afterwards. But yeah, it's like honestly it was a good show good show very solid show lots of good matches back to back. All right, let's go ahead and jump", " Into raw. All right. So whoo What do you want to start off with the whole thing? All right. Well, we can sort of talk. Let's get it, you know, so last week one of the major things that we talked about was the whole my Canal is Maria Kanellis. Think do you want to talk about let's go talk about the whole her wanting pickles and ice cream and this you didn't impregnate me and now we get like a even more teas that she's saying Mike analysis isn't the father what is happening here?", " I don't get it now. I just don't get it. Can somebody can someone please explain this to me? I okay. Yes. It's getting like", " No, no.", " No liked it. I mean", " what's better than last week? That's for sure. And I don't know. I don't know about now. It's really bad. I just don't even know what to say about this because I I mean just all of the jokes about the pregnancy cravings and stuff like that. It's so interesting is no no I'm talking about the fucking", " The way that the tree the way they're making him like for sure. Yes.", " We should be like upset by now. Wouldn't he be like I certainly hope so you mean like you weren't at wasn't mad enough to impregnate you. What are you trying to say to me here? You know, if you're a guy what's your response going to be to them your girl your girlfriend or wife or whatever is saying, oh you weren't man enough to impregnate me and Arnold out. Yeah, I'll keep it to myself.", " I just don't want to stir shit, right? Yeah. Yeah, I don't know. It's I did think the non-fat part was kind of funny because you know, the worst thing that guy can do is call a girl fat or insinuate that she's fat. So I did think that part was kind of funny. Okay? No. No, it was not Matt. I'm one of these guys that that understands that you know men have been the shit's for a", " I'm fucking tired, right sure and so a lot of the stuff that's happening. Now we have coming but God damn right? This is too fucking much. I just said like nobody's coming out on top. And yeah, what the fuck come on? What did we think about but about what do we think about Ray answering Bobby lies a balance? I hate it. Yeah. I don't hate him getting sacrificed to Bobby Lashley. I hate him coming out and going open town.", " Anybody in the back and then somebody coming out and fucking and just destroying and make some good dipshit. I hate to say cuz I was raised a legend right but not exactly a fucking do that. You know, it's fine that they're selling the whole I call Bobby lashes like this big large guy, but Ray has gone ahead with plenty of large guys. That's the thing is like I get the desire to want to make Lashley look strong going into the last man standing match on Sunday to make re look like a dish that you've got arrested.", " You've got a roster full of people that get him to do it.", " That's my take on you. Okay. So before we you mentioned the street profits before do you want to talk about that a little bit? Yeah. Hey, so what's that teams a private party party? Yeah. My theory is that those guys got a buzz going right after that from yeah. Yeah doubler. Yeah double or nothing all that right there. No history. Yeah. Sorry. Yeah, that's the one. Yeah and like so Street Roberts is a very similar gimmick. And so they're like, okay, let's", " Get them on TV. So everyone doesn't think the street profits are fucking knock off a private party. Right? But it's the the hardest part for me to Fathom is that they they bring up the brand new NXT Champions. One of the best teams in the company. All they're doing is just chilling the pay-per-view. I don't like I don't like I don't know. I don't want to keep going. I don't like this. I don't like that. I mean right because there's a lot of I mean, well, there was also some things I like World some people were also you know,", " Not the fact that they had the tag team inter-gender match with Becky and Seth and brother and Selena and the fact that it was only like women versus women and men in contact right some people feel like that was a little bait-and-switch. He liked people just were expecting to see some man on well in violence and they didn't get it. I think the only reason people might be thinking that is because we saw Becky tap out my Canales sure and so we thought oh maybe", " Be Silver Lining maybe we're getting slowly inching closer to inter-gender stuff. Yeah, but with this it just it it's such a weird decision to have a mixed tag match, but then make it a limitation because it's basically you're just looking at two separate one-on-one matches them. Like when we can only fight women men can only fight men as soon as one is eliminated. Like why was Becky standing on the aprons the whole time now is it but you know, I'll just say it but could not mic the mic and they're fucking with you.", " Fucking with you. You got some heat or something, right? It's I will say I will say not all over the headlines tomorrow. I will say just so that everyone just so that it's not all bad the stuff that obviously one Rollins and undried a was in the ring was of course, really really good. We're talking like yes 100 a and Rollins was in there. I love their work and as Lena Vegas also in kind of amazing everyone involved.", " His good. It's all just everything surrounding it. That's sometimes confusing. What about Shane McMahon and Drew McIntyre going around trying to find a partner for Roman Reigns and then they did the whole when it was weird. I mean I kind of liked it but I was like then it just like there was a weird way to finish it. Yeah that that angle is tried and true and wrestling but part and parcel to its success is like the face is getting one over on the heels. You know, when they think it's just some asshole janitor.", " Cedric Alexander has some pretty fucking hands because when ice when I was waiting to figure out who what I was looking at the hands, I'm like, those are some night. That might be a woman in there. I fucking dog hands up. That's hilarious. Yeah. Well, I'm just trying to figure out right but it just it's it puts him in such a weird position to come out he gets the shy and doing all this, you know high-flying offense and then he still loses almost dead. Yeah. It's like, all right. We'll try it on over.", " Lee fine, but if he loses then nobody's gonna care who's underneath the mash weird if he'd come out I think if he had come out gotten a quick flash pin on Shane and you know, like they go off the air being Furious because it was funny. Yeah, like yeah, it would not have hurt anything know if I can especially if Roman was a big part of the reason why it happened, right? Yeah exactly that what it would not hurt Shane and I would have helped Cedric right quite a bit. Not that that hurt like that helped him a bit, right?", " For you it just for this for the for the sake of the segment. Hmm. Like I would rather saw the one of those guys get beat. Of course one of those guys mean and on the other team, right and our dreams. Yeah. Exactly. All right, it's Karis mask, right? What the fuck do we think? I mean that's got to be so like okay, it's not that", " Make a deal right here in the States but like some people don't take that shit like and that's the thing. Am I reading into it too much to think that they that might have been a shot at Del Rio kind of like, I don't know. Who knows. Who knows. How do you guys feel about the drink dinner time? So one time they were doing this thing in the Attitude Era we're fuckin big turkey known has brought in Mexican stars, and they did this thing called super Astros. Yeah. I remember that night and so one time", " Antonio de Santo is and I knew him from you know, Japan and everything. So I was familiar with them. I don't think anyone else really too many people there knew him, but", " you know that they talked about how you know serious they were about those masks. Right and Santo was in the in the cafeteria eating without it on hmm, which like usually it's like home. Are you doing abs so fucking Brian Christopher's crazy-ass goes into his bag puts his mask on and walks into fucking catering. What's not then, you know, he didn't make a big deal out of it, but right, you know, yeah.", " Buddy cut of yeah. Yeah, you wanted that one a gun over to outfit if he would have done that in Mexico, right? Exactly. So, all right. So you mentioned the Drake man Drake 24/7. How do you feel about that? What the third Jake Maverick thing with his wife and the whole the 24 second title videos on that but we got to be careful. We don't want to be you know, like it can go from being enjoyable to too much right? It's like they can hit a point of diminishing returns real quick. Yeah.", " Really explains like why he went back like he could have gone on his honeymoon where and that was one of the things is like, why are you going if you're trying to avoid everyone, where are you going to the city that Roth happened? I didn't like the what fell flat was the be alone with my baby tonight. That's a like who is this? Who is this who wrote that as much as I love that song? Yeah, but I wasn't buddy I got right here. He goes in there.", " I was just trying to be a good soldier right fuck.", " Alright, let's talk about Ricochet Gallows and Ricochet versus Karl Anderson. And then basically AJ coming in into attacked Ricochet afterwards in the club and all of that was fun. Hmm. Say that again. I mean I would have liked that.", " I like the fact that both gallons and Anderson. I think just a week after we're trying to resolidify Galas and Anderson as a serious threat having him having to run through both the match different. Yeah. It's like I like it. I just would have put the mat I would have I wouldn't have done the match like that right now. I'm not really gonna get all off and no sure it's just how it is.", " The front and it would have worked better. I don't like the fact that they were like, you know, he had these two they had these two chances and maybe there were better all things being equal and I could do all the amazing shit that ricocheted up. Right? Right. That's all I meant by that and he's and the stuff in the ring is still it's awesome. I love seeing him work with them and kind of that Dynamic but I don't know. Like I said just a week after we're trying to rebuild them as a credible team and", " as a credible faction. Yeah, I knew that there were I think there are better ways to do it and honestly those for the main points of raw. Other than that we had no way Jose versus Cesaro Cesaro won the Viking Raiders. I can read we have to beat the Clock Challenge to Beat the Clock Challenge Bailey versus Sarah Logan Nikki cross versus data Brooke. Actually thought Bailey versus Sarah Logan was it was a pretty nice match. I just really wish they would do more with Sarah Logan anyone see where Amber moon was going off on Dana Brooke about like stealing like one of our moves and the suplex.", " Where did this happen? Anyway, so that more Twitter. Yeah, I was on Twitter. We gotta have it under saying many to me. We should have a lot of drama because it looked like just a basic suplex and I'm like, how does anyone have dibs on that? Right? Right, right. So never enough.", " All right. That's what are we done? We're done. We're done finished fucking finished. All right, you can stop the flu by and it's fun. Yeah. All right. We're out of here late. No real quick. All that shit. Don't forget to follow us on youtube.com youtube.com slash xpac. We're almost about to hit 10K guys can check us out on Spotify. Anchor Stitcher check out your favorite podcast apps and find Us Xbox One to 360. We're also on Twitter Instagram and Facebook. Make sure to check us out there because we're always posting.", " The stuff that you don't want to miss out. You guys can follow me on Twitter and on Instagram at underscored in a Cell Statham. I find me on Twitter and Instagram at time Matthews PMA. All right at the real Lex Puck on Twitter at real xpac on Instagram. What Baby Luna? It's Baby Lulu. Yeah Instagram. I haven't posted on because I can't remember the login information. Ashley Daniels was the one that set that up. Anyways. All right. All right here see you next week.", " weak", " and the entire X pop One Two Three Sixty staff. Thank you for tuning into Xbox One to 360."]}