{"showID": "00fg6LJN0BZF7tWiQN0Ywo", "show_name": "Narcissism Recovery Podcast ", "show_description": "Insights on narcissism and techniques on how to heal after narcissistic abuse.", "episode_name": "Narcissism and Mental Illness ", "episode_description": "In this podcast I discuss the connection between narcissistic abuse and mental illness.  ", "duration": 9.787983333333331, "transcript": ["Hello everyone. Welcome to narcissism recovery podcast. I'm your host its Epstein. I am a narcissistic abuse life coach and today. I'll be talking about narcissism and mental illness first. I'm gonna Define mental illness according to the American Psychiatric Association", " Mental illness or mental illnesses are health conditions involving changes in Emotion, thinking or behavior or a combination of these mental illnesses are associated with distress and or problems functioning in social work or family activities. I have a slightly different definition that I like to use. It is similar, but I'm going to Define mental illness as the ability or I should say the inability to correctly assess a situation because of", " Channel dysregulation leading to behavioral breakdowns and mental disabilities. So the reason why I want to make that sort of slight adjustment to the definition is because I want to bring attention to the fact that the individual is has distorted ability to assess the situation and see it for what it is. They're oftentimes seeing it from an emotionally reactive state which leads to decisions that are dysfunctional not healthy and not aligned.", " With the individuals best interests or I should say best long-term interests. Now, the mind is extremely complex. So there's never usually one answer for all mental illness. There are so many different things that come into play when it comes to mental illnesses often times people say it's genetics. Some people say that mental illnesses are from abuse. I'm say that mental illnesses are coping skills that have that are not that are maladaptive now.", " To bring in some inside here from Maslow's hierarchy of needs according to Maslow. There are five sort of pyramid. Look on the top of the pyramid. There are five different hierarchical needs that are that work in a hierarchical way on the bottom. There's physiological so your food and your your sustenance. Then there's safety. Love belonging is next esteem is next and the top of the most", " Important need we have as human beings is self-actualization. Now without any of these individual stages or should say needs being met. There's going to be a lack. There's going to be a certain need to fill and ultimately what happens is that the individual who's missing that lack and cannot get the need met through healthy means will oftentimes revert to dysfunctional means addictive means manipulative means in order to fulfill those needs.", " An addiction for example is a desire to get love and belonging most often and it's a need that is met by manufacturing and experience that feels loving and belonging and in self accepting. So the attic for example, we'll be looking for that love that acceptance that comes with the safety and love of the drug or the addiction.", " Without these needs met the individual becomes sick now, they might become sick physically oftentimes mentally and it can be argue that anyone who is essentially mentally ill could be really just be in the lack of their needs being met and trying to really cope and deal with the lack of those emotional psychological and mental needs being met such as self-actualization belonging.", " Self-esteem I want to connect this to narcissistic abuse narcissistic abuse victims, but really narcissistic abusers themselves are underdeveloped. And therefore they resort to exploiting others to get their needs met the most common need I would say with narcissistic abusers is the need for belonging and love", " Now because of their feelings of Shame and humiliation and feeling less than from host usually their own abuse renting them rendering them feeling unacceptable. They therefore look to others to manipulate to exploit to make themselves feel better to fulfill that unmet need.", " Narcissistic narcissistic abusers are looking to their victims for a supply a narcissistic Supply to make up for that deficit. So whatever the esteem physiological psychological emotional need that's that's that his unmet the perpetrator will look for victims who can fulfill that need and then take it essentially steal it exploit them for it.", " This can happen for any need.", " They may be looking for safety and cling to a wealthy partner to exploit them for their front four Financial safety victims of abuse might become codependent. And while this isn't necessarily narcissistic there is similarities in that they're looking for a relationship for that love and safety and connection and maybe lack of a Russian see to resolve the abandonment feeling through the relationships in that way. They're looking to get their needs met through the relationship even though the relationship is", " Not necessarily not ultimately fulfilling them in other ways. But at least they're able to Sue this one need.", " I want to offer some tips on how to deal with having unmet childhood needs because if you go into adulthood and into an adult relationships trying to get your childhood needs met it will there is a high chance that you will key in on somebody who's able to offer you that need but ultimately might be emotionally unavailable or potentially abusive and that's why it is important to meet your needs your childhood needs in adulthood.", " Through doing the inner child healing work in order to make sure that you don't look for abusers who will do what is called the repetition compulsion. The repetition compulsion is a compulsion to repeat your traumas in adulthood essentially to finally get to resolve that need and ultimately move on past that developmental stage when this doesn't happen. We essentially are looking for adult relationships which often times become a repetition they become abusive and that's why it is important to heal your childhood wounds.", " Before you enter into a relationship and this is done by self-reflecting identifying wounds identifying triggers identifying behavioral patterns that have worked mostly coping mechanisms, identifying addictions identifying core beliefs that stemmed from having your needs not met. For example, I can't get my needs met is a belief and therefore what we end up doing is we end up creating scenarios where we can't get our needs met such as manipulative emotionally unavailable and potentially narcissistic abusers who may even", " Promise and exploit and pry and kind of key in on the unmet needs of the victim really an exploit them and that's essentially what narcissistic abuse or do they see an unmet need key in on it promise to fulfill it and ultimately never do stringing victims along in the hopes that they can get that childhood need met. It's extremely important. Like I said to heal your childhood wounds healing your childhood wounds is not just for relationships. Even if you never want to be in a relationship again healing your childhood wounds is", " Necessary because if you don't heal your childhood wounds, like I said, you are a victim. You are a hostage of your past. You cannot move on into adulthood. You cannot be fulfilled. You cannot self-actualize you cannot be fulfilled and truly happy. So even if you decide not to be in a relationship, even if you decide you're going to defend yourself from relationships because of the pain that you have been through which is totally an entirely understandable. However, in order to really truly be content and satisfied and at peace within and have mental health", " Otherwise, we will there is meant you know developmental stages the lack of that developmental stages fulfillment of Developmental stages creates this he's mental this he's so in order to create any form of peace and health happiness and fulfillment within healing your childhood wounds, which will ultimately lead to Health on all levels.", " The Minot therapy system, which I work with is designed to help you identify your childhood wounds resolve the conflicts of childhood that were not resolved in childhood and ultimately heal those wounds so that you can move on into adulthood and manifest your best life without doing so unfortunately these pull us back. They pull us back they drag us down because you cannot move on into adulthood without closing the file with your abusers with your past and that is why healing grieving resolving.", " Conflicts and closing the file emotional file is Paramount for health for mental health and ultimately to avoid any exploitive relationships that promise to get your needs met. If you're struggling with this issue. If you have childhood wounds and you find yourself in great mental distress understand that it is an indicator. It is a symptom showing you that there are wounds you need to take a look at that and identify what those wounds are and heal them.", " I'd be happy to work with you. Please do reach out if you'd like to find out about how the mind map therapy system could be a good fit for you.", " Please do reach out to two five two six nine six four eight five two. I can be reached by email yet. So that's why I TZ at psychological healing center.com. I offer free 15 minute consultation. So if you are struggling, please reach out to me and love to hear from you and identify how I can help you and if the Mind map therapy system is a good fit. So thank you so much for listening to this podcast. It's an honor to bring you this information today and until next time all the best."]}