{"showID": "00G2HnDiIPFHXlclQTI03y", "show_name": "The Real Madrid Podcast", "show_description": "Presented by Tim Caple with new podcasts out every week. The worlds greatest football club Real Madrid generate a huge amount of news, rumour and speculation here at the Real Madrid podcast we round up all of the current headline making stories relevant to Madrid.", "episode_name": "Llorente exits to Atletico as Mendy checks in ", "episode_description": "Llorente becomes the 1st significant exit of the summer as he crosses the city to Atletico, Maldini and Boban in Madrid to discuss player signings, James Rodriguez move to Napoli still to be completed, Reguillon to team up with Lopetegui at Sevilla plus latest headlines involving Mbappe and Neymar. ", "duration": 6.280216666666668, "transcript": ["Welcome back to the Real Madrid podcast for this re Friday update lots of headlines around today about potential signings either now or in the future of killing and babay by Real Madrid and the fact that he's a target for 2020. Nothing really new in any of these stories. One thing is for certain is going absolutely nowhere this summer one who might be is Neymar. He's been seen posing in a picture with Karim Benzema that's going to do little to enhance the prospect of his rival Sudan remember has", "An adamant that he has absolutely zero interest in Neymar would far prefer the services of Pogba staying with the rumors and there are plenty of those around today. That's there is going to be an eleventh-hour intervention from Real Madrid to try and poach Mattis to licked from his intended move to Barcelona. They've requested details of how close he actually is to signing and what his demands are polymer delians vulnerable boban part of the legendary Milan.", " Teams of the late 80s and early 1990s have been in Madrid in the last 24 hours to discuss potential Acquisitions for the coming season, Danny Sebelius my aura and odegard the names under discussion asked how successful the negotiations had been Maldini replied. A trip has gone. Well, and we are optimistic real Hannibal ready made an offer for danice my Isuzu play remember that is also interesting Maurizio patino over Tottenham the offer was", " 30 million Real Madrid want closer to 50 another take on the name our situation PSG wants their investment return to Real Madrid have allegedly offered a hundred and thirty million in cash plus the option of signing Gareth Bale hammers Rodriguez or even navis could be involved as well as part of a package. The initial response was expected. We don't want players that aren't good enough for you just the money Premier League Arsenal hard keeping close tabs.", " Tabs on these situation surrounding Lucas Vasquez the 28 year old who's been at Real Madrid since 2011 bar one loan spell with espagnole of made a hundred and twenty two appearances in that time scoring 11 goals Madrid value Moran 30 million Arsenal's opening bid of 22 and a half is not far off being agreed upon now with Paul Pogba likely to choose you Ventus over Real Madrid the Christian Eriksen deal dead in the water and interest way.", " In John Evander make interest has been resurrected in peonage the 29 year old just completed his third season at Juventus. He's available for around 80 million euro wouldn't be good news, though. Would it before Crews moderate or Indie? Casimiro whose positions would be very much under threat. If he did arrive Margo's llorente was the first to depart for significant funds this summer when he signed for Atlético 440", " Million euro the 24 year old Spanish International has been at the club since 2013 14 having one loan spell at Oliver's back in 2016 overall. He's made just 22 first-team appearances in that time next to conclude a move could well be Martin odegard. Now, I acts of ruled themselves out of any potential deal after overtures made by Bayer Leverkusen as well as Milan similar offs the sporting director.", " To of Leverkusen called him a an extremely interesting player to got remember has been the last three seasons in Eddie divisie last season of the Tessa where he scored eight goals and created 11 assists in 31 games. Now a few more people will be watching the progress of the Castilla team next season after it was confirmed that Raul will take charge of the team. They play who spent 16 seasons in Madrid winning three European cups to Club World Cups a Supercut.", " S League of titles unfor Spanish Cubs begins work immediately and Zinedine Zidane has broken his long silence over the summer so far. He said it's an important campaign coming up we return to compete and to win it's not just the fans who are excited. I am as well now with all the excitement surrounding the new arrivals frustration deepens Voice or Gareth Bale his agent responding to the rumors of the loan move said simply not a chance as", " A transfer he added a transfer out of Madrid simply will not happen Gareth has a lovely life and a house in Spain. It would need to be something exceptional for him to leave all of that behind the other take he could be heading back to Madrid on a shopping trip. He wants to sign Sergio Reggie long as a left back for his new look severe team for next season with his chances limited with the arrival of many and of course Marcelo still there a deal is looking", " Highly likely and staying with Mandy. He was introduced to the media and public key yesterday. It is an honor to be it's the best club in the world. He said I thank the president for putting his trust in me on zidane. He said it was somewhat bizarre Revelation. I haven't spoken to him yet. I will do soon and finally last word today from the Napoli president or Elio De Laurentiis. He's begun negotiations to conclude this on off deal this complicated deal to sign her.", " As Rodriguez. He said I hope we reach agreement with hammers. He will be expensive. But if we have to make sacrifices then I will that just about wraps up this updates. Don't forget you can catch up with all of the podcasts from the last year over at the website at www.renttoowncenter.com first.com. And of course, you can even leave your own views and opinions on all things Madrid related simply click the link on the website to Anchor.", " Dot f m-- and is clearly displayed from there or you do literally is click and speak. You can also find us on the iTunes Stitcher Google Alexa Etc. That's it then hope you enjoy the weekend. We will be back next week till then from Meet incapable, bye-bye."]}