{"showID": "00i0DCBy8w68h8NStQbi2j", "show_name": "Breaking Beyond-Guided Meditation", "show_description": "Join me for daily guided meditations live on Periscope at 5:30AM CST or here on your favorite podcast.   linktr.ee/jillzjazz   These meditations are derived from my years of practice in Shamanic journey and are uniquely different.  I work as an Intuitive healer, meditation coach, past life regression therapist, and psychic medium. My meditations are meant to allow you to turn the mirror on yourself and look inward for deeper self awareness and healing.   At the start of each meditation, there is a brief discussion to help bring clarity to the signs and symbols that present during your practice", "episode_name": "Tree of Truth", "episode_description": "In this meditation, we release a story (or many stories) that we tell ourselves. Overtime, our perception of something about ourselves or someone else can start to look like the truth when in fact it is not. The first step to changing our perspective is to see that we may be holding onto a story. My hope is that the Truth Tree does this for you today.  Release the story and bring in the truth.  ", "duration": 25.510316666666668, "transcript": ["Hello and welcome to my daily meditation. My name is Jill and I do a live broadcast of my meditations on an app called Periscope where I do a video broadcast. And this is the audio version of that that meditation today's meditation is a really interesting one. I probably say that every time because I do this wrap up as soon as I finish meditation and I always like huh? I'm still in it myself. So today's meditation took us to a great tree.", "Times I see this tree in meditation. I think oh, it's the tree of knowledge. Sure. I've seen this tree before but this is very different this I've never been to this tree before. I've never seen this place before and this tree is actually called The Tree Of Truth and it absorbs truth and it gives truth. Well, this is very interesting.", " But we all know that we all have these stories that we carry around. I'm going to call them lies, but are are exaggerated truths in our bodies and we've told ourselves these things for so long that we start to believe them. So the point of this meditation today is to release to release this non. Truth is Li the", " Story that we tell ourselves and to bring in the truth to our bodies and you know, it does a couple of things releases attachment from this story that we it makes his conscious of it makes us aware that we that there is a story that we tell ourselves that it may not be true so that we can shift our perspective change your perspective you change a world. You can't expect other people to change. So this is the cell we do that the the other side of this is that", " That we bring truth in to our bodies. We so we release and we bring truth in and then we release something that we've been holding on to that maybe truth, but were not sharing it with anyone. So this could be a feeling that you have it could be something that's happened to you that you never shared but that to should have an", " What we're holding these thoughts these energetic thoughts in her body's they can they can manifest in a physical way without release. So this is a way to really let that go and release it into the tree.", " And continue to bring truths back. If you need to you need to stay there the whole entire meditation and just continue this release and bring in release and bring in and do that. I think this is a good meditation for that. So as always I hope it brings you. Peace.", " Homeless and a greater underwent awareness understanding yourself and wish you all the best and take a nice deep breath in all the way down to the belly expand that belly out and slowly exhale.", " Nice deep breath in and slowly exhale.", " last one deep breath in", " and slowly exhale", " good Alexa breath.", " Bring back the nice even flow through the body.", " Feeling that breath find a rhythm just like an ocean wave and I slow and steady Rhythm moves to the body. The breath comes in. The wave comes in breath goes out wave goes out.", " Relax your shoulders.", " Feel the relaxation with all the way down your arms to the ends of your fingers.", " Keep that breath moving nice and steady through the body.", " This is where you start to relax push all those external thoughts to the side where your mind focus focus is on the breath and you go into a deeper relaxed State girl your jaw. Relax is to just support you.", " No you to visualize yourself standing.", " and a path", " a rugged dirt path", " you feel yourself standing very firmly there.", " Feeling the sturdy ground underneath your feet fully supporting your body.", " Around you is just darkness.", " You don't say anything else.", " As your eyes follow the path in front of you.", " you'll notice that in the distance there's", " small source of light", " I want you to begin to walk towards that light feeling your feet rise and fall.", " Connecting to the Earth every step.", " You can't tell if you're in a cave or surrounded by dense trees. It's just darkness.", " As you walk farther down the path. He'll notice that the light becomes brighter.", " Until you finally emerge.", " This Darkness into the light.", " Where you're standing is not familiar to you.", " It's not a place you've been before.", " There are not a lot of trees around.", " in the distance", " Is One Singular great tree?", " Largest tree you've ever seen large roots coming up from the ground.", " I can only imagine how deep they go.", " Trunk of the tree would take several people wrapping its arms around it to measure its circumference.", " Its branches seem to reach the clouds.", " Our journey today is taking us to that tree.", " Where we seek truth?", " So continue your walk feeling your feet back to the ground with every step as you set your sights on the large tree.", " As you continue your walk you might be greeted by an animal.", " or several", " I want you to just observe they may cross your path or decide to walk with you.", " Stay the course and continue to the tree.", " once you get to the base of the tree", " I want you to walk around it.", " What you're looking for is a place that's worn from sitting from people coming to visit this tree.", " I can knock hidden in the rooms.", " Once you get there, I want you to find yourself.", " Nestling in making yourself comfortable.", " Feeling the support of this tree.", " sage and wisdom", " almost like you're absorbing it into your body.", " this tree", " Is the truth?", " It embodies the truth it absorbs the truth.", " It gives the truth.", " Today you're going to release old stories.", " Things that are not true things that we hold on to.", " We all have them.", " I want you to ask yourself where you're consciously.", " What is the thing I'm holding on to what is this story and wooly on to what is the lie? I'm holding onto Within Myself. This might be about someone else might be about you. Whatever that is. We're going to let it go and today. I want you to pull the first one that comes up when you ask that question yourself.", " We're going to do is we're going to pull that from our heart center energetically pull that out.", " Like it's a ball of black energy.", " And then the base of this tree in the dirt, we're going to bury it.", " Allowing the Earth to absorb that energy.", " to grow into something beautiful", " Now in that little Nook where you're sitting.", " And the small not in the tree.", " You didn't knock on the tree.", " And ask for a truth about yourself.", " You're going to hear this message.", " Anyway that you need to really feel it in your body or you hear it in your ears or is delivered to you in some beautiful way.", " That's very consciously for this truth.", " And allow for the response.", " Bring that truth Into Your Heart Center.", " breathe it in slowly exhaling allowing the", " Choose to absorb into the body.", " As We Lay Here in the neck of the tree", " Gonna Leave You for a little while.", " Just to enjoy being in the presence of the tree nestled in its roots cradled and loved.", " I'm soaring that truth into the body. I'll call you back when it's time.", " We're going.", " Give one more thing back to the tree.", " And that is a truth.", " That you're carrying.", " Maybe a burdensome truth.", " Something that you need to let go of her release.", " Something you can't hold it in anymore something you need to tell haven't found a way.", " Ask yourself what that is. Allow it to come up in your mind.", " We're not going to pull it from our bodies.", " We're going to sing it to the tree.", " Allowed so we can hear it.", " Stand up from this neck of the tree.", " placing your feet on the ground", " saying our goodbyes to the tree placing your hands on the trunk.", " We're just going to step back.", " walking away", " Keeping the view of the tree in our sides.", " Feeling our feet firmly on the ground.", " Go ahead and take a nice deep breath in.", " Slowly exhale bring your hands into Heart Center. Just take a moment for gratitude. Now formation for yourself. Maybe want to solidify some of those images in your mind.", " nice deep breath in", " slowly exhale", " When you're ready start to come back to me, go ahead and open your eyes."]}