{"showID": "00iI06WDE5LoQk0a0Z3pfj", "show_name": "The Gregory Dickow Podcast", "show_description": "Welcome to the Gregory Dickow Podcast, hosted by Gregory Dickow, founder & Sr. Pastor of the Chicago-based Life Changers International Church with two thriving campuses, popular host of the international TV show, Power to Change Today, seen by millions.", "episode_name": "You Will Not Have to Wait Forever: Trust in the In-Between Part 2", "episode_description": "The men and women in the Bible were great people, but they were also real people who had feelings, trials, problems, and questions—just like you. There is nothing wrong with asking God how long you will need to wait to see your prayers answered. So what do you do in the meantime when you have not seen them come to pass? This empowering and inspiring message will show you what you can expect to happen when you learn to trust God. You will also learn how to see with His perspective, have patience, and have biblical persistence to see His restoration in your life. ", "duration": 35.8804, "transcript": ["Welcome to the Gregory dig out podcast. All right, open your Bibles with me to it to you know, what we're going to start in Psalm 13 Psalm chapter 13, and I want to show you something from this passage of scripture. That's really amazing. You know, we think of we think of the men in the Bible in the women in the Bible. We think of them as such great people such amazing people and they are but", " they were real people and they had real feelings like we have and they had real trials like we have and they had real problems like we have and they had real questions like we have and so in Psalm chapter 13, we get a little glimpse of David's Humanity. Yeah. This is the same guy in Psalm 13. This is the same guy that killed the lion the same guy that killed the bear the same guy that killed the giant the same guy that is called the the king. That was the that was the second king. But the real legitimate", " King of Israel was David is through David's lineage that Jesus was born David was a man after God's Own Heart. The Bible says David fulfilled God's purpose for his generation. David wrote Psalm 23 The Lord is my shepherd Psalm 51 about Lord take not your spirit from me restore to me the joy of my salvation David wrote Psalm 103 that bless the Lord O my soul for getting on his benefits who pardons all my iniquities. He heals all my diseases. David is an awesome man. Can anybody say Amen?", " N but he's also the man that fell he's also the man at failed. He's also man the stumbled just like Peter just like Paul just like all of us have failed and Fallen but David asks this question here in Psalm 13 and says like we would say sometimes how long how long O Lord. Has anybody asked that how long O Lord like how long I'm going to have to wait before I see my prayer answered how long I'm going to have to wait before I get my Harvest how long I'm going to have to wait before you show up in my", " Situation Lord how long it's not it's not wrong to ask the question. It's wrong to doubt the one you're asking but it's not it's not wrong to doubt and wonder and ask him. So hey take your questions to God how long O Lord isn't it? Interesting that he had the same question. We have sometimes like man. Why is this taking so long? Why is this taking so long but notice who he asks how long O Lord. He's still his Lord. Jesus is still my Lord, even when I wonder even when I'm questioning even when I'm", " Worried even when I'm anxious even I'm not sure even I don't have the answer. I'm going to him with it how long O Lord and the notice what he says, how long are you going to forget me forever? This the guy killed the lion kill the bear killed the Giant and he's like Lord. How long are you going to forget me? It's okay to be human. It's okay to be human. How long are you going to forget me forever is sarcastic now now he's like a now he's like a little, you know, just a little sissy right now right forever.", " How long our look will you forget me forever?", " like attitude man", " How long will you hide your face from me?", " Anybody been there?", " How long shall I take counsel in my soul? How long is this sorrow going to last all day. How long will my enemy be exalted over me?", " Consider an answer me O Lord my God. Anybody been there God I need an answer. Somebody called me yesterday hadn't heard from in years and they said man. I need an answer I needed. I need a word from God. I need God to come through for me. I need a miracle. I need to hear from God. I need to hear David was like that. I need an answer Lord Enlighten my eyes. I need to see something. I can't see right now or I'll sleep the sleep of death. He's talking about depression here.", " Talking about suicide. He's gone through it. He's going through something. Hey, never never never beat yourself up because you had bad thoughts never beat yourself up because you had thoughts of depression never beat yourself up because you thought about losing your life or taking your life. I'm not asking you I'm asking you please don't do it. But look, it's okay to ask those questions. It's okay to struggle. It's okay to go through Seasons. It's okay to go through dark times as long as you know who you're talking to.", " Consider an answer me O Lord my God enlighten me or I'll sleep the sleep of death and my enemy will say I have overcome him and my adversaries will rejoice when I'm Shakin.", " So how long O Lord?", " and then at the end how long O Lord what what what's supposed to happen between the how long O Lord and the prayer being answered verse 5 gives us the answer to that question, but I have trusted but I have trusted but I've trusted but I've trusted but I've how long O Lord my enemies going to Rejoice over me, but I have trusted I feel such sorrow, but I have trusted I feel like giving up but I've trusted", " I feel like it's not going to work out but I've trusted my heart is sorry every day, but I've trusted in your steadfast love this word loving-kindness. Here is the word steadfast love no matter how no matter how much we fail at being faithful God never fails at being faithful his love never fails, but I've trusted in your steadfast love, you know, we're just we're just like David and we go through times and then he says in verse 6", " So I will sing to the Lord because he has dealt bountifully with me what happens between verse 1 and verse 6 in verse 1 how long O Lord in verse 6 my God has come through for me. What happens in between what happens in the meantime is we got to turn our trust towards God the thing that gets the thing that connects verse 1 to verse 6 is trusting in his loving-kindness trusting in his steadfast love what connects you from? Oh God, how long O Lord to I will sing to you.", " Lord who brought me through what happens in between is that we trust God as we trust God trusting him and trusting his unfailing love is the bridge between verse 1 and verse 6. It's the bridge between how long O Lord and my gods come through for me. I will sing to the Lord because he has dealt bountifully with me. Hey who wants the first six in your life? I will sing to the Lord because he's dealt bountifully with me, but who's going through a verse one in your life? How long O Lord? Well, let me tell you the secret to connect these two things is Trust.", " Ting God's steadfast Love Is Love will not fail you. He will not relaxed his hold on you he will keep you in the palm of his hand and no weapon formed against you is going to prosper your God is going to deliver you. He's your God and he's going to bring you through all we gotta do is trust him.", " All we got to do is trust him.", " All we gotta do is trust him not lean on our own understanding but in all our ways acknowledge Him and He will make her he will make our paths straight, which means we must be on a crooked path. Like we are on a crooked if he's got a if he has got to make our paths straight that must mean that that our path is a little crooked and that's why he's got to make it straight. He doesn't make a straight path straight. He makes a crooked paths straight. That means some of us got some crooked paths.", " Some of us are on some crooked path. Some of us are some Crooks.", " But he said but he will make our path straight all that takes the pressure off of me. I don't have to make my path straight. I can't make my path straight, but he can make my past straight and he will make my path straight when I trust him and don't lean on my own understanding. I don't have to figure it all out. I don't have to understand it. All. I can't understand it all. I just know this how long O Lord and then I know this I'm going to sing to the Lord because he has delivered me. So all I know to do is connect those two verses with thanking him and praising him and believing in his loving kindness and his steadfast.", " That will not fail me. I will trust in your steadfast love.", " That's the bridge. That's the connector between how long and I will sing. The bridge is I will trust in your steadfast love he's going to come through for me not because of me but because of his steadfast love", " See, I'm not trusting my trust. I'm trusting his love. I'm trusting in his steadfast love and he'll make my path straight. I don't make it stretch. I can't make it but he can make it straight. I was acknowledged him. Oh look, see how David acknowledge Him even though David is he's pouring his heart out to God and he's telling us it's okay to have human emotions, but notice who he's talking to notice. Who's he who he's acknowledging like go through those Seasons like I go through those seasons.", " But Jesus is still Lord.", " I got sorrow sometimes but Jesus is still Lord. I got Financial issues. Sometimes with Jesus is still Lord. I got worries and anxieties sometimes but Jesus is still Lord. I'm not sure the answer but Jesus is still Lord. I'm not sure how it's going to happen. But Jesus is still Lord. I'm not sure how it's all going to work out. But Jesus is still Lon. I'm not sure who's going to be with me and who's going to be against me. But Jesus is still Lord. I don't know when the prayers going to be answered. But Jesus is still Lord. I don't know when it's going to happen in the doors can open.", " But Jesus is still Lord. You see that's acknowledging him in all your ways.", " He's my God.", " He who dwells in the secret place of the most high shall abide under the shadow of the almighty whose power? No foe can withstand. I will say of the Lord. He is my refuge. He is my Fortress. He is my God.", " And in him will I trust he is my God and in him will I trust somebody's got to say he's my God around. He's my God say he's my God. He's my God my God my God.", " Talking bout my God my god, dude.", " He's my God.", " You got to you got to acknowledge like acknowledging him David's like talking about his problem. But he's talking to Lord. He's acknowledging God but You O Lord will answer me, but you but I Sing To You O Lord O beloved.", " Listen, we take care of the trusting.", " And God will take care of the timing.", " We take care of the trusting. God will take care of the timing.", " Trust trust several things are going to happen when we trust him. I'm going to tell you about those in a minute, but let me give you a little like a picture of trust for a moment.", " So this guy named blondin was a French in France somewhere. He was he he was a Frenchman but he came over and he used to walk across the Niagara Falls on a tightrope and he's very well very famous. You can look him up. He used to walk across a tightrope and he'd walk to one side back to the other and one time. He was celebrating like his hundredth time walking this tightrope across the Niagara Falls.", " There are several people gathered and they were clapping and they were cheering and he said to them now how many of you he walks He Walks from one side and then he's going to walk back walk gets to the he gets to the other side and he's about to go back to their sides and how many believe that I can walk back to the other side and everybody said We believe We believe we just walked we just watched you walk to this side so we know you're going to be able to walk back and he said well how many of you really believe and they said we really believe we really believe and then he pointed to one man. He said well then get on my back and let's go.", " Guess what blond and walked alone that day?", " Because the man said he believed but he didn't trust.", " You see the difference now?", " He said he believed but he didn't trust so there's a guy that was hiking years ago.", " And he was by himself and he stumbled over Iraq. He's open this top top of this hill almost and he falls over the edge of this cliff and as he's falling grabs onto a branch that was sticking out of the cliff. He grabs onto the branch. Otherwise, he would have fallen to his death. He grabs onto the branch and he's holding on to dear life and he starts yelling up to the top of the hill and he says help is there anybody up there help? Is there anybody up there? He's yelling help. Is there anybody up there and all of a sudden he hears a voice and the voice says my", " Son my son it is I do not be afraid. Oh, wow. Is it you Lord? He said yes, it is me and here's what I want you to do. I want you to trust me and let go of the branch and the guy looked down then he looked up holding onto the branch. He said help. Is there anybody else up there?", " How many have been there?", " Is there anybody else up there? Oh Lord. Is there anybody wow, you see trust when we trust him?", " The following things will happen. Listen. This is a beautiful thing and Ecclesiastes chapter 3 verse 11 Ecclesiastes chapter 3 verse 11. Remember what it says it says in I want to read this to you from the King James Bible Ecclesiastes chapter 3 verse 11. He says he has made everything beautiful in his time. He makes everything beautiful in his time in his time in his time. He makes everything beautiful.", " Only this time there's something about trusting God's timing. There's something about trusting God that we take care of the trusting. He'll take care of the timing and when you really get to a place in your life where you really realize that God's not limited by our timetable. He's not limited by our deadlines. He's not limited to when our rent is due. He's not limited to what the doctor said. He's not limited to the three months the doctor gave you to live God's not limited to an time and space like in", " one day he can turn around years of frustration and in one moment, he can turn around years of unanswered prayer in one Split Second. He can answer everything you've ever asked see he's not limited to time and space. So we take care of the trusting he'll take care of the timing.", " He said he is made all things beautiful in his time. You see when you step into this place of trusting God trusting God leaning not on your own understanding but trusting that he will keep his word trusting in his faithfulness trusting in his goodness trusting that he will take care of you when you step into this place of trust when you step into this place of expectation of him you stop putting demands on", " On other people and people no longer become your problem and you're not mad at anybody else anymore because you're trusting God not people you're not your you love people but you're not trusting them. They are not taking the place of God for you. They are not taking the place of being your answer being your companion being your friend. Like Jesus will take care of all of that. Like I'm telling you it's good to have friends is good to have companions a good to have people in your life. But I'm telling you can't put your trust in them. They could turn on you they could betray you they could leave you they could die. They could MIT.", " They could misunderstand you they can get mad they can walk away. But God will never walk away. Our trust needs to be in God as long as I'm trusting God but loving you then you can't disappoint me. You cannot disappoint me because I'm not trusting you. I don't need you to behave a certain way for me to love you. I'm loving you because hey, this is how we walk. This is how we live. God loves me. So I'm going to love you. God loves me freely. So I'm going to love you freely. It's free. It's free. This is how much God", " How great God is is that he he died for us not knowing or knowing I should say he died for us knowing that we could reject him. He died for us knowing that we could turn we could say no, we could reject his offer of salvation, but he still was willing to do it. What a great God. What a savior Oh What A Savior?", " Oh, what a Lord. Oh what a God. I'm sure glad he's my God. How about you you glad he's your God tell somebody's my God. I know so awkward, but it's fun gives me a chance to figure out what I'm going to say next.", " He will make all things beautiful in his time. The next thing that happens when you trust him is in Luke chapter 18 in Luke chapter 18 and want to read this scripture to You Luke chapter 18 and the width this this persistent Widow get into that and we'll get i'll Circle back to that but in Luke chapter 18 verse 8 Luke chapter 18 verse 8 listen to what the unrighteous judge says, so this woman comes to this unrighteous judge.", " Says give me legal protection deliver me avenge me and verse will go back to verse 7. He says listen, he said ship.", " Go to verse 6.", " then the Lord said hear what the unjust judge said", " What did he say? He said man this woman is going to keep beating on my door. This woman is going to keep bothering me. I'm going to go ahead and give it to give her the protection. She's asking for I'm going to avenge her not because I'm good, but because she is going to wear me out.", " And listen to what Jesus says listen to what the unjust judge said and shall not God shall not look if an unjust judge of venture. He says shall not God avenge his own children who cry to him day and night though. He Bears long with them. Look at verse a I tell you.", " You that he will avenge them speedily he will avenge them speedily. He will avenge them speedily now. Let me tell you what this word speedily means. It doesn't mean fast in a sequence of events. It means that when it happens when he does avenge you it will happen so quick it will happen so fast, it will take place so quickly so swiftly that it will shock you it will Amaze you it will blow your mind. He says,", " That's what he means by the word speedily he doesn't mean it's good. It's you know in them in the amount of time that it takes. He just means it'll happen speedily that it will happen so fast and it will progress so rapidly once it happens it will it will do it will happen. So rapidly that it will make you forget all the time you waited.", " All the pain you went through.", " All the torture it might have felt like all the days you cried out all the months. It's like when a woman gives birth to a child. She goes through Labor. She goes through the all the awkwardness all the uncomfortableness all the changing of her body and her body expanding to give room for that child and her body sometimes getting sick and her body going through all these changes that she's never experienced before that us as men have never experienced period", " Could we would kill ourselves if we had to go through that?", " kind of teasing but", " but when yeah, I'm trying but when that baby is born she forgets.", " All of her pain she forgets all of her pain.", " Until you're too.", " And then your worse.", " She's like you take him.", " He will avenge you he will avenge you.", " He will avenge you.", " say he will avenge me this if this", " unrighteous judge", " Would answer how much more your heavenly father?", " Your heavenly father and he said when the son of man returns, will he find Faith the end of that verse in verse 8 when the son of man returns, will he find faith on the earth? You see God's all God's expecting of us is to trust him.", " Trust him what he's looking for his trust trust.", " Trust him.", " We take care of the trusting he takes care of the the timing.", " We take care of the trusting he takes care of the we take care of the trusting. Come on. Everybody. Say we take care of the he takes care of the", " See I said it seven times now and you finally getting it. It's okay. We need to learn we learn by repetition. We take care of the trusting. He'll take care of the timing and what are we trusting his faithfulness? That's easy. We stop trusting in ourselves the very next verse says and he spoke this Parable to some who trusted in themselves. The problem is trusting in yourself.", " That's when you get that's when it doesn't work. It works when you trusting in Him.", " God is Not faithful to us because of our faithfulness God is faithful to us because of his faithfulness. Wow shocking but it's the truth. God is not good to us because we're good. He's good to us because he's good.", " God doesn't come through for us.", " because we endured God comes through for us because he endured", " Because Jesus endured because of what Jesus did well you start realizing this and it becomes easy to trust it's the easiest thing in the world. We're created to trust we're created to depend.", " When we're infants, we have to depend we don't we don't even think about it. We just naturally depend on our parents parents are going to pick us up. A parents are going to feed us our parents are going to close us. Our parents are going to that's why when a child is abused. It's so devastating because it breaks their natural ability to trust and it damages the trust Factor inside of them. That should have come naturally through the Loving Hands of their parents, but when there's abuse attached to that,", " Then that child has to repaint be re parented by God and the process in case you're wondering why your why your you know why it's hard sometimes to trust because sometimes the people that you trusted the people that you were created to trust let you down. But now you have to learn to trust a God Who Will Never Let You Down", " you see", " So when we take care of the trusting, he'll make all things beautiful in his time. He will avenge us speedily doesn't mean soon. It means when it happens. It will happen in Rapid accelerated fashion. Hang in there because let me tell you something. It will happen trust the goodness of God and he will come through for you the third thing that will happen when you trust him is in Joel chapter 2 verse 25 Joel", " Chapter 2 verse 25 and he says so I will restore the years. I will restore the years. The next thing that God is going to do in our lives as we trust him is he's going to restore these are the things he does because we trust him. These are the things God promised he would do it's not going to take forever. It's not going to you're not going to have to wait forever. He's going to restore. What is he going to do? He's going to make all things beautiful in his time. You're not gonna have to wait forever. He's going to avenge you speedily he's going", " Restore to you the years the years. So listen, I'm telling you. There are years of Our Lives that we've all lost years that we lost because of ignorance years that we lost because of bad choices years that we lost because of what somebody did to us years that we lost because of something we did to somebody else years that we lost because of the Devil is a comes to steal kill and destroy the years that we lost. It doesn't matter whose fault it is what matters is God is going to restore the years that have been lost and you don't have to worry about", " All the time because God can make up for it in one moment. All the years that have been lost. He said I will restore to you the years somebody's got to say men today because somebody's going to get some years added to them. He's going to add years to your life. He's going to restore the Lost Years is going to restore what's been broken. He's going to store restore what's been taken. He's going to restore what's been lost.", " The Lost opportunities he will restore the lost time he will restore the Lost.", " Ideas Hill restore the Lost families Hill restore. Well, we He restored a lost coin to a woman who lost her coin He restored a lost sheep to a man who lost his sheep and He restored a lost son to a man who lost his son. He's the restorer he will restore. What's the common theme of all those three things that were restored the coin the sheep and the son", " Was that was that God did it was that?", " God restored God restores God restores God is the restorer of all the years.", " So I go to bed at night and I don't think about all the years that I lost. I start counting up all the years that are going to be added. I don't.", " fret about all the mistakes I made", " I think about how he's going to turn them all around.", " I don't go to bed and worry about what I don't have.", " I go to bed knowing he's going to avenge me. He's going to restore me.", " He's going to come through for me because this is who he is and our fundamental problem in life is a misunderstanding of who God is our fundamental problem in any area of our life is our wrong concept of God because once you really understand what he really is like,", " You'll never worried another day in your life.", " He'll make all things beautiful in his time so I can relax and Trust he will avenge me so I can relax and Trust he will restore the years so I can relax and trust and he will bring me the Harvest.", " So I can relax and Trust. Hey Galatians. 6:9 says don't grow weary in doing good for induce in what he's talking about doing good. He's talking about planting good seeds. He's not talking about being a do-gooder better to do good than to do bad. But he's the good that he's talking about is planting seeds. Don't grow weary in doing good for in due season. You will reap if you don't faint if you don't if you don't quit he's not saying if you don't ever", " You know struggle he's saying don't lose heart at planting don't give up on your planting because wherever you plan to you're going to reap whatever you sow you're going to reap don't give up on your planting. Don't lose heart when it comes to planting because God is Not mocked. Whatever a man sows. He shall also reap that's not written to us in a negative tone. It's written doesn't a positive tone don't God is Not mocked. No one's going to be able to make fun of your God when you keep", " Implanting the right seeds no one's going to be able to make fun of your God. He's not going to be able to be mocked because let me tell you something you're going to reap if you don't grow weary at planting good seeds so many Christians they give up planting they say their single. God will do it all so I'm just gonna see her but we got to plant seeds. You want to predict your future plant. You want some corn get some corn seed", " Plant the seed and you'll get yourself some corn. So God is going to give you a harvest. He's going to give you a harvest.", " He's going to make all things beautiful in his time. He's going to avenge you speedily he's going to restore the years and he's going to bring you a harvest. You know, what else he's going to do. He's going to turn it around. He's going to turn your situation around watch this Esther chapter 9 turned to Aunt Esther chapter 9. You'll fish out fool.", " Fred Fred G Sanford", " Esther chapter 9 verse 1 now in the 12th month that is the month of Adar. We in the twelfth month while the 12-month is like the end of the year. Wow.", " God's going to turn it around.", " On the 13th day.", " The time came whoo. Your time is coming the time came now. It says the King's Command. His decree was going to be executed and on the very day. See God may not be early, but he's never late.", " And on the very day.", " That on the very day that the enemies of the Jews had helped to overpower them the opposite occurred and the Jews themselves overpowered those who hated them. Look at what the King James Bible says in the King James version. It says in on the 12th month the 13th day. It says when the King's Command has decreed Drew near to put in execution. Look at what it says.", " In the day the enemies of the Jews hope to have power over them. It was turned to the contrary. Well, what a word it was turned to the contrary who's ready to see your situation turned to the contrary God's going to turn it to the contrary God's going to turn it around you had a bad year God's going to turn it around you had a bad life God's going to turn it around you had a bad marriage God's going to turn it around. You have bad Health God's going to turn it around got bad money God's going to turn around.", " You got bad attitude guys going to turn it around. Well, you should take care of that attitude part.", " So what do we do in the meantime?", " We need to have some perspective. We need to step back and we need to look at things differently. Like now that I know he's going to restore the years. I don't have to be in a hurry now that I know he's going to avenge me. I don't have to worry now that I know he's going to make all things beautiful in his time. I don't have to Scurry. There's nothing I got to do except have the different perspective. I got to look at it differently. Like I'm not having to measure things by my timetable now, I trust God's timing.", " Perspective perspective perspective to give you an example of a perspective having the right perspective in during World War II General Creighton Abrams and his men were surrounded by their enemy General Creighton Abrams and his men were surrounded by the enemy Generations looked at his men declared with total confidence. They've got us surrounded again the poor bastards.", " Hey Ethel, did he just cost know I quoted General Abrams.", " He's feeling sorry for the enemy.", " They're surrounded by the enemy and he's like I feel sorry for them. You know, why because now we get to attack them from any direction.", " And we won.", " And we won.", " Because of perspective perspective perspective we got to look at this thing differently. We've got to stop looking at it like we're behind and realize God's on time. Stop looking at it. Like we're going to run out and realize we're going to run over God's going to run us over with his Blessing. We got to have perspective. We got to have some patience patience is just sitting there and waiting patients means taking time to consider the facts before reacting.", " Consider all the facts before reacting. Yeah, the doctor said you got six months live, but let's consider the other fact that were healed by his stripes.", " We have to have perspective we have to have patience and third we have to have persistence and let me tell you something about persistence persistence is not about us just being strong in our character persistence means the reason we don't take no for an answer is because God already said yes.", " The reason we don't take no for an answer because God already said yes.", " So our persistence is not like our moral character. Our persistence is trusting in his character. He already said yes. So the reason I'm not going to take no for an answer is because God already gave an answer and the answer is yes, and amen. Let's Stand Together.", " What do you do in the meantime have some perspective look at it differently have some patience consider all the facts and the promises of God.", " And have some persistence the reason I'm not taking no for an answer Lord is because you already said yes.", " Not because I'm stubborn not because I got such strong character is because he already said yes.", " I want you to say that he already said yes. He already said yes. He already said yes, and that's why I'm not taking no for an answer. Hey everyone. Hope you enjoyed today's message. If you haven't already go ahead and subscribe to the podcast for more amazing messages. Like the one you just heard. You can also search for Gregory dick out on Facebook Instagram or Twitter for more great content to keep you going throughout the week."]}