{"showID": "0a0C9jWzl6eUUhM6mxTwbn", "show_name": "Stay Classic: A Warcraft Podcast", "show_description": "A World of Warcraft podcast based around Classic. Chromie has helped us reach the past and we are diving right in! Join GamerChex and Matt as they talk about the thing they love the most World of Warcraft Classic! hit us up on twitter @gamerchexpro and @staywarcraft or follow GamerChex at www.twitch.tv/GamerChex Support this podcast: https://anchor.fm/gamerchex/support", "episode_name": "Stay Classic: A Warcraft Podcast", "episode_description": "A World of Warcraft podcast based around Classic. Chromie has helped us reach the past and we are diving right in! Join GamerChex and Matt as they talk about the thing they love the most World of Warcraft Classic! hit us up on twitter @gamerchexpro and @staywarcraft or follow GamerChex at www.twitch.tv/GamerChex Support this podcast: https://anchor.fm/gamerchex/support", "transcript": ["This before welcome to the show adventures. We've traveled back in time with the help of our friend. Throw me meaning the world around.", " And you is long before the cataclysm. Welcome to stay classic at work our podcasts devoted to World of Warcraft. Classic. I'm your alliance travel companion gamer checks gamer Chuck's mother and my co-host Matt is join me. And today. We also have a special guest Jackie blade. So first off, how are you doing Matt? I'm very well. Thank you for asking. Yes. Yes, and how are you doing today Jack? I'm fantastic. A lot of great news came out today. Yeah a lot of good you can news so we can we can kind of", " Started on that right now actually, so we got the big 8.3 reveal for the retail version of World of Warcraft that has a bunch of stuff in it. But at the same time we got a little bit of World of Warcraft classic news. So dire Maul is going to be out early before Phase 2 even comes out so we know Phase 2 is coming in December. We know it's going to be out before the end of the year, but we did not know that dire. Maul was actually", " To come out before Phase 2 entire Tire late. So it says today has seen today blizzard has confirmed that darn ball will launch on the week in the week of October 15th, and now will be separate from the latest from the rest of face to launch. So it's going to be coming out in a week essentially like ten week in a few days. So perfect. That's crazy. That's that's really soon. Dude. There's so much good gear in inside of dire Maul like it helps with so", " Much like let's say if you if you're like a Combat Rogue and you know, you usually do swords. Well, there's a belt that makes it so you could switch the daggers if you want to because there's a belt that does plus 5/2 daggers. There's a there's a there's a dagger if you wanted to do the same thing. There's a dagger right? So it was I remember when dire Maul first came out that everybody was so happy because it had like a bunch of Alternatives and different places to get the gear you needed. So you didn't have to run like BRD a thousand times even though you know, you're going to be running", " our Mall Thousand Times", " So, how do you guys feel about this?", " I feel amazing about it. I'm a warrior. So I need the jump runs for money. Exactly. It's going to be nice. Yeah, I'll I'll do some of those runs as well. I mean to be honest dire Maul North is one of my favorite favorite Dungeons and all of vanilla. It's so good. Like it's up there with sunken Temple and skull amazed with me. I really like dire Maul North", " and you particulars you guys like East-West. I really do enjoy North to but I will say on a side note. I just feel like it's it's came out really quick and not that I'm complaining about it. I mean trust me I love more content really fast. I'm just I'm shocked with how fast it came out. I thought it would have at least seen like a little bit longer of a gap. I would agree with you if it was all a face to like if it was All Phase 2 and it was just coming out next week.", " The be like holy crap. That's a lot. We didn't have time to prepare for this, you know, but since it since it's only dire Maul, you know only dire Maul. Well blah blah, but it's not like it's the, you know, the Dragon World bosses and all the like the honor System at all. The other thing. Yeah, I guess I mean I suppose you can just go in there not even pre best in slot. I would I would assume that I well I mean East is not even a 60 dungeon. So it's yeah, it's not going to be that challenging. Yeah the thing I remember", " Here is that you know, most of your major rating guilds and a lot of your non-major rating guilds have already progressed through all the content that's there right now, right well and isn't that another topic of the discussion molten core is checks. Yeah, we'll be talking about that later in the episode. It's it's it's interesting. Let's just say that I'm just I'm just super excited that we got this news. Like I feel I feel like the", " Not maybe the phases would take a little longer to come out. But now that we know that Phase 2 is coming out, you know in December and then we're getting dire Maul this early if feels like an ice floe progression because I'm not getting bored or anything like I'm leveling an all. I have my mate my shadow priest to level 60. I'm leveling by Rogue no on the side, but I'm also trying to get certain in chance for enchant Leo trying to get my Crusader and shit. There's a lot of things that I'm doing. I have most of my previous life I had", " At like I've run mon Coeur like four times and black on black malaria onyxia like five times and I still haven't gotten anything. So it's exactly like vanilla. So it is it is it is what it is. But you know, it's fun going every week, you know, making sure you have some of the potions that you need but or don't need but yeah, so I wanted to get started on some of the other news. So the postmaster has just arrived with some news about World of Warcraft classic also Okay, so", " It's been a few weeks since we've had last had our show but so they deed officer from like a month back. He has been arrested which is fantastic because he ruined a lot of people's days. I know Matt was particularly mad about this. Not not so much man. I was actually pretty busy those two days. So it was kind of kind of great for me to be honest with you. Yes. Yes the sarcasm", " Yes travel. Well through the interwebs if that was a wasted weekend. For sure. Yeah. Oh, yeah, I mean most people probably had that weekend off to get at a few levels, you know school started they are into the groove now. They just thought you know, I'm sure there's a lot of people that we're just excited about getting a few levels at weekend. But yeah, I know I'm few few people in particular were pretty pissed. Like I finally took my weekend off from work.", " It's like oh man, I feel bad for you. Like at least this guy's going to get some major time. So that's good at least and then we also have another news story a huge jump in subs for World of Warcraft. So they I think it was what was it was while classic drives a huge jump in subscribers World of Warcraft subscriptions Revenue grew and estimated 2,000. Sorry 2220 3223", " sent in August compared to July despite this total revenue was still lower than the Battle of Azeroth expansion last August. So there was there was a lot of people that left during battle for Azeroth and then there was a lot of people that came back for classic. So that's what we kind of saw in the end in this jumping sub numbers, which is really good. I think they were saying it was around an extra four million is what we gathered from the while head data. So let's that's a ton for million people just for world Warcraft.", " Like I mean it really that'll add a little bit to the bottom line. Right? Right. Oh now they're gonna have to come over and like in-game store months for classic. Yay. That would make me very sad and then, you know, we already talked about dire Maul coming out early and that that's that's awesome. There is also another small. No, it's not I guess it's news but there's there was a particular streamer that griefed are", " Server in particular Herod so a couple days ago recording this a particular streamer decided to bring his whole audience over to Herod on horrid side and it killed our cue like herod's Herod was finally starting not to have a queue and it would start feeling good. Like we only had like maybe a 10 or 15 minute Q at night during prime time and it was it was gone. Then this particular streamer decided to come over.", " And bring his whole audience and basically troll Herod the the community that he was making an ALT, which bump their Cube back up to 4 hours. So that was fun. Mmm. Oh, yeah. That wasn't very nice. Did you hear about that Jack? I did not we have our own streamer issues with some Asian streamers on our server here for North America. Oh, well, you know what issues are having", " With what streamer issues are you guys having just a lot of people just farming issues them just going through and the etiquette being just completely out of whack. It's terrible to play with that sort of thing. But it's you know kind of to be expected a little bit Yeah. So ever since this particular streamer came over to Herod our cues have been back pretty much just straight up that's rough and it was only because he decided to", " Log on for like I think it was like an hour hour to and now it's all fucked up again. So that that's really fun real fun. Yeah, not bitter at all. No, not bitter at all. You know, it just sucks because you're trying to get certain people to come play with us during you know, like oh, if finally we're going to jump on Herod the Q times of drop down and we're going to get some more people on and now the Q times bag. It's going to be even a longer wait till they decided to come over to our server.", " So yeah, let's so let's go over to let's go to the Daily topic. The daily topic for today is are we seeing the nerfed version of MC. It really seems like people are skipping pre best in slot gear and consumables. You think we are seeing a Nerf version of molten core and some of the dungeons so we've went over this a little bit but there was a lot of nerves that happened in 1.4 and 1.5. And since we are in the 1.12 build or the 1.13", " They call it since it's classic. We are definitely seeing the nerve versions of molten core. The big problem here is is that they didn't they didn't decide decide to revert molten core back to the original version. So, you know having the 1.12 version of molten core basically in the 1.0 of classic as kind of kind of put a, you know, kind of kind of made us feel a little mess about", " molten core and how easy it is. So Jack go ahead on this one. Yeah, and I think that there's another point there is that there was another subsequent Nerf for you BRS and for molten core right before the end of classic 50, BC to push more people through the content because blizzard felt that they hadn't had enough people really go through an experience the content and so we're really in at least in my opinion seeing that version of molten core. It's just seems like it's that", " Z it certainly makes what Apes did you know a little bit more understandable about how they got it done on the day. They got it done not to take anything away from what they did because that I mean for five days in was crazy. So incredible. Yeah. Oh, yeah just nuts, but the overall experience I think has just been cheap and a little bit it's still amazing. I love it. It's still significantly better than playing retail. Please don't ever make me go back but you know", " It's not the same. I'll be very interested to see what happens when they release bwl and what kind of state that is in. Is it just that we've data mined and maxed and everything from the private servers for 15 years and we've broken the code or is it that the experience that we're getting now is kind of half the experience and we're waiting for the rest of it to come through. That's a good point. I was a good thing. Yeah, I was you know, go ahead Matt.", " Oh, no, I was just saying that's a good thought. Yeah, I agree. I was going over some of the the patch notes between you know, 1.0 and 1.12 during the vanilla time period and I've definitely you know out of all the things over Nerf Blackwing Lair wasn't Nerf that hardly and what it was it was it was also towards the end, but the big nerves did happen to Upper block upper BlackRock spire and molten core during that one point.", " For 1.5 time period it was you know, everything from Health to mechanics. So, you know making the mechanics easier, which they're already pretty easy. But you know, you need to have certain gear to go and do that that content you can't just like oh I hit 60. I got all my green question gear in my blue questing gear. And finally we can go do molten core. No, no, you gotta you gotta go to BRD. You need to get your", " Your hip belt, you need to go get your your Critical Strike gloves or you know, go get that certain home from tailoring this or that which that that made like when you first started doing when you first started writing it made it made Raiders feel more exalted making you feel better about doing it. So, you know, you're there to get the the next step of your gear. You got your pre buses slots. You're going to get your best in slot snow.", " yeah, I think the last thing to remember is that this is also post all of the talent adjustments and so blizzard went through and did class-by-class tell own adjustments through I think it was like patch 1 6 and on yep, and that really that really changed a lot of the metas because prior to that it was a shoe horn system that was added at the last second instead of adding just specific stat points into the game that got thrown out of just at the end of", " And so I think that may also be contributing to this quite a bit but still it's a it's just a different experience and it's not a bad experience. Like I said, it's been a lot of fun. We're clearing it on two groups every week right now and it's fantastic, but it's still it's still not the experience that I was hoping for when they released it. I don't think well, I do think a lot of the community wasn't expecting it to be this easy. Like when we saw shape now tapes coming out like getting it.", " What day five or whatever and like a guy hitting 60 day for and then the next day the the everybody being able to clear molten core? And now you like I've done molten core four times. We've cleared it four times. I've killed onyxia five times and I can say we haven't had any issues. The only issues we've had is like we were doing rag once and we didn't have enough healers, but that's just a like we only had like 3 healers, so", " We just need we need like two more and but the rest of the almost core wewiii healer, he lured it because of our other healers being a okay. So it's not it's not hard. It's definitely not hard at all there. You know, there's nobody really trying to get fire is this gear like there was back in the day like, oh I disagree. I think you're hardcore guilds. You're still doing it. I mean, I'm over 220 right now. Well all we really use was the the fire has this aura?", " And I write I mean it's not necessary like it was back in the day but it trivializes it even more now, right, right. Yeah, it's not. Yeah, it's not as drastic as I remember you having to have a ton of fire resistance to just even do that or you need you need to come in with you know, fires as potions fire absorb right stuff like that. And not many people are like I brought some the first time I went through I was like nobody else is using these fire resist potions. Am I the only person using these fires this potion potion?", " Besides the tank. I was the only person I was like iron Shadow priests. I'm going to put some potions on and nobody else was using it. So I was like, oh well, yeah, I think that the the real test for that won't even be Blackwing Lair. It will really be viscous in a q40 if that doesn't require nature resist or who run doesn't require, you know nature resist. Then we know that they've taken a huge Nerf bat to the game. Yeah, there was", " With a queue there was only a few I remember there's only a few things that they had to do to fix it because there is bosses at work. I like c'thun was kind of impossible near when it for know. He was absolute he was theoretically impossible. Yeah, so I know they had Nerf that but besides that there wasn't a ton of changes till late late, even, you know, beginning BC. So I will tell you if they nerfed this c'thun trash I won't be crying too much.", " Yeah. Yeah. I just I really want to get one of those in a queue mounts. Let's I want one of those bad boys. I mean everybody's going to get one but they're super fun to use.", " Oh, yeah, those were great. I'd are you either of you guys going to try for? I'm gonna try a pair of Lord. Yeah, I'm gonna try we'll see we'll see if I can get it prayers for your family. I know I'm gonna try I've always wanted it. I just I want that black war tank Mount man. It's so cool. It's so unique. There isn't in the game isn't yeah. It's definitely rare smoke, but we actually know I guess the rarest most was to a kid that had cancer I think", " So I guess if you want to go get cancer, that's fun. Maybe maybe those are not the night Health Mohawk. Not the night elf Mohawk. It was like a it was a I think it was like a war horse that had like a different color scheme and I think the guy has passed away now so like nobody has them out. So yeah, I don't I don't want to I don't want to go on that. That's a downer. Yeah. I don't want to go on, you know on that road to try to get them out like that. But with the", " Once you can potentially get the black war tank in classic is is going to be the hardest for sure. I also want to talk about scholomance and stratholme. There is a post on the World of Warcraft not read at the world Warcraft forums that said it was from slew Ludo. Whatever. His name is. Yes. He said I went to school.", " Colo yesterday as priests found out the bosses are too easy the Revenant used to hit tanks and melee DPS around the room like squash it like a truck used to be forced to pop Mana potion fighting it now the fight finishes and I am left with 80% Mana tank as has no epic and and a few tears 0 so then he goes on with instructor militia finish the fight only having to cast to renew on tank. I know this used to be easy as well last time, but now only to renew and then rat I remember this one in particular rattle Gore.", " Hitting less hard in general. I remember rattle rattle door if you used to pull them like because I used to be Shadow priests back in the day and you know shadow shadow priests are notorious for polling because of our shadow damage and I remember being like getting one shot by realm or now Relic or doesn't do crappy. He has to hit me like four or five times before I'm even close to being low, which is ridiculous. You shouldn't be able to take anything as a cloth e especially as a priest.", " But yeah, so, you know, there's a there's a lot of sentiment from the community that we want. We want these dungeons. We want these raids in the pre Nerf State. I don't know if you guys you guys have done any upper BlackRock Spire Lord BlackRock Spire Strat skull low even some of the last even like the last two bosses and BRD, but they are super easy like it is it is ridiculous how easy it is.", " If you don't have great gear.", " Yeah, I think that there's some of that I also think that this for some of these I would still say like for instance lb RS and BRD or probably harder than upper BlackRock, which is ridiculous. But right I think a lot of that also comes from men Maxine, you know outside of elitist jerks and a couple of other places there weren't really a whole lot of places to get pre complete pre best in slot, you know sets and so people were kind of mixing and matching a lot of gear.", " They didn't know really how hit cap affected things. They didn't really pay attention to the weapon skill, you know things along those lines that really became a bigger part of the collective classic or vanilla Consciousness. I think was something that really happened after vanilla. And so I think you've seen some of the effects of that, you know layer over because now you have everybody and their brother on a YouTube channel explaining exactly where to go get everything that you need and", " How to itemize how you doing it right that just didn't exist that is true that you know, besides those few little places like elitist jerks, which I used to frequent on occasion back in the day. Say more whoop it up the thoughtbot looking some things up. But yeah, you can like go you can go to wow head right now and just you know look like oh, what am I pre best with thoughts? What am I best in slots?", " Well, I mean there's there's websites out there that you just put your gear in and it'll tell you where to go get upgrades. Right, right. Yeah, that's none of that was a parsing back in the day wasn't as easy as it is as it is now like it's correct ridiculous. It's so easy to parse compared to back and so having a spreadsheet up.", " Right, and I don't know if you guys are familiar with Fight Club, which is kind of the the Legendary Classic / vanilla Warrior group. And I mean, they've got a spreadsheet that literally calculates out what your maximum optimal DPS should be based on what rotation you use what gear you have and the enchants it's crazy. None of that. It was none of that was the thing. Yeah, it's crazy. Like I never thought like he's like just you seriously whipping up the the most used site with", " Why would type in like for example, holy priest or a holy pound type that in go to the classic area. You can scroll down it'll show you all your in chance. I'll show you all the gear you need it will show you the gear you need for the next phase the next phase after that. The next phase will show you all the gear all the enchants you need. I'll show you even the optional one. So it's like it's super easy to do now than it was to do back, you know back in the day.", " Yeah, because everyone didn't know that back in the day, right? So yeah and have that kinda for as invested as they are now because you know, maybe they're a little older maybe they have a little bit more time and not to mention. There's a ton more people playing classic right now than there was during vanilla. I think why it was like a million people to million people during the vanilla launch so it wasn't as something like yeah, it wasn't as big as it is as it is right now, so you have so many", " That remember what they did in the back in the day all this Collective knowledge has definitely helped. I just I still feel like when they won that 10th anniversary came out for molten core. I think that was still harder than molten core is right now and classic which is kind of sad.", " Yeah, I would agree with that. But at the same time, you know the experience of getting 40 people together.", " Getting them organized getting them into the right specs and the right gear.", " There's just nothing like that. That's in retail right now like there really any any other game. I mean, it's not in fan of Final Fantasy. It's not in you know, even some of the the other Legacy stuff that's out there. There's just nothing that's like this experience and it's so nice to have it back. Yeah, the only other game I can think of closed out WildStar those the only like 40 Man raid WildStar was crazy. Yeah, and the", " The suit the super high use of telegraph's just like what yeah is certainly got translated over into Final Fantasy. But yeah, they're Telegraph system and their skill check system was very very high. It was a lot of fun.", " It was it was it was really cool. I really like about sorry. I like the idea that had they just they just didn't execute it properly and know they didn't it was like SWTOR, you know, the it had some really great ideas. It's just they didn't QA it properly and you know the guys I was actually a part of one of the groups that would go down to BioWare in Austin, Texas and work with them. That's really cool. And oh, yeah. It was a lot of fun. I've got some of the", " Still have a bunch of the swag and stuff, but the you would go down there and they're devs knew it too. Right and so they the devs would be like, okay. Well, how do we retain this? How do we work that to try and get it to that point? They just it just wasn't as polish right and it not being as polished really really hurt that game because I remember playing it in the beta sort or in particular and it being like such a fun experience. It was really cool to hit max level it.", " Was it was so good. And then I remember it launching and then just having a ton of issues because that it wasn't polished and they needed more time in the beta. They need more more people playing it. I remember the rates not like being pretty pretty under tuned and stuff like that. Yeah, they were either over to endure under tuned their last boss in the first raid had a probably one of the best rate mechanics I've ever seen. Hmm, and it just wouldn't work properly see and", " You would be impossible to do if they ever did something. So the time yeah, if they ever did something like Classic Plus I would like to see like what they had in WildStar with like the the housing system that housing system was so cool. Very very very heavy. I'm not sure that I would be super interested in the housing, you know segment that's never been a part of the game that I love, but I would love to see a classic plus with additional content. Yeah, like all the stuff they didn't do like the dragon Isles and all the stuff that they're", " Are planning on doing I would love that. I am a big fan of I used to play a lot of Star Wars Galaxies when I was when I was a younger man, and the coolest part about the housing and Star Wars Galaxies was the fact that it was everybody could go like everybody could go to your house. What if they just like, you know random like plot of land like off of like, I don't know off of darnassus and then you could have like a big plot or later everybody put their houses just like in Star Wars.", " He's I'd be so sweet. That's something I would be a little bit difficult on a server with 40,000 people that it would be that it would whatever room pretty quick or you guys like with you guys would have to like share backyards and it would be like that awkward. You know, like all the townhouses are just like shoved together. Nobody needs that neighbor. I'm sorry guys. I'm really don't want to come over for my cookout. Now. The the other thing to think about is that they the the Larry news that has come out a little", " a bit and to the point where they have said that they're not sure whether or not they're going to your when they're going to be able to get rid of the layers for some of those very very large sir. Like Herod like, yep. We're that they may end up with that's one of the reasons why dire Maul is being released separately from the world dragons and everything else other than it's a dungeon and you just flip it on is the fact that they don't know. I don't think that they really have a good plan for multi-layer World boss.", " Right and it is quite possible that they're going to end up having to have multiple layers except for certain zones that have those World bosses just because there's too many people. I really just want them to get rid of layers. I know there's so many people but I'm willing to send a queue if there's no layers like that. It ruins it ruins a lot of things rooms. They kind of gone over at time. It's the people it's the PVP to that's coming out in Phase 2 that that's going to be a", " huge issue for but at the same time how many people do they lose if there are constant use that's going to be the next question that they really have to answer and then think until they answer that internally what they're willing to lose and you know what they're willing to do about it. I don't think we'll have a final answer on layering until that's that's really taken care of. Yeah. I know we got it down to two layers now on our server and I know a lot of other servers don't later same here, which is which is very very", " Cool, you know there's still the layer hopping between the two servers and still pretty problem. There's still people asking us which layers but I would really like like to see it go like there's so many things that are ruined just because of layers itself. And you know that PVP is going to be a big hurdle. They need to cross the I really think they should just add higher cues to be honest like longer Qs. I know that I know people don't want to deal with that, but if you really really", " Ate it you can transfer you can free transfer to Earth theory with all the 200 people on there. Yeah Earth's fiery. It's not a good transfer. Definitely not a good transfer. Yeah. Yeah. I think they may have swung a little bit too far than the other direction on some of the servers but that's nothing new for blizzard. They like to do that. I really think they just like we've talked about this on earlier podcast, but they should have just had more servers to start with.", " Here it wouldn't have been as popular and all these other servers if there was just more servers and it could be a little more spread out. They could have forced you and your community to change to a different area before the game even came out. So yeah, I think part of it is they didn't really as much as everybody warned them, you know and is everybody as you think you do but then uq became a thing. Yeah, you know the difference really was", " I think that they got a lot of last-minute Subs in the last, you know, two three weeks before launch as opposed to two months out and I think that they were really driving on that metric. It's a to Hazard a guess and maybe have a little bit of inside information on that from some current blizzard employees that that is what they were kind of keying off of and it's you know that I it's hard for me to fault them that decision to", " Touch and they did add a significant number of servers and the two three four days leading up to including the day of launch. They're adding extra servers. Yes, it would be great if they had, you know, given everybody a little bit more time to make those decisions. But at the same time, you know the server, what was it the key the the", " Subscription Service crashed two days before yeah launch people couldn't even sign up. Yeah, exactly exactly. So then then you really don't have an idea of what's coming. Yeah, and that's that's just the thing like, you know, if we did have those servers those server options available, you know beforehand if they wouldn't have waited like, oh, yeah because you kind of have to think though, like if you're coming out of the woodwork I've classic which was the most popular MMO in the time and you know,", " There's so much Word of Mouth going around that people are coming back. People are definitely I mean, yeah, some people are going to try to get the their character names, you know, a couple weeks before the game launches be got to know that the day of there's gonna be a ton more people you should have enough servers. So everybody isn't congregate to the higher populated servers. So yeah, it's like you're damned. If you do you're damned. If you don't, you know, you could it's extra money, but maybe maybe you should have done it before hand.", " I don't know. It's it's one of those things where", " Yeah, you know, we don't know. We don't know what exactly are they they were doing even though if you had you know, you may have had some Insider information. But at mean they didn't know they didn't know that they were going to get 4 million people.", " Yeah, that's a crazy high number. I don't think anybody was expecting. I mean I certainly was expecting it to be big. I don't think I was expecting it to be for 4 million big. I think I knew that it was going to have more people than Balfour Azeroth, but I didn't I didn't think it was going to be 4 million bigger than Azeroth the bat bigger than battle for as well because I think of the subs ever tracked for battle for Azeroth are like a random million .5 or something like that million point to so it's definitely bigger than", " Their current expansion which is kind of same thing that happened to Old School it if you have you've logged in recently, it's dead. Oh, yeah. I did my is it I did my eight point two point five stuff and then got right off it took 20 minutes all the content that came on that patch took 20 minutes, then I was off so that was fun.", " But yeah, 8.3 looks good like to be honest. I'm glad they're adding a bunch of stuff. I'll play it for you know a couple days and then be done with it again. But yeah, and I would really just be surprised to see them do something where they've got like the initial release of content for for 8.3 and then they have a month later. They release all of phase 2 and then a month after that they released the rates for 8.3. It's a good time to be a World of Warcraft fan, right if", " Like the game if you like both versions of the game, this is a great time to be well don't don't stick me with those people. Well, you know, if you like classic and you like, you know retail, it's good to have both right like if you like a little bit of both. There you go, if you like one or the old way anything will be better than the current state of retail. So it seems like they've learned their lesson a little bit seems like Titan fortunes kind of going away some of the other stuff that just really seems to have wrecked the game. I think they're doing", " the old God forging something like that. So instead of Titan forging it's going to be old God theme so it's going to have like so you remember when so and I think a point 1 Point 5 came the the little mini Ray that had the to what was that Ray called. Let me let me do some Google and go fast eight point one point five raid.", " A crucible storms, right? So when those Crystal storms raid came out the gear in that in that raid was like, oh, you know, you take 10 damage, but you also do like a thousand Shadow damage or whatever. I think that's the same thing. They're going to be doing with Titan forging so they're going to be switching tight foraging out for like a kind of like new fun spin on Titan forging so not only like do you go up like five item levels or whatever it is, but you also get like, you know, this this increases your crit by", " Reset but you lose 1% Spirit kind of like Old World of Warcraft classic gear. So they're kind of doing like that spin on gear. That's that's what people are thinking because I get they said they're getting rid of Titan forging for some sort of like old God themed reforge so will see we will see it sounds cool though. I like I like I like stuff like that. So I'm with Matt sigh. There's just too much man. I was talking to Morgan about this last night checks, essentially. I just feel like", " Anyone who's never played well before that maybe came in maybe played Lich King or you know, just gave it up and never touched it to jump in a game. That's you know, what is it? How long's well been taken years 15 years to jump in a game 15 years and see the vast amount of content that they have. It's pretty overwhelming and for them to just keep changing and adding and it more expand. It's just you're never gonna feel satisfied in that case. It seems a lot of like change for change.", " Say yeah, I agree with that. That point is I change for change sake like why do you have to change it? Why can't you just add more content?", " Like I get it like hey, you know, it's really cool that we have this new way of doing this certain sort of quest we have these World quest a la di da but like we just need more content more more ways to earn gear, you know, don't ruin the the PVP system again, please Lord bring it back to the old way. It was like we don't want to level up our honor level. We want honor to spend for four year. We want resistance. We want PVP power. We want these things.", " That you've changed so many times.", " It's it's sad but at the same time like they are adding cool things like the crow me scenario was very cool and Legion and they're adding something like that again. So there's there's some hits and misses as long as they can bring it back to the way it was bring it back to how it was before cataclysm and Mists of Pandaria. Just bring it back roll it back bring back the old PVP system. Don't mention that evil again. I hate Mists of Pandaria so much come on worst expansion ever and and some of the new content", " Is in mr. Bhandari, which makes me so so he's in the vale of Eternal blossoms, which makes me so mad.", " So it's just a baton blatant cash grab it's fine. I mean, we got the full pair of maybe all the panda people will finally switch to something that's less hideous. They can join the NBA and committing suicide again Jesus. Yeah. I just yeah, it's mr. Pandora is what really ruined the game like, it's straight up and the talent they need to bring the talent trees back. They need to maybe not bring them back to how they were but", " Bring the there how they worked back. I don't like just having to click for a skill. Like that's stupid. Like it should be like five five percent crib 6% crit 2% Spirit, like give me that stuff back. I got I know I prefer men maxing in that area not been maxing with titan-forged gear, you know.", " Likes complete RNG. Yeah, and yeah, you can't you never know if you're going to get it like take away like if it's RNG thats fun like the other old God stuff. That'd be cool. But as long as it doesn't add like crazy like it as long as it doesn't like that but it's a it's an orangey that didn't really seem to add anything. Right? So yeah your gear got a little bit better, but you didn't get a new piece of gear. You didn't even really feel it. It just it just added a little bit and you if you parse your know.", " She saw an increase, right but she's it's not like the effect of like right now you just you've run, you know molten core four weeks and you've run, you know, and exhale five times and you're on your Shadow priest. Well what happens when you get that I have Divinity, I mean your whole play style change, right, right. Yeah, it does. It's just such a huge upgrade. So, you know, you actually feel the accomplishment of that you feel the reward from that and you don't get that at all. Yeah, let's it's a hundred percent you the truth right there.", " I am sorry back on the the they're kind of old God Titan forging scenario. I think I'd be cool instead of just doing like a straight-up Titan forging how it is right now. If they were to do like how they've been doing with the the necklace and in battle for Azeroth. So, you know, if you get high enough in your necklace, you get like rank for something and it changes how it looks what if we had like a old God", " You know titan-forged situation where it just changed how the item looked at maybe had tentacles on it or something cool like that. That would be cooler instead of actually changing the gear into you know, you know X making it so it's like the best in slot and you have to have it when it's titan-forged it just changing the aesthetic I think would be really really fun because I know that in there Mythic dungeons they are adding like a way to skip certain bosses or skip certain areas by going like dull.", " Delving into the shadows and the old God Realm. So we will we will see how that unfolds. I'm pretty excited about that.", " It sounds cool. But I'm bleeding classic right now. Oh, yeah, of course, we're gonna believe the classic to well forever. Alrighty guys, please let it be forever. I know just keep keep re rolling it back. We'll do it. I'll do it every day all day. Alrighty guys, if you have any comments or wish to write into the show message Mia gamer checks production that outlook.com or at gamer checks Pro on Twitter or message us at stay Warcraft on Twitter strapped a chrome. He's back.", " You're jumping to present to see what games we have been playing so Matt. Have you been playing anything besides World of Warcraft? Classic? Let's same thing. I said last week. I haven't touched anything else. How about you jack? Have you have you touched anything hashtag Steam Sale 2021, you can get Borland's 3 when it's finally on Steam and yeah in two years. Yeah, there we go. Yes, seriously. That's what me and checks have been saying we're like", " By time we want to play it will be on sale. Yeah, pretty much. I actually have been playing two games but their phone games to be honest so traitor. Well, I'm not a big phone game fan at all. But Mario Kart came out on the phone, which is its kind of just fun to play when you're taking a poop and then Call of Duty came out on the phone and it's actually really fun. It has like some of the old maps from like cod for some of the maps from you know, the original Black Ops. So yeah, I've been liking it.", " Lat they kind of do so the new Nuketown. They have Nuketown. Yeah, they've been doing this thing where you you hover like so it's okay. So at first they had they had controller support but they took it out the day or at least so that was kind of shitty. But how they do instead is like you you aim at the you aim at your enemy and it auto Fires for you. So it's pretty it works. You know, it definitely works. I usually go like 50 and one in that game. It's ridiculous. I just know I be", " Eat the whole game myself. This is great. Like I won the team deathmatch just pretty cool. Yeah, I'm definitely waiting for Steam summer sale for Borderlands 3 and what it's another good one that just came out control control. I want to play control as well. So there's if there's there's good games coming out, but it's just World of Warcraft classic season. I mean, come on.", " Alrighty, so Crow me I've already done all the question Western plaguelands for you. And you want me to do them again. You've really screwed up this time line anywhere last words before we go guys.", " No, thanks for having me. It was a pleasure being here. Yeah want to do it again sometime. Yeah, what have you back? Yeah. Well, we'll have to have you back any words met. No, I think we really just hit the nail with a hammer on this one. We don't want too much change. We just want the content that we spoke about except for give us Classic Plus after all the content is done in like a year. What was that? Yeah, and also if you guys are looking", " For guilty plea on haired Alliance just a classic guilds. It's just a classic just message one of the message anybody in the guild will give you an invite and then I'm always live five PM Eastern Standard Time every day except for Friday at twitch.tv slash gamer checks, and we will see you on the far side.", " Everybody if you have heard about anchor it's the easiest way to make a podcast. Let me explain it's free. There's creation tools that allow you to record and edit your podcast right from your phone or computer anchor will distribute your podcast for you. So it can be heard on Spotify of a podcast and many more.", " You can make money from your podcast with no minimum listenership. And also it's everything you need to make a podcast in one place. Just hit record guys download the free anchor app or go to Anchored ifm to get started."]}