{"showID": "0a0C2tbL45RMmL9EmEVC2R", "show_name": "Do I Have A Story For You!", "show_description": "Every person has a story to tell. Each episode, a unique guest is invited to tell their story, and hopefully the hosts, Brigit Willfong and Keith Bastian, have never heard their story before, because they want to listen intently and react to the story, as it’s told. Ultimately this leads down a very curvy and twisted path to the unexpected, surprising, and often hilarious! Each person is unique, and therefore each episode is as well. Enjoy!", "episode_name": "Do I Have A Story For You!", "episode_description": "Every person has a story to tell. Each episode, a unique guest is invited to tell their story, and hopefully the hosts, Brigit Willfong and Keith Bastian, have never heard their story before, because they want to listen intently and react to the story, as it’s told. Ultimately this leads down a very curvy and twisted path to the unexpected, surprising, and often hilarious! Each person is unique, and therefore each episode is as well. Enjoy!", "transcript": ["Hi, I've been waiting to talk to you.", " I have a story to tell you.", " So I'm Bridget Wilfong. I'm Keith Bastian. I'm Korean Connor, and I've got a story for you. Hi, welcome to the garage, which is our studio. Thank you for having me. We really really want to hear some tail of yours. And right now you've got a dog pet next to you. It's pretending to sleep but just likes massages perfect. So as comfortable as you can get to sink back into that chair, leave me down a path.", " I love food. That's like a lot she loves food and she loves herself. It's true. Yeah, right. I bet I know a story you could probably tell what's your favorite food? Probably Pizza. I love carbs in general. She only eats food if it's brought to her kind like a drive-through know I do love her I could deliver from the table to the couch. I'm good for now, you know one time you guys wanna hear a funny story though. Yeah. I was hanging out with my", " Former roommate and we were hungry and we ended up going to Tim Hortons, but we drove and the so we parked so we go in and I'm like, I think I'm going to get like 16 bits and maybe a couple donuts where you were getting six donuts. I was getting sick Stones. I'll be honest. I probably probably a tall six I'll be honest, but it was funny. So she looks me dead in the eye and she's like should I get 40 Tim did it was 50/50 came bad, but like as I he's at it I was like, whoa, I've lost my mind and I settled for 20 did you?", " All the 40 like within a certain no finally got 20/20. I was thinking of getting through numbers round. Well, no, she wanted 50 right battled for 20 because I said do you really need 15 pieces of donut? Yeah. Well, it would have been like a good food to how did you end up eating the 20 that you had? I don't think it's them all at once. I think I was trying to like shove it all in your mouth like a girlfriend that well. She's like I do.", " Maybe they like that though. Again keeping I had went for Burger King one time and like as he was like sitting there picking something to watch. I don't even know how long it like Titanic II action is my whole bopper by the time he found something to eat. I'm thinking she actually I think I was turning on the TV he went by the time I like turn on the TV and then sat down I was like, hey, are you gonna eat your Whopper and she's like,", " I did I'm like no you clearly didn't it's been three seconds. I can relate to literally had sacked it back. There was just the like for real it was the weirdest thing in the world. So do you do everything fast or just eating mostly eating don't really like ya doing anything about I guess I'm like a fast typer fast hyperfest eating do speed-read. No not really to speed walk. Yeah, I would say that Casey walk eat type do speed like", " A shed or something? Like what's the other speeds in your life? I think so. I speed p and speed shit. I do I'm like so the only reason I ask this is that I was like I'm not alone last week. She literally told all of us at different times that I didn't like when I pee I just I'm actually waits like that sounds like if I'm outside I could make a hole. Yeah, and I can or I could shoot like in a certain direction backwards by aiming. Yeah, like she she can aim her urine. Thanks for telling us all I guess.", " It was like a talent see like she's like, yeah, I know I got free. I thought everyone bead like that. Everyone would like vaginas just peed the same way. I don't maybe they do I don't have a vagina. No I talk to the girls at work because we were talking about it and they were like, I don't know how somebody can just you know squat and just pee without getting on their pants and like what why not it's easy and they're like, what do you mean you just dribble everywhere? Like no, you should what and then I was like I I speed p is this going through some weird now that I'm thinking I think if guys were to do it", " it", " They would poop like poop like speed poop. Well, we like everything is like the guy would never squat to like try to appear like Hardball unless he was going to go poop to fix the cheek. Even you saying I'm saying like make a hole like the same you're so right though, because did they poop themselves? So should I teach a class on speed peeing techniques? Yeah. No because it's different.", " For like everyone. Well, I didn't really know what we teach them skills. No, I don't think you can because it all depends on how big your urethra hole is. I don't know how I'd never compared size of my youth. No, but I mean like guys who have like a very small hole with my like speed P but it takes longer because the hole smaller so essentially I'm picturing you treating it almost like out someone uses a garden hose. Oh, yeah, when they go from like regular to like build output goes down.", " L like the thumb yeah everywhere, but I also speed Ian. Wait. What's a speed Ian now, I get it out as fast a candidate ends up being a yell. Holy, you know, it takes a while to be on I feel like you should go on like America's Got Talent or something. Like for these rare things like a viertel guys. Check this out. Didn't you like check this out? I get three X's immediately right there. I like what did she", " Do or no X's feel like that's the most amazing thing I've ever seen or Simon's all who home, you know, like he speed runs faster than you and you're like, oh, I'm like the slower faster your honor. Do you brush your teeth really quickly like yeah, really, aren't you supposed to brush your teeth for like a minute? I know I can't well just but I think she likes says like basically like if you used an electric toothbrush and it's like she's faster than that like a little bit of the thing. We're like, I like to multitask you ever multitask think yeah, like I brushed my teeth.", " In the shower people like to drive and eat because they feel like they're doing two things at once or they like unless you're on a road trip. I feel like that's the only do you actually do it all the time. Oh, yeah. I love it. I love driving and eating because I'm doing two things nobody just like their soup and cereal. I'm just eating them. I just mean like if we're on a road trip, I'm not but road trips different like road trip, you're allowed to drive any because it's boring. So there's nothing else to do. Have you guys been to Darkseid donut know I would be afraid to do that in like 7th riversdale. Yeah. Yeah really good. I like it's right beside Fable, right? Yeah.", " I have a picture of my six-pack of donuts. I picked up because I was like, these are gorgeous. I'm not a huge donut fence or it's a little odd for someone who bought six donuts, right? Yeah, but I didn't do the whole six. I just did one entire domain which is and that was like it was huge and it was a coconut cream and it was the best like 30 seconds of my life totally because I thought I was driving to so there was even better.", " I was wearing like driving things. Jay was all over the front of my sister jacket. I'm like, that's it all it doesn't matter. I just kept going because and then I noticed later I had some of the coconut almond side of my face because you had to like just shoulder check and then you'd like looked at her and you know, I've been like that I've woken up or and I've had like a cheeseburger stuck to my back, but I have I'll be honest with you. I did contemplate taking", " A bite like I love me a cheeseburger and there was fries thrown around the room. It was so weird and back then there was these Big Mac wraps they can get it was like a Big Mac like me interrupt. I remember one of those being beside the bed and I was like, so if I didn't eat this food, how much food did I eat late? I want people to think I'm really grotesque so that when they see what we look like eventually they're like, whoa, he's incredibly good looking. So it's the like under project overproduce like your disappointment and whoa shock. Yeah.", " Yeah shock and awe. I'm like the I don't know like the JLo shock. I do you want songs she sang. That was famous. I'm Every Woman. Yeah, which then Whitney redid and in the lyrics she's like Chaka Khan. Yeah, Chaka Khan and Sheila calls to her was her name actually shocked. I don't last name Connor. Was it Chaka Khan, or was it a made-up names? Like first last name? It's like Chaka is the first thing boom shakalaka making this up that's about", " Are blowing up like she's the boss. I'm kind of tempted to believe you, but I'm not the invented that sentence she created the letters. Well, she know that like it's got like, you know a catchphrase boom shaka-laka-laka girl, you know, it's true. Ooh. Ooh, I know what stories you can tell why don't you tell us stories about like sometimes when you used to do drugs, those are always so funny.", " Oh my God, you have so many funny stories. We were leaving a house party to go to another house party and we were like in like the like north central part of her jaw know which is like really sketchy. It's apparently one of the worst neighborhoods in Canada in a nice way. And so we were at some guy's house for a party and then we were going to go and then it's like probably three or four o'clock in the morning and I was like, oh my God, my car has a parking ticket like how the fuck does this happen? Like, how could I get one at this hour?", " Sorry, like I don't even know my license plate, but I like look at the ticket and I compared to the car as like it's right. Like I guess I have a ticket this is so weird. Then I like get inside the car and I'm like something seems wrong here and like looking around and there's like a cross hanging from the rearview mirror. It was like Carter. I don't think this is my car and I like yeah, this is not my car. We just got and so does I like Andres. I look behind us.", " I was like, oh my cars behind this car. So we just like hop out and like try to forget that it ever happened the like went to some other house party. Did you just have no fear? Well, it was like a red car exactly like mine. I mean you say it was in the worst neighborhood in Regina Regina. I was on drugs and I was just like I was like perfectly normal. You still party there all the time at like that same house. Like there was like a couple times that like me and my friend were supposed to be there, but just like randomly we weren't and like one night.", " Like it just got like rushed with people with like machetes and like what? No, no back back back it up. What? Yeah, like I wasn't there but like we were supposed to be there that night and then like these people I don't even know who they were. You going to be one of the machete hold your hand. No, no, like there was a party going on in the house and then these like complete strangers like Chase through the house like machetes like two people died. No, they were like wanting everyone's like phones and like drogyn sitting in a party and just be like in here just", " Group of people just run through with machete, right? And there was one time the SWAT team came. I forgot why I like somebody I guess called the police. They were like, whatever like there's a bunch of fish. Yeah, and then I see question though. Use you also said this is a place where a lot of drugs were done. Oh, yeah, perhaps they just thought they were people with machetes or perhaps at the police were outside, but they were just paranoid as F and you know what? I mean? Because maybe any time I was there we never had sketchy things out what I mean. Yeah, so maybe like people did like a bunch of", " Of Special K or whatever and they were like, oh my God, there's people with machete, you know, thankfully. None of us got hurt. It's like oh that's good. Meanwhile, there was someone just like cutting vegetables in the kitchen. Right? Right. He looks outside is like, I think I see a SWAT team shitty. So many Powers he like collected like glass things. There's like chandeliers everywhere. There was like hundreds of mirrors all over all hundred and he like collected teacups as well as there was like", " Like teacups, like I don't even understand how this was like a party house because people would get like so fucked up and like nothing broke ever like it's crazy. Not even in the machete fight like no one broken feet. They weren't hitting things like nicely. Here's my machete, right? So thanks for our give me your phone. Pretty Mark II like I do have a machete in my pocket wink wink, right just as long as you know what you were so polite you didn't break 1", " Teapot or glass while you came in threatening all of us with machetes, right? I'm in there is what what do you say like 30 people and real probably there was like always like groups of people like probably like 30 like an army of Machete. Yo, holy people change out on this house. Here's chandelier hundreds of mirrors. Honestly. I wish like we had photos from like chandeliers. You're not one glass was broken a lot of picture like hundreds of meters in one place, right? But what they look like they're literally", " Where it was like all down the staircase like all over the walls. Like it was crazed was the furniture mirrors to think it was like a floral couches and like did have plastic wrap to no no posture crowd. Okay, so it's just regular floral couches. Yeah. So you guys just went to some old lady's house. It was an old gay man who is okay sold gay man, who is a narcissist and he's like come into my room and then there's like floral couches and don't come into my living room.", " Yeah, and you're like, wow, it's a difficult party in here. That's probably why I cry the lights would reflect and you'd be all fucked up and then you would notice this 5,000 shetty's yeah, my teacher one and it made like a kaleidoscope idea going on so they smell like fucking five hundred million resetting. Meanwhile, he was Alison hundred bright said meanwhile, he was just holding a ruler but they're like, holy shit, you know get out while you still can", " They just saying it's okay. It was just not even that at all. It's just like the neighbor be like I have cake and the machete that's awesome. Okay, and what else happened there after the machete fight what can happen you like even go on? Well, there was like the SWAT team one time they like arrested everyone. They're like pulled them outside of like what wait they like everybody was on drugs. So it was probably I think there were like looking for someone in particular. It was another night that like we", " Supposed to be there, but we never actually went there. So like we were involved in it. So they arrested everyone I think so like they were like outside. They like the SWAT team came and they took everyone outside a pretty big thing. I'll swap. Yeah.", " But kind of bad but at the same time.", " My friend did give me MDMA once in my drink. Remember my friend Janna which is like a more pure version like it's not like we'll see ya in theory. That's a that's awkward because it was a Friday night you guys and she gave it to me and I could not sleep and I was having the time of my life and then when she finally like told me like hey, just so you know, I give you some empty man. That's why you're like wide awake and I was like, what is MDMA? It's like liquid form ecstasy or powder form and oh, is it the pure version? So like a lot of times when you have like a pill of ecstasy, it's like laced with and like that's why they can hardly.", " Right, but I gotta tell you this. I was like, I can't believe you did that blah blah blah and then she's like, yeah and then we sat around a little longer and then was like, that's really shitty that somebody, you know, I was like can I have some more because it going down was awful. It was like can I just have some more and then I just remember before you knew it. It was like I call him to work and it was Sunday and I went to the salon and I hadn't like slept forever and I remember falling against the wall at the salon because I was just so tired and I wasn't oh my God like so how many days", " The three holy shit. Well, yeah it was but that was so long ago, but it was like it was because you know, what happened you guys this is awful. Do you know what happened at the same time? It was freaking well, so this happens on Friday. I'm higher than as a kite and then on Sunday after I go to work and I like ball against the wall and everything like that. I go home and my partner have like four and a half years we break up for good that night like they were like Hey, we're done Bobby boop boop, and then I went to work and then", " Today and then my like boss was at me and was like basically at the school and was like you either like have to quit or we have to fire you because I farted in this girl's face. What? No, I did I did I did why well in one fact, but then I come home and there's a letter in the mail and it said I'm like dog only had 12 hours to like bake a the the facility used to like every bad thing was happening. And I'm sorry, it's the truth and was so weird because it was like my world just came crashing down after this amazing trip for him.", " Last couple days. It was just like oh my God, right. It was just horrible. And as far as the farting in the face was it was my cycle one class. I taught for a few years and this one girl. So I was always a little bit bitter at her because she couldn't take a joke or a choke part. Anyway. She she they were all doing like their little class thing that I made them do. I think it was dream boards, right? Like what do you want to be when you grow up go through magazines and cut out sugar have no idea what this class is here. It was a hair class.", " I was teaching here at school. Okay, right sounds like you do dream. But yeah, like so that they can link dream about their if your future kind of do it's a lot of them were like but here and love life, right and they're all doing those like, okay guys everybody get up now and go back to your section like your desks and then they all did except for the Melissa and she's like no and I was like, no you really need to have to get up. She's like, I don't want to get up. I'll just learn from the floor. I would want a partner face. You're not allowed to do that. I'm really sorry and on top of that. I'm trying to get by right and she's like", " Like you can go around right and I was like, no, I'm not going to go around. I'm going to walk through you if I have to so either you let me go through or you don't meanwhile I felt The Rumble in my tummy. Like I knew I could grab my pants at any given time. You're like I've been looking for a Scouts to write and I I'm I can't back down because she won't get up and so and everyone's watching because they're like, oh look she's going for you know, she's taking on the the the teacher, but I can", " To in the teacher authoritative position. You can't show week you got it. So then I was like fine. I'll just squeeze through and I didn't want to put my pelvis in her face because that would be awkward so I know but my butt up against your face and I'll be honest. It was one of those like ripply farts that like when iI was perfect against her cheek that I'm sure like, maybe I feeling honored cheat like no, I swear it my fate my ass right against her face as I started the whole way and turns out later.", " Apparently like there was phone like calls and everything to head office about how I don't understand why that's face while I was there and I was like, peace out. I'm done. I don't like what am I I'm paying Severance they did. Let's go. That is a nice guy. But yeah, so that's what's made me the man. I am today. Yeah, like it was it was pretty funny and I just remember looking at all. The kids are like oh and they all just looked like horrified like they just", " Like modern and for no-one back to the teacher get right perfect, and I'll be like I'm known for having a stanch. So I mean she got it full blast, you know, like sorry girl, and I said you guys can all work on what you need to get done and I went in pooped."]}