{"showID": "0A0f1WM7IttoJ61xzWCPK5", "show_name": "Vhite Rabbit Podcast", "show_description": "Podcast about WebXR - VR and AR on the Web.  Hosted by Vhite Rabbit, the developers behind the VR browser games portal \"Construct Arcade\". We dicuss topics from projects we've worked on or found on the web, frameworks, recent news and more. We primarily cover Virtual Reality, but also Augmented Reality.", "episode_name": "Vhite Rabbit Podcast", "episode_description": "Podcast about WebXR - VR and AR on the Web.  Hosted by Vhite Rabbit, the developers behind the VR browser games portal \"Construct Arcade\". We dicuss topics from projects we've worked on or found on the web, frameworks, recent news and more. We primarily cover Virtual Reality, but also Augmented Reality.", "transcript": ["Welcome to The Viper Room in podcast where we talk about whether car that's VR and AR on the web.", " My name is Jonathan one of the founders of vide rabbit. Hi. My name is Dorian. I'm the other founder of black rabbit WebEx a game developer and my name is Dario's that pigs are developed by trips to", " As you guys are both with XR developers, what kind of WebEx our projects have you worked in on in the past Florian? Let me tell you something since being part of my drive it when we do a lot is make games for the web. Especially the our games for the web. So one of the cool projects that we did which star is also I think going to talk about is VR games, but what I want to talk about today.", " Isn't a our project I recently did for company that we work for and that project is a project which you can go to the website and play with your phone. And what you do there is you shoot physical objects towards an environment to score points on these. It's just a simple little game, but it's uses your phone orientation to aim and", " Two uses augmented reality functions to work and you don't need any downloads. You don't need anything. So you just go to a website and you get the experience the whole thing. So which is pretty good actually so it's a game and it's augmented reality. So what does augmented reality and tail in this case? Okay. So in this case you have a backdrop, which is used by your back camera of your phone and basically just see the real world exact right exactly and currently", " Not in there. BR were not able to use all the functionality that you would expect in like a Arc or something. It's not that crazy. So Eric or is from Android this augmented reality tool set, right the exact enables. What does that do? What is the special thing about it what we can do on the web yet. Well, there are certain functions that the API allows right? There's like spatial tracking. So the camera didn't can track the", " Walls or the floor and things like that, so we don't do that and what they are at the moment, but it doesn't seem to be like too far off to into the future to have similar functionalities in web. But right now we have very simple technology like Medics are 1.0, which I think Jonathan can talk more about later has released in December and that's made it possible for browsers.", " To use it an API that's been standardized to be included in when shipping to Chrome has that now probably in Firefox in the near future and we'll see about other browsers. Obviously. I'll also like for the Oculus browser on the Oculus Quest also supports it natively. So that's pretty good. So whether it's our allows both augmented and virtual reality, so Dario's what have you been working on?", " In the past. I've been working on two games with WebEx are the first game is a game where you have to destroy asteroids in the orbit of Earth. It's a web VR app where you where you see everything in VR and the other game is a shooter where you where you are on Rails and you're driving and in front of your eyes.", " Cowboys and you have to shoot them. Very cool. All right, so that's in virtual reality, right? Yeah. It's both in virtual reality in the web. So it's an HTML file and Jas. Okay. Go on. How do you view those things? Do you really need like a special device or something? So you can just enter it with your phone, but the functionality is depends on how its programmed. So you also can get a headset and use it like Oculus.", " Request for example something like that. Okay. So on the Oculus Cuesta is like a browser which you just enter the URL in and like a website and then it's the game, you know, exactly cool. Awesome. Very nice.", " I think that's great for the first episode. I'm really looking forward to hearing you guys in the next episode you guys next time."]}