{"showID": "0a0Ikpt3GH8xSKaMZm4RYw", "show_name": "Pack-A-Day: Your Daily Packers Podcast", "show_description": "Writers and podcasters from all over Packer Nation bring you this new and exciting daily Packers podcast. Twenty minutes a day, 365 days a year, this is your new number one source for one-of-a-kind Packers content every single day of the year. We've designed a podcast for Packer fans so that you can stay up-to-date with every piece of Packers information including news, rumors, game reviews, player grades, NFL Draft information, and much, much more! Join us everyday for the Pack-A-Day podcast! Support this podcast: https://anchor.fm/pack-a-day-your-daily-packers-podcast/support", "episode_name": "Pack-A-Day: Your Daily Packers Podcast", "episode_description": "Writers and podcasters from all over Packer Nation bring you this new and exciting daily Packers podcast. Twenty minutes a day, 365 days a year, this is your new number one source for one-of-a-kind Packers content every single day of the year. We've designed a podcast for Packer fans so that you can stay up-to-date with every piece of Packers information including news, rumors, game reviews, player grades, NFL Draft information, and much, much more! Join us everyday for the Pack-A-Day podcast! Support this podcast: https://anchor.fm/pack-a-day-your-daily-packers-podcast/support", "transcript": ["Hi, I'm Andy Herman the Creator and owner of the package a podcast. I wanted to take a brief moment today to let you know about the easiest way possible to start your very own podcast. Some of the more important aspects are actually having a service to host and distribute the show as well as software to record each episode for the longest time. I actually paid money to host the packet a podcast and have a distributed to different podcasting platforms while also using different software as I tried to record but not anymore anchor gives me everything we need to record host and", " Ribbit our podcast for free either from my computer tablet or cell phone. Not only that anchor actually gives us the opportunity to make money with no minimum listenership. If you're serious about starting your own podcast, you better be serious about using anchor download the anchor app or go to Anchor dot f m-- today to get started 20 minutes a day 365 days a year.", " This is the pack a day podcast.", " Hello everyone and welcome to another edition of a pack a day podcast. It is Sunday April 7th 70 degrees today in the crappiest city and state and the world that is Rockford, Illinois for you. But the weather at least is nice today keeping our mind off of the fact that we live in the worst state in the world. I am your host this evening. I am Jacob westendorf and reunited. We still haven't done to shows together in quite some time, but", " Zach Jacobson is here with me Zack in the words of Motley Crue. Give me the dirt. How are you feeling?", " I like that. I'm good man. It's good to be back with you man. I missed I missed our little paring here. Yeah, it has been a while. As far as the Motley Crue reference. Not the first and won't be the last those of you that know me know that is my favorite band and they had their movie come out recently on Netflix. So I just told Zach I've watched a couple times ax going to watch it a second time tonight real quick Zach. I know you're a fan of the band. So give me a couple quick questions for you. Who is your", " Band member of that group. And what's your favorite song?", " Mike people in the movie. My favorite was was Tommy just because I thought", " A pretty good job of playing a game and I absolutely Greece. I just thought I'd Machine Gun Kelly. So I thought I did a pretty good job it out.", " Sucks Neil's been feels my favorite, but I had to pick my one favorite song. It's either animal in me or too young to fall in love. Oh, wow animal in me from the I don't even remember the name of the album that that was on either, but I don't know why I hear that song when I was younger.", " Just it stuck with me ever since not ever. Their popular ones not wild side or girls girls girls or anything, but I love it then no no and you know what? I just remembered it Saints of Los Angeles because I do remember that was the tour that I saw them on for the first time when I was 16 years old was a saint a blessing the White album cover, right? Yes, sir. Yep, and then I got in trouble because the next day at school now keep in mind. I went to a private Christian School. I wore my Saints of Los Angeles hoodie and it", " Had a big skull right in the middle of the chest and they thought that was like super offensive for some reason. So that's interesting Vince Neil for some reason being your favorite is not surprising to me at all. The former frontman, you know, so I got it. I got it, you know, so there you have it. My favorite is Nikki Sixx. I the last book that I read cover to cover was the heroine Diaries which was a", " Biography autobiography kind of a taken side of his his life and how everything was when he was using that stuff every so often. I think his story is really good and he basically formed the band so I kind of have him to thank for that. My favorite song is Wild Side home sweet home definitely gets a nod for me as well. But you guys don't wanna hear my Motley Crew takes Zach. I'm sure we could talk about this for quite some time. This is a Packers show.", " So let's get to the inside linebacker that we are set to profile the night and that is from the University of Michigan. Number 10, Devin Bush. So to just go in through here real quick. Devon Bush was a two-year starter for the Michigan Wolverines. He started on special teams his freshman year and I will never forget this highlight against I believe it was Penn State jabril Peppers was returning a punt. And this was my first impression and Devin Bush was he just kind of Blindsided?", " Add blocks somebody for them and completely lays waste to him as pepper Sprint's toward the end zone didn't end up scoring but had he Devon Bush definitely got the block there. He basically transform Michigan's defense once he was put into the middle of the field. He's got sideline to sideline speed that wasn't really matched. He's got what in college football what they call quote SEC speed. So he had that playing inside linebacker on a Big Ten team little bit smaller. He's 511. He's not you know,", " 250-pound prototype beefy middle linebacker. He's definitely more of the new AIDS linebacker tight, but big ten to one of the Big Ten defensive player of the year is an All-American at his position in that inside linebacker role and the captain of Michigan's defense along with Edge rusher Chase one of it you will be profiled for you by somebody else here. But Zach from when you see on him from what you've seen of him on tape", " What is your first impression of Devin Bush when you turn that tape on?", " Well, he pops out whatever whatever you're trying to do I Peter broke ass. He actually tweeted something similar actually really. I've got my thoughts as well tweeted that out on Friday that whatever you're trying to do, whether you're trying to watch tape, you're watching your the team that you are lining up against Michigan. Devin Bush will pop out and he will make you notice him. Okay, he would set up to me the most with him was his coverage ability and he was able to take running backs out of the backfield. He's able to line up.", " Tight ends and look at the Packers get a linebacker that can cover a tight end than that alone is a Monumental stepping stone for the future because they have not had that in quite some time and they have always been gassed over the middle of the field Bush bring them just superb coverage ability. And that's like I said, one of the things that stood out the most to me about bullish. Yeah. The first thing for me was definitely his speed, you know, like you mentioned that pops in", " Immediately and a lot of people came into this year really looking for Rayshawn Gary. I think Bush and one of its were kind of afterthoughts in a defense that included what use what was the number one recruit in the country when he came out of high school and that was Gerry and Gerry kind of now at least on the draft Twitter side of things. It's kind of fallen out of favor. It seems the end. He's gonna be one of those guys. I think the NFL likes more than the guys on Twitter do but bush.", " Like I mentioned that speed pops immediately and something I was looking for this year. Was that coverage ability like you mentioned because he wasn't asked to do it a whole lot during his sophomore season but his junior year he was and he was more than capable of running with running backs more than capable of running with tight ends. Now, there's not a ton of athleticism in the Big Ten, but at the same time there were enough players, you know, he was running stride for stride during a game of Paris Campbell Paris Cable Arena for 3.", " 40 I mean probably the fastest receiver in this draft class either him or Hollywood Brown. That's no small feat. You've got a guy that I think you can plug into the middle of your defense and really the conversation that's going to take place is between him and Devon white as to who the better players Devon white has certainly had the hype going into the season going into the draft process, and I think what I said was going to happen,", " Through October as early as October and going through everything was people are going to pop this tape on of Devin Bush and see a player that is just as big just as athletic and has better instincts and that's something that pops out to me as well as the fact that instincts for a linebacker. I think are the most important trait you could possibly have and bush has the best instincts in this class. And I know right off the bat some of you guys are going to listen to this and kind of roll your eyes anybody. Who knows?", " He knows yeah, Michigan's my team. I've watched every single snap Devin bush has played for the last couple years. I can promise you when I say this this is not Homer is mm. This is not biased and I would admit to you if it was but in this case, it's not bush is only an inch shorter and he doesn't it's not like he weighs 30 pounds less than Devon white and he has better instincts and play making ability. So that kind of leads me to ask", " What are we even really doing here? Then? Why is this a conversation? I the NFL is strange and admittedly. I don't know everything but honestly Zach at this point bush is pretty much the same size the same level athlete and far more productive. So what exactly are we doing here?", " And he tested better than white as well. So I mean, you know this bush he's just he's a physical player and I know people are so quick to Crown didn't wait as the next Ray Lewis the next Patrick Willis and I don't understand why this the kid hasn't played in NFL snap yet. But you know to his credit neither is Devin books, you know, you really can't go wrong with either one of those pics. But when you like you said when you pop in the tape when you see what Devin Bush can do what he did for Michigan specific people ask", " Of Seasons. He he just he stood out, you know, he needs he made it known that he was going to have still destroyed who he was who he was gonna be lowering his shoulders and against I mean you look at him as a tackler like the Packers they just they opted not to re-sign Antonio mores and he was the best tackling linebacker that they have next to Lake Martinez. Okay. So without Morrison the package going to have like a", " A little Gap there and a gap that bush can fill. He's a physical hardcore hitter and he doesn't like guys get by and so really you shouldn't overthink something like this, you know, especially if you're the Packers a team with two first-round picks and a colossal Gap in the middle of your defense. I mean it only get by so long with playing Josh Jones as an inside linebacker.", " Yeah, I agree. You know the hybrid thing is cool. The reality is Josh Jones is a workout Warrior. I do think there are some positives his game when he's Coast Line scrimmage, but he doesn't have the instincts of a linebacker out of he may not have the instincts as a safety remains to be seen if he's even a player and this is a big year for him as Brian gudykunst has said but with Devin Bush, you know, you kind of started to talk about my next point that I wanted to go and that is where would he fit if he were to be selected by the Green Bay Packers and what kind of get where we're more comfortable with those.", " It's of things to me Blake Martinez coming into a contract year. The Packers salary cap space has been discussed at length since they went on their little free agent spending spree to the point where it's possible. The Packers are going to make have to make some difficult decisions that may include letting Blake Martinez walk. So as for where he fits immediately well for starters for this year specifically he would slide in right next to Blake Martinez and play that other role.", " and he would be the dime linebacker because you're gonna have to pick him in the first round and then it's possible that in the future and this is like best case scenario the best case scenario meaning both Bush and Oren Burks proved to be really good and if I'll players but they have a possibility of putting Oren Burks a top level athlete and Devon Bush a top level athlete next to each other in 2020 and at least kind of again", " Take this with a grain but kind of being able to replicate what the 49ers had or were able to do with their defense has with Patrick Willis and NaVorro Bowman those players were so good. And so athletic they could play bass against every offense and not skip a beat that is how the 49ers defense was so successful because they could stop the run that way but they can play their base defense. They didn't have to put third fourth fifth corners on the field.", " And can win that way so that's what they'll endure. Oh, yeah, they had a ton of talent. So that'll definitely help that regard. So as far as Green Bay, that would be the best-case scenario in 2020, but I think that more some Devin Bush could also potentially be a chess piece because something we haven't mentioned yet. He's a phenomenal Blitzer his ability to just see and hunt the quarterback when he is sent on a blitz him and Blake Martinez those", " Crossed dog blitzes that Mike Patton draws up that have been drawn up in the 3-4 defense since the very beginning of time would be lethal with Kenny Clarke and at Oliver right there in the middle of that defense. So that's something else I think as far as where he would fit exact. Where do you see him fitting in in his rookie season? Should he be selected by Green Bay?", " Well, I know as them Bush being the you know, this trimmer prospect that everyone is anointing tonight. He's gonna have some growing pains in your one obviously mastering a new defense and Mike Pettine obviously doesn't run a complex scheme, but you know, there's these there's still going to be some some some challenges. They're getting himself accommodated getting himself familiar with what the Packers are trying to do defensively. Eventually. I can see him easily pairing up next to Martinez and I like that you mentioned the fact that he's a very excellent and Blitzer.", " Because that is absolutely true in Mike Pettine would absolutely Relic having him of all people to rush the quarterback from the inside and God forbid any running back that that squares up with Devin Bush. It was Bull rushing him head-on that is not going to end up good for the running bag, but pet loves those kind of interchangeable pieces guys playing various spots and do various things and", " To to Josh Jones. I don't think this this marks really.", " The end of what he could do. I think the power of can still kind of use him as more of a role player in the in certain situations. They can still kind of keep him in certain Downs. They could just keep him keep him up there. You know, I'm sure you know, he doesn't have to play a full time role but he's good very urgent. They have me on Windows when your people but as far as Devin Bush goes, yeah, he would definitely feel well next.", " Martinez and the plan you mapped out for 2020 Burks takes that leap in year 2 and year 3 I mean who knows? You know, that would be a pretty Dynamic pairing right there and two guys, I can cover over the middle of the field and it bursts has able to kind of really Master the physicality aspect of his game and you know rap guys the Sun and on really not shy away from coming across the middle of the field then that's going to pair well with with bush and his abilities.", " What you can do. Yeah, absolutely. I mean that's your best case scenario. Obviously the worst case scenarios that aren't Burke's isn't able to take that second you jump and Devin Bush becomes a first-round bust in which case you're kind of starting from scratch at that position again, when that's the case which kind of leads to the next Point here Zach and that is you know, inside linebackers been a position. I feel like we've been talking about for years that Green Bay could use an infusion of talent and upgrade some high pedigree type of player in the Packers. Just simply haven't done it last.", " Here they traded up in the draft into the third round to draft the Oren Burks. And that is the highest picked they've used and the most amount of draft Capital. They've used on an inside linebacker since Ted Thompson drafted a Jayhawk in the first round in 2005. And that was his first year as the Packers general manager. So that was a long time ago. How the Packers May value him. I'm not quite sure the way I feel about where would I value and so the Packers as we've mentioned if to pick", " X in the first round if you didn't know that I'm assuming you've lived under a rock for the last year. So the Packers pick 12 and 30th. There are some people starting to come around to the idea of Devin Bush at 12:00. Now, obviously a lot of this stuff depends on what is the board look like because that's going to answer a lot of questions in the first place. But as also has been noted on Twitter is only 11 guys can go before Pick 12. I know strange math, but it's strange.", " To see 25 guys that I think I've heard or not going to be available at 12. So the Packers will have a chance with them. I say all that to say it's still not quite I'm not there yet. I don't know if I will be I don't think I could live with the Packers using a top-15 pick on a non-premium position. That frankly is a rundown type of Defender. Even though Devon Bush does excel in the passing game as well.", " Using somebody as a rundown Defender with a top 15 pick. I don't think I could get there yet. If the Packers slide down a few spots or able I've often said I think the 30th overall pick is the move pick and what I mean by that is I think that they'll either move up and get somebody they really like that's falling a little bit in the 20s or move back a little bit if there's a bunch of guys there that they like and they want to pick up an extra picker to if Devin Bush were to fall to say", " Which is where the Tennessee Titans are at right in front of the Pittsburgh Steelers, which kind of seems to be the sweet spot for a lot of mocs as to where Devin bush is going to go. Now. Some people haven't gone earlier than that obviously, but the Steelers do make some sense as a team trying to replace Ryan Shazier. I would be willing for the Packers. I know this kind of sound strange because I said I wouldn't use a top 15 pick on him, but I would move up from Thirty because the 30th pick is an extra lottery ticket to me and go get him that way. I think that's", " Are I'm the most comfortable or if they move back say there's a scenario that happens where Brian Burns and Ed Oliver and all the big-name defensive players are off the board then if that's the case then yeah, you know the Packers could slide back a little bit from 12 and pick him there and I would certainly be willing to talk myself into it. He's a great player. But if they were to stay put at 12 and draft Devin Bush over somebody like", " Oliver Burns Montez sweat the conversation at that point for me. You're probably getting into and without looking at a board. This is kind of difficult, but you're probably getting into the conversation of light Devon Bush or one of the Iowa tight ends. Whichever one you like better pick your flavor. And if that were the case, I mean I'm not real wild about either one as a top any of those things as a top-15 pick, but if that's the case, yeah, I would be able to talk myself into something.", " That so that was really long-winded Zack where I mean, are you comfortable at 12? Are you comfortable at 30? Are you hoping he falls into the second round which seems very unlikely, but where are you looking for the sweet spot if you will to bring this guy in to Green Bay.", " Yeah, I've often said that bush would be one of the four players that I'm perfectly on board with selecting and told overall in bows for burns Devon white at Oliver and wait. What do I say? Hope bush bush Devon white Brian Burns and Ed Oliver's I'm beat right now Jacob, but those would be the four guys that be okay with taking it 12 and I think you know bush with handling got it goes in the between the", " Team in the 20 range but I think that three spot disparity right there. I don't think that warrants passing up on a guy like Bush should be able to help your events and multiple multiple fast seem to be able to help your pass rush as a blistering able to help you and run support. He helps your task coverage over the middlee. We give headin just", " Such a versatile weapon to work with and just I got to add to his Arsenal that that were actually really endless there and I think that would warrant a there so that though.", " and use it", " Yeah, I think that you know, you start looking at some of those things as far as if you want to talk about like an ideal draft if I could just pair to prospects with the Packers for the immediate future. I mean if you look at like 12 overall somebody like one of those stud pass rushers like Brian Burns like Montez sweat, like any of those guys really and then you look in or at Oliver even as somebody else and then you look into that second pick somebody else being Devin Booker.", " You want to talk about a front seven with just out of this world potential adding those two guys to that along with the Smiths along with Kenny Clarke along with Mike Daniels along with Blake Martinez for a year that has well, maybe one year maybe longer that has incredible potential and I think if you want to talk absolutely ideal, that's where we're looking. But again, it's not an ideal world and I don't think things happen that way. So that is Devin Bush the", " Best inside linebacker Prospect in this draft class as noted by Zach and myself check out the T said TV draft guide to see where he exactly Falls in terms of rankings in there. I don't know off the top of my head who it was that did the inside linebacker stuff, but I will get that information for you by the end of this podcast is out. It is available purchase it now Zach, it's Sunday now, but", " Thursday was a pretty busy day in the world of the Green Bay Packers former beat writer Tyler done published an article with Bleacher Report. And basically it was called. Well. I wasn't basically called it was called what happened in Green Bay and a lot a lot to unpack and quite frankly. I mean we can do this show for the next two hours on this article alone, but there was a lot in that story kind of a take down. I don't want to call the take down because that makes it seem like Tyler head.", " Malicious intentions and I don't think that was the case but it take down a Ted Thompson Marc Murphy Mike McCarthy, Aaron Rodgers. Just some Cliff note highlights for you in there. Yes, everyone Greg Jennings and joy, Michael Finley were quoted. I imagine they came sprinting when called and asked about doing an interview for this piece. So that wasn't that surprising but just some highlights the accusation was in there that might work.", " Karthi was skipping offense of meetings to get massages and his office while meetings were taking place. There was also an yeah, there's a yeah, there's a lot there. There's also the accusation that Aaron Rodgers started that rumor as ways to", " Get the coach fired, whatever. I mean whatever the motive was wasn't really stated but it seems kind of obvious in there. But McCarthy missing meetings, there was a quote in there stating that Ted Thompson. The general manager was falling asleep in meetings at points, which could be an attribute to declining health. I don't really want to get into that too much even though it's that's really the only mention of him throughout the story and then the big the big one to me was the the allegation or the whatever word you want.", " Use that when the Packers hired made the decision to hire Matt with floor. It says in the story that they told Aaron Rodgers that they were hiring with floor and there was a pause at the other end of the phone and then Roger spoke and then Murphy is quoted as saying don't be the problem. Don't be the problem basically except coaching. This is your coach and this is how things are going to go and said Mark Murphy was tired of the diva stuff. He was tired of bad headlines. He's right.", " To get things back on track Zach like I mentioned a lot in that story just for the very macro view. What were your first impressions once you read that story for the first time?", " My first impression of Jesus Jacob you're really just you're expecting a lot out of me here. My my mind when I read that story was kind of all over the place because there was just so much information and a lot of it really just", " I mean it confirmed a lot of what we knew about Aaron Rodgers and about like McCarthy. Yeah, we knew that their their relationship was tumultuous. They mean you they may not have gotten along 207 time but a lot of quarterback and Coach can teams don't get along a hundred percent of the time. That's just how it is, but", " No, it shouldn't. I know everyone's really approaching this store with a lot of skepticism because it has Greg Jennings and Michael Finley is names attached to it. But you know, you can't discredit these guys opinions just because you don't like them and just because they're going out on a limb to really spread possible fallacies about their former quarterback, you know, there could be some truth to all of this. We don't really have any reason to believe it, but we don't really have any reason to kind of shoot it down into the dirt either.", " You know Ty Ty did exceptional work on that piece and I believe that it was well-researched and I believe that the he published that with me full belief that he knew exactly what he was going to incite amongst the Packers fan base amongst National media. I mean now that's all I was talking about now about Aaron Rodgers is a diva. Aaron Rodgers has an ego. It's insane, you know, and there's really not one thing to take away from it.", " Just it's crazy. Yeah, there's a lot there. I know I don't want it. I guess I don't want to say I know Tyler personally, but I've met Tyler I've talked to him a little bit. We work together a little bit when I was interning for back a report in college, ultimate professional definitely nice to everybody in the room all very respectful of those sorts of things. I certainly believe that Tyler's intentions were good. And that doesn't mean that you know, everything in the story can be", " Be a hundred percent bulletproof. That's kind of not how it works with anything, you know, especially where you're quoting somebody who one person has their impression of one thing. Another person has their impression and it was something else. I definitely think that like you said, there's a lot that was in there that we kind of already knew. Hey, the funny part to me today was obviously today's kind of the Fallout day. I listen to excuse me today.", " Recording this on a Friday. I listened to Mad Dog radio on SiriusXM everyday and between atoms shine and Danny canal and Nick right and some of the other guys have listed just as the day went through but the funniest part of the day to me was you know, John Michael Finley is quoted in that story several times and you know, he's got some pretty strong quotes about Aaron Rodgers and he tweeted something later in the day about how I know. I've never lied to anybody or I always spoke the truth or something. I don't", " Remember exactly what it said but Adam shine played a quote back from when you're Michael. Finley was being interviewed during the Super Bowl week on the show. And you're Michael. Finley basically was asked about Aaron Rodgers. He says, yeah, he loves to be coached. You know, he doesn't always like what the coaches do but you know, he loves to be coats. That's what he wants. That's what he is that's coachable dude. I never had a problem with him all that sort of stuff. So", " Right there. You have a contradiction between basically everything that Finley said in that story and what he said over the air. So if I had some advice for mr. Finley, it would be just remembered if you say something on the air it's not going to go away that that stuff gets archived. So that was kind of funny to me today was definitely the fall out day.", " You know, I do think it's funny the confirmation biases that take place like the people that think oh Mike McCarthy was a moron see this is proof of that or Oh, Aaron Rodgers is Diva. Aaron Rodgers is Jerk It's almost like the people that worship at Brett Favre's altar. So badly want these things about him to be true and then you go and you know, the Ted Thompson stuff or I don't like Mark Murphy. So I'm glad this stuff came out and can embarrass him or whatever. I just think that's disingenuous the reality of the", " raisin is", " do I think a hundred percent of the things in this story were true know I don't and that doesn't mean that Tyler made them up either because let me get something before I get into this. Let me get something out of the way and Zack. I'm sure you'll agree with me.", " I love Twitter. There's so many things on it that I think are hilarious and its really a good tool. It's got a good use of you know for us to connect with just people in general. But the thing that makes me laugh about it is immediately Tyler done has his integrity and everything called into question because he used Anonymous sources, which there's various reasons. They can do that and I get that, you know, I see the quote of that's not journalism. That's like yeah the person who", " Is and nothing against these people that do something else like me. I work in long-term care facilities for a living. I am not a quote-unquote journalist. I'm not going to tell somebody who went to school has a degree in journalism and is a professional what is and isn't their job and how their job is supposed to work. Tyler done says he's", " Right exactly. There's that too. That's quite literally journalism so we can agree with those things but the confirmation biases and stuff like that. I just find that funny myself that people want these things to be true. Here's the reality situation. I don't think everything in that story that was reported as a hundred percent fact, there can be context and things whatever that make things different than how they were portrayed in that story what I do think, however,", " Is that there are four people pretty much explicitly mentioned in the story Ted Thompson Marc Murphy Mike McCarthy, Aaron Rodgers all four of them share some faults and blame for how this whole thing went down really since 2010 and that's really where it happens. Now the mat the microbe you the very, you know, close view now.", " the offseason program for the Packers starts on Monday", " Ted Thompson is not the general manager anymore. Mike McCarthy is not the head coach anymore Marc Murphy still around but do he and Rogers have like this huge relationship with each other? Probably not. They probably don't interact a ton. I shouldn't say it that way, but do you now I'm at the point where I believe and I think this is the only way to look at it. Now is that the buck stops with Aaron Rodgers? Everybody else is gone. Now. It's going to be all eyes are on him.", " And can you get back to the MVP level form that you've had and recent past are you going to be this pouty not to play body language police too much but pouting whining undermining that was something else that was kind of disturbing about the story was Roger's undermining the head coach going rogue and changing the plays in the huddle.", " Putting his receivers and impossible positions. Are you going to do all those things because really the biggest way for this to go away.", " Is for because obviously since then and Zach I'll let you talk about this. But Rogers is head teammates come out in support of him former players have come out in support of Mike McCarthy. None of that stuff's going to matter. What is going to matter. What's going to make this go away is Aaron Rodgers playing at an MVP level of the Green Bay Packers getting back in the playoffs. That's what matters the most. So Zach I got through that talk to me a little bit though about how you know, this story comes out and it's one of the frustrations that the fanbase seems to have is when a story like this.", " Come out that criticizes Aaron Rodgers. It's the same people. It's Greg Jennings. It's your Michael Finley. It's people that love and worship Brett Favre and that's really about it. Why doesn't that get more play than say for example, and we brought it up on the show hundred times. Why doesn't that get more play than Davante Adams calling him as brother or the stuff John Kuhn said or just his countless muntean. It's that have come out in support of him. Why is that the case?", " We did talk about it before the show. It's because that won't get cliff.", " But won't dip their time. It's not it's not as juicy as you know, a story about McCarthy skipping team meetings to get a massage in the stairwell or something like that. You know, it's not it's nothing of that magnitude and you know, there are three things. I wanted to mention the birthing about his teammates current and former. You got Casey Heyward coming to defend him on Twitter Jermaine Whitehead as defended him term on Williams Davante Adams, John Kuhn and the Brabus big", " A couple others that I'm forgetting they have all come to defend Aaron Rodgers and attach their names to their defensive.", " Current and former teammates have shared a locker room with Rogers pretty much talking about how 12 is great to them. It was great to them. He was you know, he was a very good teammate. He's a very good person and from the story. You just got the same two guys, Brian Jennings and you Michael Finley and you know, you think I could talk about how Greg Jennings has every right to be upset, but I could talk about that whatever but you Michael Finley. I don't understand where his bitterness comes.", " I really don't but in the grand scheme of this it is just those two guys running and Grant was also featured in the story the former running back and he keep", " Was relatively neutral about the whole thing. He defended Aaron Rodgers. He kept a kind of closely lens view of the whole thing. It was give me probably the best source person in the story. But the second thing I wanted to touch on is what you mentioned. No one is absolved from Layman this Aaron Rodgers contributed to the fall out with between him and Mike McCarthy McCarthy contributed to the Fallout between him and Rogers. I'm sure Marc Murphy played a role in it. I don't Ted Thompson even that", " That relationship between those two for those 13 Seasons. It was very obviously toxic and it was obvious that something that about it and it boiled over last season against Buffalo Bills. We all side we all heard Aaron Rodgers publicly trashed the game plan when the Packers had 123 yards of offense. They were eleven 419 on third round, which is a testament to how bad they were on the early downs and the Packers 122 to 0, but", " Just felt like they should have really just blown the bills out of the water, but they didn't and didn't know this here. There's really just summarizing the last couple years of McCarthy era in that game. Boy, Aaron Jones and Mo Williams had 11 carries. Aaron Jones pushed over 60 yards on the ground. Jamal Williams had 27 wives he was averaging about two two and a half yards a carry. So it's August on one guy is running ball better. You feed him the ball, right? You don't stick to that little formula where you try to", " establish a 2 pack system like McCarthy did for a large part 2017 and 2018. So that really kind of just put the grand scheme of the home final years of the McCarthy era in a vacuum and really summarize the whole thing. But the third thing I wanted to touch on two is that Aaron Rodgers has an ego and that was that was one of the parts of the story that kind of rub people the wrong way. It's surprise people and", " The life of me I can't figure out why that was surprised anybody. Yeah, Aaron Rodgers has a goddamn ego. Of course, he does. He's doing Century. We got some food. No Maniac. He's like, there's no have this about the attitude but", " You need to be like Aaron Rodgers that you want to succeed.", " At that level like in the NFL if you're playing the position that Aaron Rodgers plays at the Congressional level. You need to have an ego. You need to believe you're the best damn thing since sliced bread and we need to be able to step on the field believing you're going to do unspeakable things that are different across from you. You need to have full confidence in your abilities. And that that's having an ego Tom Brady has an Ingo Michael Jordan had an ego. I'm sure every single damn player on the Golden State Warriors roster hasn't we go?", " And there's nothing wrong with that.", " That's all I gotta say.", " Thank you Forrest Gump for that ending. That was wonderful. That's all I had to say about that. There we go. Okay, I did think it was funny today as I'm listening again. I was listening to it was it's Dog Days Sports hosted by Steve Tori and Danny canal and somebody makes a call and Danny Canal has been the type that seems a little bit like he has a bit of an axe to grind with Aaron Rodgers. I'm not a hundred percent sure why that is I could just be cherry picking a couple things that I've heard him say before so that's certainly possible, but nonetheless somebody", " Zin", " and says like well, that's the difference between you know, Aaron Rodgers and Tom Brady and why Brady's one more and bottle bottle bottle guys. There's yeah, there's ways to read this story take it for what it's worth not over sensationalize it and don't change facts to fit your stories either because Tom Brady reportedly and this was confirmed by a couple teammates to walked in to the Patriots facilities before this year's AFC Championship game.", " And said quote. I'm the baddest MF on the planet. That's not something somebody humble says, of course Tom Brady has an ego. He's the most accomplished quarterback in the history of football. He's married to a supermodel why the hell wouldn't he have an ego? There's no reason for him not to have an ego Rogers is no different than Roethlisberger's no different. Drew Brees is no different. Brett Favre was no different Peyton Manning was no different Eli Manning sucks. He has an ego. He's no different.", " That's how this works great players have egos. You mentioned. You went to other sports Michael Jordan Kobe Bryant's LeBron James the Warriors Derek. Jeter was seen as this like humble dude when he was in New York Yankee he was the starting shortstop for the New York Yankees and going home with Mariah Carey on a given night know that dude was not humble either.", " humility is one of the most", " overrated in this context thing when it comes to sports do I think that Rogers is arrogant enough to believe you can just do whatever the hell he wants and the Packers win when he gets on the field. No.", " I don't think that but of course he thinks that I'm the best player on the field when I step on the field. That's all these guys Works guys that suck think that.", " That's how you have to be to be a professional athlete just like he said exact a few things to touch on as far as just things that were refuted the the conversation that was alleged to have been had between Murphy and Rogers when the floor was hired, you know Murphy allegedly told him don't be the told Rogers. Don't be the problem Jason will he went on a radio show today and the towards the east coast?", " And said that that story was false. So again, that doesn't make it false. It doesn't make it true. It's just some adding some context to that story. I think that ultimately the the offseason program starts on Monday. I'm sure Matt will floor will get asked a couple questions about it. Aaron Rodgers is Media will availability will be interesting. I will be keeping an eye on that as well. But ultimately", " Zach that I want to look at, you know, you got to look back before you can move forward kind of thing how if at all does this affect the 2019 version of the Green Bay Packers?", " well", " I think Evan Rogers a mountain floor.", " Their chemistry and their relationship with each other was already going to be kind of like the Cornerstone of any success. The Packers are going to have in 2019 whether this story came out or whether it never did whether we have any idea ever existed.", " When Miriam to do together and how they're able to mesh just as a quarterback and as a coach and how willing they're going to be able to combine ideas. I mean, I know the floor will be but Rogers, I mean, he's four years younger than the floor, you know, there's the description see there is like insignificant. Okay, I mean if is Roger is going to respect this 39 year old head coach. Is he going to", " Kind of feel like his position on the team is being undermined. Is he still going to have the same amount of control over the team as he had before, you know, whether that's on the field or in the Huddle or you know, just over the players as a leader, you know, so", " Yeah, you know whether the sword came out or not. It was going to be dependent on how those two mesh. So that's that's really how I felt about that regardless.", " Yeah, I agree. I think that was going to be a big story line. No matter if this story came out if it never came out and came out the day before the season started. I think that how matloff Florida and Rogers mesh was going to be a big storyline. Anyways, as far as the rest of the stuff goes. I've been very adamant about this since I started blogging for Packers talk.com or you know, wherever doesn't really matter where I've been or how I've done but something that", " I always talk about is you know, we talk about players leadership abilities and know what kind of leader are they the reality of the situation and I said this in a story I wrote for Dairyland Express yesterday was Ray Lewis is seen as this like unquestioned emotional leader of the Baltimore Ravens during his tenure there and there were some players that responded to him definitely but there were also guys like Joe Flacco who said that, you know, there were people like him and others", " They just kind of stopped listening when race started talking because well as somebody who is like that myself. I think Ray Lewis is a blowhard. I don't have much desire to listen to him talk too much about anything but I say that to say leadership is something that can only be defined in the locker room by the players in the locker room. And sometimes there are different leadership styles. I know this Zack you can probably attest this for bosses you work for there are certain leaders.", " That I've messed with better the best people the way that I am motivated. I know this thing's problems issues need to be addressed with me immediately face-to-face. Let's have conflict resolved the issue and get it over with the problems that I have had with leaders in the past is with the passive-aggressive crap. So my boss tells one of my co-workers to tell me that I need to do this better. That doesn't help me. So that's a very Elementary example, but", " Something I could say we're different leadership styles work for different people. Now, Aaron Rodgers has had plenty of people say that he is a good leader.", " But that doesn't mean that he is four other guys either like some people respond to the Mike Daniels way of leadership. That's not Aaron Rodgers really? He's not the fiery throw stuff break things like Mike Daniels is and that's okay. He's not the leader style like Brett Favre is and I really think that that's where a lot of this stems from a lot of this issue with Aaron Rodgers is leadership style stems from Brett Favre. I really do think that", " And listen, there's the hypocrisy that comes with the far fans and the the far valter worshippers that I mentioned earlier. There's plenty to go around they don't like Aaron Rodgers because they don't like his personality, but they defend Brett Favre who", " At minimum is an adulterer cheated on his wife several times and a drunk who went through all those things and at maximum should have been convicted of sexual harassment and I don't want to go too far down that rabbit hole, but I personally don't get it. That's that's just me, but Zach anything on anything. I just said before we close up here. I know there was a lot in there, but Aaron", " Rogers is leadership style. Do you think that that is a problem or you kind of like me from a standpoint of we aren't in the locker room, how the hell are we supposed to know?", " Yeah, 100%", " Yeah, I agree. I know a lot of the stuff I tweeted on on Friday that you know really for a personality standpoint from what we see at the podium what we see, you know outside of the games. Yeah. It's like the most boring personality like like like on the entire roster Eddie died.", " The numbers a player, you know, of course, he got the couple, you know every now then you can play a snide sarcastic comment from him while he's at a pressure or something like that. But really it's hard to judge his leadership abilities because you know, we're not in the locker. We don't know how he really addresses a team. We don't know how he how he handles his role, you know, obviously the players like the players I mentioned earlier that that have come out and defended him. They all respect him for a reason not just because he's one of the most talented pass.", " Ever they respecting because you know clearly he guides them to winning. He guides them as you know, and as the player who played through injury multiple times last season specifically and the guy who played through meaningless games at the end of last season despite them being already out of the playoff picture because he wanted to set an example. He wanted to he wanted to sit that leadership.", " Ample like that. That's a prime example of who Aaron Rodgers is right there. He's at the guy that'll bark in everyone's faces, like telling about all we need. We're gonna come back and win this game with your hands on your you know, what but he motivates players through his actions. That's the kind of leader that he is now, of course, like we said, we don't know how he's a locker room. And how are you dressed as everybody else? But you know, he's obviously in the position that he is for a reason.", " Yeah, I agree in something else. I think it was you who tweeted it out today about Rogers picking a fight with a 300-pound linemen to protect his teammates. That was", " it was a tweet from December. I think it was probably the Falcons game or no. It was the it was a Jets game."]}