{"showID": "0a0iyqjSgKKZ49eOKZYpY9", "show_name": "The All Things Mavs Podcast", "show_description": "The All Things Mavs podcast is hosted by Jimmy Crowther and brings YOU Dallas Mavericks rumors, news and much more! Each episode, Jimmy Crowther will give you updates on Luka Doncic, Kristaps Porzingis and the rest of the Dallas Mavs! Everything from NBA trades, free agency, the playoffs and the regular season is all right here on demand. Support this podcast: https://anchor.fm/all-things-mavs/support", "episode_name": "The All Things Mavs Podcast", "episode_description": "The All Things Mavs podcast is hosted by Jimmy Crowther and brings YOU Dallas Mavericks rumors, news and much more! Each episode, Jimmy Crowther will give you updates on Luka Doncic, Kristaps Porzingis and the rest of the Dallas Mavs! Everything from NBA trades, free agency, the playoffs and the regular season is all right here on demand. Support this podcast: https://anchor.fm/all-things-mavs/support", "transcript": ["All things levels Hayes and gentlemen, it's June 30th. You know what? That means? It's the start the official start of NBA free agency. And right now on the all things Maps podcast. I am your host Jimmy Crowther. We're going through all the latest news and rumors going around the Dallas Mavericks.", "Going around the NBA leading up to free agency which of course starts at five o'clock here in Dallas Central Time and six o'clock Eastern time, whatever time zone you are in whatever time zone you're listening in to thank you for tuning in to the all things Mavs podcast. Now first-ever pot. I did here which this is only my third podcast and again before I go any further. I want to let you guys know that I am pending approval on Apple podcast on Google podcast on", " on a bunch of different platforms. It's just pending the approval and I don't even know what that means or why it hasn't happened yet, but it's going to happen. That is a promise with I would think hopefully by the end of Sunday if not sometime Monday, but we'll find out when that is and when it happens, I'll let you know until then you can listen right here on anchor and you can listen on Spotify. Those are the two places where I've already been approved and that's what we are what you are probably listening on.", " Right now unless by some Stroke of Luck overnight this got approved. Anyway, according this at about 1200 for am here in Dallas and I waited this long because I wanted to make sure that any news and rumors that came through I would have them ready to go on today's podcast. I literally waited until like as long as I could just to get it all to you guys to give you all my opinions on all that stuff and I'm sure some stuff is going to happen.", " Even while we're on this podcast, like literally there's stuff Zoom is like flying in right now if you heard those vibrations that was my phone because all right. I get notifications getting texts getting calls all that good stuff. But anyway on the first podcast I did let's Circle back around to that point. I mentioned that I wanted to this this to be the most interactive maps podcast. I didn't do a great job of energy engaging with you guys that last time I didn't really ask you any questions. I kinda just told you everything I wanted to talk about so I'm going to start this one off.", " With a quick question, what going into free agency, you know prior to all the news that's come out. What was your expectation? So that's question a what was your expectation before any news came out because mine personally was that we were going to end up with Kemba Walker until as of late and then I want you to answer Part B. What is your expectation now that we are literally the day of NBA free agency for the map. So tweet at me at all.", " Things Mavs all underscore things underscore mouth whatever. Y'all know my handle go tweet that tweet that answer to me. I'll ask you questions. Also throughout the podcast to keep you engaged. Keep you interacting with me here on social media per usual. So let's just start off with all the stuff that went on today because there was a lot of course, this is the day that meetings could be set up Friday or Saturday. Excuse me, Saturday was and we're talking about all the meetings could get set up it started happening.", " And really the only things that happen on the Mavs side, there was nothing really, you know major any any major meetings kind of set up for Dallas, but they did contact Patrick Beverley and so did the Chicago Bulls and the Los Angeles Lakers. Now, those are the only three teams I have heard that I've actually had contact with them. There's not been a you know, official face-to-face meeting set up, but they would at least talk. So I", " Here's my expectation. I'll kind of give you my expectations and my hopes for all of it expectation and hope is they progress on a deal starting when free agency open? So once free agency opens?", " I believe there will be some kind of traction Tour de tournay and agreement between Patrick Beverley and the Dallas Mavericks again, that should be south of 40 million for three years. I would expect it to start at around 12 million for specific reasons reason. Number one being Malcolm. Brogdon is a free agent and near the end of the night. It was like 10 o'clock and also in maps Twitter started blowing up and they were like", " And I was like, why are we not heard anything about a qualifying offer being sent to Malcolm Brogdon, which of course if you're entering restricted free agency, you can get the qualifying offer from your team and your team only and that is what officially makes you a restricted free agent. We hadn't heard that offered to Malcolm Brogdon yet and then at like 1201 here in Dallas or I actually was like closer to 11:00 11:30. So 12:30 eastern time it officially came out. It was like, yeah, he got the qualifying offer. So he is officially we should be free.", " So so sad but nothing that we didn't really expect going into it turns out sons and the Mavericks and a couple other teams the Bulls possibly the Pacers are all teams that could consider giving Brogdon an offer sheet and that traction really started to kind of take off, you know, Sunday. There's a lot more talk about or Saturday. Excuse me. We are in Sunday now a lot more talk about it and really start to pick up.", " And here's kind of what needs to happen. It's got to be at least 20 million, right? That's the number that people believe.", " We'll get get Brogdon away from Dowler Milwaukee, but I believe it has to be at least 22 million and even that I still think Milwaukee can match. So what Dallas needs to do is stretch and wave Courtney Lee and that frees up about eight million dollars in cap space that gets the Mavs to 37 million dollars.", " So what you do is you offer Beverly 12 million dollars and you would give Brogdon 25 million dollars next season and I can't imagine Milwaukee matches at 25 and if they do then good for them. Let them have Brogdon because I don't think I could go anywhere. I don't think I could be comfortable with giving him more than 25.", " But I'd be happy with that. So that being said that's kind of just some thoughts and also some stuff on on Beverly. They will talk to Beverly tomorrow a face-to-face meeting hasn't officially been set up but they will speak with him once free agency opens. Now another rumor involving another Wing that has some connections with Dallas apparently in some interest. There is Tobias Harris this came from Brad Townsend who's been all over all of this stuff all week long and like since really", " Man since like last summer, like last summer was the first time I remember personally, I mean, he's probably he's been covering them for a long time but breaking news and rumors and stuff really is what I remember from last summer for the first time. He says that the Dallas Mavericks are one of a few teams who are interested in Tobias Harris, but", " the interesting part was that the only interest that they have in him is at a rate less than the max. So I said on the last podcast that I would be okay giving Tobias Harris about a Max contract. I wouldn't be ecstatic about it, but I would have been okay with it, right? So what I've been something I looked at what is the max for Tobias? It's for years a hundred forty million, of course, Philadelphia can offer him five years 190 million, but I think an offer to Tobias from Dallas would", " A lot like if not exactly like an offer to Malcolm Brogdon, give milk. Give Tobias 25 million.", " And go give Beverly 12 million. I mean they are friends. They had they didn't play together in Los Angeles. They tweeted each other their interactive. Like I still think they're closed.", " So maybe maybe he thinks about it. I also don't know what the market is looking like now for Tobias Harris. I talked about this on chat sports today. I went live when all the new started to break with Tom Downey and we discussed Tobias Harris and I started thinking who is giving Tobias Harris a Max contract now because let's go through the teams real quick, okay.", " Philadelphia is the is the number one team I my expectation is that they do give him a Max at the end of the day. I do think they'll end up giving him a Max. I just think it'll take them a little while to actually offer that up and then you think about the Utah Jazz they were interested in him, but then they got Mike Conley and now the latest report from it's not Shawn's but it's someone that works with shamsher Anya is that they're looking at offering boy on bogdanovich a sizable offer if they offer bogdanovich sides will offer then Tobias has", " Not going to Utah right? So that was another thing that was reportedly interested. The New York Knicks could be but the the other Report with New York is that if they don't get one of their top guys like Kevin Durant Kyrie Irving, which doesn't look like they're getting Kyrie now is he's probably headed to Brooklyn as well. Actually, I'm not gonna say probably he's headed to Brooklyn.", " You know it does New York want to spend money on a couple lower-tier guys second-tier guys like Tobias Harris. I think New York's going to keep the powder dry and not give anyone a Max contract including Tobias Harris. So", " II think you cross the Knicks off as a potential Suitor for Harris that would really offer him a Max. I think they would sign up for less than that, but I don't know the Nets are a team if they get Kyrie and don't get anybody else. They could be a team and then after that it's like Sacramento maybe but probably not because they just got Harrison Barnes, right?", " So I'm starting to look at it's like who's actually giving Tobias Harris a Max contract outside of Philadelphia and possibly Brooklyn that starting to fade for me. So I think there is a chance The Mask could end up with Tobias Harris at 25 million.", " But I haven't decided if I want to buy a pterosaur Malcolm Brogdon for 25 million one over the other I think I would be right now. As long as Beverley comes with both of them. I'd be just as ecstatic for both or for either or so. That's Tobias Harris. That's all the rumors are. They are not the Dallas Mavericks will not offer Harris a max. They're going to bid on him for less than the max with the expectation.", " That the Philadelphia 76ers are going to give him a five year Max Steel. I believe they'll end up with that. That's that's the expectation there. So as much as we like the idea, it's not looking likely the Mavs owning feel like it's likely another thing that came out today Ryan broke off they passed up. Actually, let's go back to the device hissing. Let me know tweet at me. If you would give Tobias Harris a Max contract now that would mean no Beverly probably if unless they you know, a lot of things would have to go right but that probably means", " No Beverly and really nobody else substantial. So let me know yes or no, if you would give Tobias Amex but other thing that came out Ryan broke off officially got his contract guaranteed for next year. They just didn't do anything. You know, it only way to save them five hundred thousand dollars. So, you know not really worth it. So they guarantee his 1.4 million for next season. I hope you get some playing time because we didn't get playing time. It was pretty good, you know knock down three point shooter. It's really what he is and that's all he needs to be so.", " Yeah, Ryan broke off. He's back. Keep going through the list here of MAV stuff and there wasn't a whole lot else, you know, of course tomorrow or today as you're listening to this the Mavericks will finalize a five-year a hundred fifty eight million dollar agreement with kristaps porzingis as we all expected and I am so so happy, you know, let's let's just talk about this real quick because", " the whole goal of trading port for porzingis was", " that's our big fish. Okay had he entered free agency as a New York Knick. We would have offered him a Max contract anyway, and then we ended up trading form and getting to court him the entire time so we can bet just get an agreement on them like", " great move by Dallas and now it looks like it's about done about to be done. Once free agency opens on Sunday five o'clock here in Dallas 501. I guess technically outside of that there weren't a whole lot of other rumors. Nikola Mirotic went as going back to Spain making bank. Apparently, he's getting six years like 70 million Euros. So, you know good for em, you know, I can't you can't knock a guy.", " Wanting to go there like wanted to go back to his hometown. He was a potential Target for the Mavs. But also the Jazz were prepared to offer him 45 million over three years, which is, you know, starting to looking back on it it probably a blessing in disguise that he's going back to Spain for the Mavs. So we didn't end up offering that because I don't think he's worth that in other news.", " Kemba Walker is going to Boston Harrison Barnes going to Sacramento. Oh another one that I can't right before I started recording her Nicolo vuckovich getting it looks like the hundred million for 4 years 5 years. Let's see. Let me look it up real quick. I don't want to get it wrong.", " But it's looking like we shout out to Mark sign was breaking that all this stuff for four years a hundred million. So he'll get 25 million a year, you know at the time once we traded for porzingis, it looked like he was a Target and then he had a horrible playoff run and then we started to think a little bit more and it just didn't make sense. So he's going back to Orlando likely today will agree on that porzingis five years hundred fifty eight million. That's a for sure Klay Thompson to the Warriors a five years a hundred ninety million. That's pretty much for sure.", " Kemba Walker to the Celtics four years a hundred forty-one million. That's pretty much for sure and Kyrie Irving to the Brooklyn Nets. That's basically for sure and then also Harrison Barnes for years 88 million. That's those are all the things that we can expect to happen on day one of NBA free agency and outside of that.", " Does anybody know does anybody really know what's going to happen? No, so here's what I'm gonna do for the rest of this podcast about 15 minutes and I gave you all the latest Mavs news and rumors. Who no, I didn't pause because in Miami Heat beat writer put out a little little tweet that really caught some traction.", " he says this guy's name is Greg cylinder looks like and he is Miami Heat beat Insider Rider and podcast co-host at five reasons Forts and you can follow him at Lefty underscore ell ëif I think that's the Lefty Leaf is what we'll call him there and let's read you guys this tweet because you might have missed it because it kind of flew under the radar he doesn't have a blue check but definitely an interesting name or a little interesting Tweety put out here he says as the Heat", " The legal of that word in canvas the league for potential third teams to help absorb salary in a Jimmy Butler sign-and-trade. I'm told the Dallas Mavericks maybe a willing participant if it Nets them point guard Goron chaga judge. That's right. The guy that's right, you know been convinced or big events been linked to Dallas for so long obviously, Slovenia buddy-buddy with Luca, Don Cheech.", " No surprise there.", " Lot of connections back to Dallas but here's here's the one thing that has to happen. And I was actually messaging back and forth on Twitter with Max Levy. You can follow them at Max Scouts on Twitter and we were talking about that and it was kind of, you know, it's pretty obvious that this deal doesn't get done or Dallas doesn't jump in this deal. If they can't one land Goron and to they can't dump either a Courtney Lee be Tim Hardaway jr. or see both", " Because without dumping either of them and I don't hate to call Tim Hardaway jr. Just dumping the contract because I do believe he can be a valuable player just doesn't live up to the contract Courtney Lee on the other hand is a complete, you know, you just completely dumped that like sorry. Sorry Courtney Lee like no disrespect but kind of disrespectful of what I'm saying here. Anyway, this deal only gets done if you can dump one of if not both of those guys and then get drug its back and he", " Is your probable starting point guard next season and I kind of went back and forth to do I want Grand rogich next year and his lack of Defense but exceptional offense and incredible fit next to Luca Don church, or do I want Patrick Beverley at 12 million next year with his incredible defense lack of offense, but also an incredible Fitness to Toluca as well.", " It's definitely good question. And it's definitely something I haven't made my mind up on I could sell myself and I think I could sell you guys on either one of them as our next morning starting point guard. Just depending on how it comes about like if we got dragons, but didn't give anything up like we didn't give them give give any salary away and we were just hindered and free agency because we traded for drug itch then I'd be upset, but if we got drug itch and also dumped Lee and or Hardaway then I'd be happy.", " But from a straight-up, who do I want more? I'm gonna lean Beverly right now because of the money, I think he's commanding and the defense ability, but let me know what y'all think on that one. If you'd rather have Patrick Beverley or Goron draw get you next season in Dallas as the starting point guard.", " But now because I haven't given you guys any predictions on major players or you know, really just my predictions and free agency at all. I'm going to do that. I'm going to run through all the top guys and I'm going to give you what I hope happens what I think will happen and how it all connects to Dallas in the at the end of the day so start from the top. What do you guys say Kawhi Leonard?", " I hope he goes back to Toronto and I think he will go back to Toronto. That's my full belief. There's rumors that the Lakers are firmly in the mix. I don't buy it. There's rumors that you know, he's getting recruited by LeBron and AD. I think that's all true. I just don't think it's going to sway him or rock the boat or anything. I do think he'll give serious consideration to the clippers. But ultimately, I think it goes back to Toronto. That's what I hope happens.", " And it's better for Dallas. I mean just put the powerhouses in the Eastern Conference. So Kevin Durant number two second guy. I'm running through hoops, hype here. Of course the top available players this summer. Number two, Kevin Durant. Look if golden state offers a five-year deal. He's going to go back to Golden State that is my complete expectation. And apparently they're actually going to that is that is what everybody expects around the league is that they will offer five years. So if that happens, I think he goes back.", " Golden State I would like for him to go to either Brooklyn or New York because look you get get as much again as much power out of the East as possible and I would like for him to go to either one of those teams. I do think New York is a really good chance. I give Golden State the slight Edge there Kyrie Irving hope and expectation Brooklyn and it's going to happen. Like it's almost a done deal. We kind of already talked about that so good for him number four Kimball Walker.", " moment of silence for Kemba Walker to Dallas", " That's your moment of silence. But here's one thing I want to say about Kim. But first of all expectation is goes to Boston because that's what's happening. So am I upset that? He's not coming to Dallas. Yes, I am. But am I that surprise? No because let's think about this. We always heard that Dallas was interested in Kemba Walker right? Like everybody knew that that was that was super obvious. They put it out there. There was never any rumor nothing was ever said.", " Kemba Walker being interested in Dallas", " So it's a two-way street like every team can show interest in anybody but it doesn't matter unless there's mutual interest on that side. And there was never a single hint of Kemba Walker even looking at Dallas. So I'm not surprised at this point and it kind of took me a little bit to think about that, but it's true. So NADA not really worth it while details of Nikola Mirotic has Mirotic is deal with the Euroleague Barcelona just came out six years seven.", " Nine million dollars. That's a long time. No wonder he didn't stay in the United States good for him getting that secure and a bagged. Oh, all right number five. Jimmy Butler man. I don't know what the heck Jimmy was gonna do. I'm gonna lean that he stays in Philly for the five years. That's kind of kind of what I think right now my only hope really is that he doesn't go to Houston even though if he did go to Houston, that means they give up give up a lot of depth and I'm really not sure.", " Sure, how good that team is I mean, I know Harden and Butler incredible as much as it pains me to say Chris Paul is useless to small always hurt. I don't like Chris Paul at all never will never have except when he was in New Orleans. Now these in Houston couldn't care less what happens to the guy I think you'll fizzle out and about two years and go hang out with Carmelo Anthony in Lifetime Fitness and ball out on some high schoolers congrats CP3. So anyway, Jimmy Butler, that's all I got on him D'Angelo Russell number 6", " You know people want to try to tattoo tie him together with the Dallas Mavericks. There's just not a fit. I think there is I think they're potentially could be I like it. I like the idea of it. But the Mavs I don't think love the idea of it. I do think there are a lot of question marks there and I understand that but his age man, like I really thought the maps would look hard at him and he's going to be unrestricted because the Brooklyn Nets are going", " Renounce him so that they can sign one Kyrie Irving.", " But apparently that just doesn't matter and he will be an unrestricted free agent my expectation man. I don't know he's meeting with Minnesota. I hope he doesn't go there because that's another team in the west that just could compete for a playoff spot which Dallas does not need so I do not want to see him go to Minnesota if he does though, and that's not my expectation. I really don't know. I hadn't really have expectation for him. I don't know what's going to happen. But or prediction, I guess I should say.", " But if he does go to Minnesota and if that means Robert Covington needs to get moved Dallas should be all over it Dalton trig tweeted at me that he was looking at Robert Covington through his Mavs goggles. Yeah, sign me up. Like I don't know how I would make it we'd make it work, but man", " Robert Covington and and Patrick Beverley has your offseason additions like shooting in defense those to fit the bill 120 million percent Klay Thompson not going to spend almost any time here. He's going back to Golden State five years congrats. I love clay always will cheer for Klay Thompson friend of chat sports actually and good for him. He's doing good things there. Khris Middleton. Khris Middleton. He's", " Gonna get the max. He's going to get the 5 year Max from Milwaukee, but I did find it interesting when I believe it was whoa Jour Stein is one of the two powerhouses said Chris Milton will return to Milwaukee unless he receives a five-year offer less than what we thought.", " And I was like wait. Why is that? Why did that even come up? Like, is there an idea that he might not I'd say no. I my expectation is a hundred percent. He gets a five-year Max from Milwaukee, but if he doesn't", " If he does not I would Max khris Middleton out. So like you wouldn't even a blink like you want to talk about a guy that is as close to a match made in heaven for Dallas as possible. It's Chris freaking Middleton. I would die for him and Dallas man, even though he's a Texas A&M guy. You know, that's his that's his biggest downside is that he went to Texas A&M sorry, but he'll be back in Milwaukee. That's my full prediction there.", " Tobias Harris now this is where things really really really get interesting. Especially if your Maps fan.", " Because I expect him to go back to Philadelphia. That is my prediction is that he does end up back in Philly? I think they'll end up bringing him and Jimmy Butler back, you know, I know there's rumors that they couldn't lose one if not both of them, but I think Tobias Harrison and Jimmy Walker back in Philadelphia. Hmm. I hope and this isn't my ultimate hope but my hope is that he listens to Dallas at 25 million, Dallas, Dallas.", " Calls Tobias Harris happy says yo, we got Patrick Beverley locked in at 12 million dollars. He wants to play with you again. Here's 25 million dollars come team up. Let's run this thing. Let's be an offensive Juggernaut and you are the option, you know second third second option in some scenarios most likely a third option, but it's better than being a fourth option in Philly. So,", " Come on Brother. Come on Tobias Harris. So prediction Philadelphia. Hope he listens to Dallas at 25 mil depending on who else they allocate that money too, and we'll get to that in just a minute. So stay tuned.", " Number 10. It's kristaps porzingis actually on this list, which if he were healthy.", " If kristaps porzingis were healthy. I think he'd be in the top five of this list personally, but he's not he wasn't healthy this past season, so he is down at 10 and guess what? He's coming back to Dallas.", " That's it. That's that's all the notes five years Max contract kristaps porzingis Dallas Mavericks Luke Advantage together for like all of eternity. So that's cool. Number 11 is Nikola Mirotic. He's going to Barcelona nicolayevitch. He'll be headed back to Orlando at four years hundred mil. Congrats 25 mil per year. They got him. They got their guy back.", " 12 whole Lord. Oh Lord have mercy it's Boogie cousins and you could not I I would never put any kind of money down on any kind of prediction for what DeMarcus Cousins going to do the summer because that is probably the biggest question mark this summer. I truly have no idea he could get anywhere from like a mid-level exception to a team giving him like 20 million that neither", " it surprised me, but I'm going to predict he goes to", " the Lakers", " I think the Lakers swing and miss and they end up with Boogie as their starting center for probably a mid level and you know, what good luck. I don't really have any strong feelings about DeMarcus Cousins one way or the other. I just know we can't stay healthy. I do have strong feelings against him in Dallas, even if it's day four five and we're in free agency. We haven't landed anybody and he's still out there. I'm not not for it.", " Even a little bit personally can't do it won't do it never going to do it. No. Thank you hard pass on DeMarcus Cousins in Dallas. Next player is a Mavs fan favorite Julius Randle of pressure with Christian Academy in Plano, Texas. Fun fact that is the high school. I went to I was a freshman when he was a senior and I talked to him like twice so you can basically say we're best friends, but in other words,", " Julius great player. I will always support the idea of him in Dallas. I could never say no if he ended up to as Mavericks option. I just don't know if he is because every time I've seen a report come out with him and teams interested. I don't see us on the list which surprises me because I'm high on him and Dallas. I'd be extremely high on him if it were for I'd it's so tough because he opted out of what nine million dollars.", " Our earnings are 13 million like this is the summer. He's going to get paid. He averaged 21 and nine like 21 10 2010. I mean the guy's a monster. He isn't a great defensive player. I guess I'll say that he wasn't very good defensively in New Orleans, but signed me up for Julius Randle at 18 million.", " Man 18 million seems high but I would do it. I would definitely do it. If you want to come here. I wish you wouldn't be my first option, but he would definitely be a top option for me as a Dallas Maverick. My expectation is that he ends up going to Brooklyn with Kyrie Irving?", " Because I don't think the land of second star and I think he would be perfect next to Jared Allen. I could also see him going to New York, but I'm going to say my prediction is he goes to Brooklyn? He's not going back to New Orleans. We know that much 14 another huge question mark here's Al Horford. So", " Horford follows Zion and Jrue Holiday today on Instagram and everybody flips out there like, okay. Well, that's where he's going and then Stein just takes everybody's thoughts and squashes them like a bug and says, he's not going to New Orleans like they're not they're not that interested in. He's not that interested. That's not the team. So Horford New Orleans, nope, Horford to Sacramento apparently not they're looking at Dewayne dedmon and looking at other options now, so I don't know what I'm here for.", " An end up in I would not be surprised if whatever that team was that offered him a hundred twelve four years is not offering that up anymore. And he's going to start falling through the cracks a little bit. That's kind of my prediction is he comes closer to maybe 90 million and if that's the case, I mean sign me up in Dallas. I know I've said that about me and players by now, but like Horford's definitely one guy, I would definitely give about that much for I would I wouldn't do the hundred twelve million personally. I don't think I could do that. I couldn't stomach it but", " I don't have a good prediction. I truly don't.", " I would love for him to go to the east because I think if he goes to New Orleans that is a potential playoff team if he goes to Sacramento that is a already a play a potential playoff team and maybe that pushes them over the edge. So just stay away from the West unless you're coming to Dallas for less than a hundred twelve million Al Horford. That's my advice to you boy on bogdanovich. He could honestly do so many different things and it wouldn't surprise me. I'm still going to predict he goes back to Indiana, but now", " Now the Utah Jazz are showing really really strong interest which is super interesting to me and would actually be a great fit kind of actually now that I think about it what it'd be a great fit because like boy on and Joe Ingles like they're not the same player but same position same size like hmm.", " I don't know that be a good fit but I think ends up in Indiana. Anyway, I think he goes back there. He gets a little overpaid. That's okay. I've seen people throw around him in Dallas. I'd be fine with it. But if we're given boy on bogdanovich more than 15 million, which I think is what it would take then I'm kind of not so high on it Brook Lopez, we're getting down into I so I think we dropped off quite a bit, which actually there's a name coming up that should not be this low, but stay tuned and is also named coming up. That should not be", " Hi Brook, Lopez number 16 on Hoops, hype top guy got 200 players on here top 200 free agents. We're gonna I'm gonna end this with going down to 200 and see if I can make any predictions with these last guys. So if you don't care about that, I'm saving it for the end, but we're still going through important players and there's someone haven't mentioned that you're going to want to stay tuned for hint hint his name rhymes with his name rhymes with Ash Malcolm's from Ogden. So stay tuned Brook Lopez 16", " I fully expect him to go back to Milwaukee. I hope he does. I want Milwaukee to run the East next season. I love Giannis antetokounmpo. Even if he's never a Maverick I will always cheer for him. He will always be or for now. He is my favorite non Maverick yanis has and Brook Lopez compliments that team perfectly. So I hope it goes back there. And I think he will that is the name that shouldn't be this high on the list. And when you hear this name, it's going to make your stomach twist and turn and it's going to", " Q probably want to turn this podcast off just because it's of his name not because of Any of my thoughts on him because I think we share the same thoughts. It's DeAndre Jordan the", " really just the guy that got us kristaps porzingis. That's the best thing he ever did for Dallas. Great. Double-Double guy. Not a Defender that anybody expected him to bee Colony. That was a nightmare man watching him play Help defense was like the most beautiful thing in the world like just try dude. You didn't try even a little then step up at all.", " I loved some of that like early on. Oh my gosh, the first 10 games that he was in Dallas. I was ready to sign him do an extension. I want to sign him to a big deal, but it took about 10 more games after that for me to realize. Okay. This is not the DeAndre Jordan we signed up for in 2015. Whatever your that was. This is washed up DeAndre Jordan. I think he goes to Houston for the mid-level exception and", " And yeah, I think it's gonna be I think it's going to Houston. Maybe Los Angeles Lakers maybe even", " No, yeah. Those are the two teams I'd say Brooklyn is also a great option for him in all honestly don't really care where he goes. Thanks for hey, dude, thanks for thanks for Lending us kristaps porzingis. You're a real one for that. I guess number 18. This is the name. That is way too low. Like, let's see how many spots had. Okay. So Malcolm Brogdon, this is who were talking about here at 18th Malcolm Brogdon. I'll give you my predictions and my hopes here in just a minute, but I want to look at how high how much higher I'd put them.", " 18 on Hoops hype list. I'd put him above DeAndre Jordan. I put them above Brook Lopez.", " I put them above Julius Randle.", " Hmm. So that's at least three spots that I'd put them above. I'd put them above boy on bogdanovich That's for so he's about four or five spots to load my opinion. I'd put them above DeMarcus Cousins, but I know a lot of people would disagree with me on that but I would I really would so I'd say five spots. So he's at 18 right now on this list. Of course again, let me reiterate. This is not my list. This is Hoops hype list of top free agents available Malcolm brogdon's at 18. I put them up to", " Teen personally, I know he's restricted that makes him tougher to get but that doesn't change the fact that he is a more ready to go type guy than some of these players and and can really offer a lot more than some of the players that are listed above him like DeAndre Jordan. The dude's cheeks his cheeks defensively offensively, whatever.", " So here's my prediction on Malcolm Brogdon ready?", " I think he's gonna be a Dallas Maverick.", " I truly believe he will be a Dallas Maverick.", " I'm not going to be surprised if he ends up back in Milwaukee if they match something, but I think there's a very realistic chance to Malcolm. Brogdon will be a Dallas Maverick by the end of free agency. I think it's going to take about 25 million dollars and I want Dallas to Pony up the dough so I know you just heard I'd say I know you want Dallas to Pony up the dough. Yeah, I do. Okay, and I know a want is not necessarily a prediction but", " I think Dallas shares a lot of the same feelings. I think they're really high on Malcolm Brogdon and for a little while. They thought he was unattainable, but now it's becoming a little bit more likely that he may be attainable. And if he is we should attain him like besides the injuries. There are almost no downsides to Malcolm Brogdon. If you asked me besides the fact that he's probably going to get overpaid because it's restricted but to Let's Do It, come on Dallas. Come on give me that.", " Brogdon 25 million, that's my prediction. I also won't be surprised when he's back in Milwaukee next season. Sorry. Nah, just kidding not kidding though.", " So let's run through a few more of these Danny Green. I think it goes back to Toronto JJ Redick back to Philly Harrison Barnes is going back to Sacramento. That's almost a done deal. Then they got Mirotic we are you know, he's doing Marcus Morris as a name. I'd watch out for for Dallas if he slips through the cracks, but I think I'll be back in Los Angeles or he'll be in Los Angeles because he's a clutch Sports client, which to what a nightmare would it be to work for clutch Sports except not really because I bet they'd pay incredibly well Jonas Valanciunas", " Is a name I would love for the maths look at but it's not going to happen. He's gonna go back to Memphis on a pretty nice deal to he made 16 million this past season opted out so he's probably gonna get like 20 million, which is kind of nuts. That is young kind of surprised. He's at 25. I thought he'd be a little lower than that. But I love that. He's young. He's a great hustle player. Great veteran defensive. Anchor. I think he'll I think he's gone. I think he's out of Indiana. I just don't know where he goes. I don't have any good predictions.", " They're actually him going back to Brooklyn would actually be perfect.", " That would be nice Jimmy. You should be a jam. Thanks. Jimmy Rudy Gay. Wow. I don't know where the heck Rudy Gay is gonna go hit a nice season though this past year thirteen point seven points per game 6.8 rebounds 40 percent from three. It's pretty nice. So he made night out of 10 million this past season. I don't know what he's going to make this next year Ricky Rubio who", " mentioned and connected to Dallas a little more than I think Dallas fans would like but", " He's going to the Pacers. That's like film like a done deal. If you ask me Derrick Rose is going to Detroit in the most random move of the day, but dude if Derrick Rose's healthy and Blake Griffin's healthy and sacred Umbria, which bro, I love saku-dono Booyah like great draft pick by the Detroit Pistons number 15 overall steel mark my words. That was a freakin steal at 15. Yeah. So if he's healthy, it'll be fine.", " Means you get the mid-level at two years I would expect because Detroit literally has nothing else to offer 29 al-farouq aminu. I want him back in Dallas don't know what kind of money he's going to get though. He made seven million this past season. We'll see what he can do this offseason in free agency. Willie cauley-stein at first I was kind of like, yeah, I take him in Dallas and then I was like, you know what Kings fans don't even want Willie cauley-stein in Sacramento. So I'm out on Willie cauley-stein enes Kanter.", " After Boston, maybe maybe he goes to Boston. I think that makes some sense not an option for the Mavs Terrence Ross is all the way down here at 32.", " Definitely got to keep your eye on if you're a Maverick fan wink wink definitely got to keep your eye on Terry Rozier probably goes to New York on a one-year deal elfrid Payton. I don't know and then 35, it's Patrick Beverley. This is the last name. I'm really going to look at here before we go down all the way down to two hundreds and I'm gonna start to read off some names and see who you do and don't know 35 those Patrick Beverley I have", " I have a lot of confidence that he's going to be a Dallas Maverick. I mean, I am almost ready to buy my Dallas Maverick Patrick Beverley Jersey for next season because I truly feel like he's going to be in Dallas for at least the next three years, but it's in be a free agency and literally Anything Can Happen literally like sources are wrong way too often. So don't be surprised. Yeah, you know, I won't be surprised if all sudden someone comes out and randomly is like a favorite tool and mmm", " But I think we are the favorite weaving the Dallas Mavericks and I think he will be a Dallas Maverick by the end of the season or by the end of the fridge and see period so we're going to scroll all the way down here on hoop side down to let's see how many down they go down to they go down to 199 96 players. So I've taken some off because some guys have", " I guess been picked up or something. I don't really know. I don't really know who they took off because I know they had at least 200 not too long ago number 196 on their list is Edmond Sumner.", " Edmund Summers restricted point guard for the Indiana Pacers 2.9 points per game one point zero rebounds per game Hoops hype explains him as a multi-position a ball handler with good defensive effort. I actually know Ed who Edmund Sumner is", " don't know what he's gonna do this summer, but he's restricted free agent for Indiana. So he's probably going back man. There's some names down here 192. They have Mitch Creek a Dallas Mavericks. Summer league Legend crack the top 200 above Shabazz Muhammad Alex poythress and PJ Dozier, huh? Good for Mitch Creek. It's a big a big accomplishment there at 190. It's Udonis Haslem throwback to when he almost", " Signed a deal with the Dallas Mavericks and then he didn't because he went back to wretched Miami see some other notable names down here former Dallas Maverick. Great Jonathan Motley former Dallas Mavericks summer league Legend Brandon Paul and at 187 former. Almost Dallas Maverick Ty Lawson in at 184. Let's see who else we got down here. Oh Dallas Maverick Legend Zach Randolph in it. 179. I think it's time for him to retire. But hey.", " Hey had a great time here in Dallas. Wow. There are some names Ben McLemore. Tyler Zeller Swaggy P. I can't stand Swaggy P after his comments. He made on JJ Barea not to stress. If you want to know what those are tweet at me. If you don't know the JJ Barea comments by Nick Young is ridiculous. Still makes you that even though it's like two years ago. 162 is Cameron Payne the next map summer league Legend. He's going to be on the Maverick summer league team this next year.", " and", " I can't believe he's actually the summer league team Quincy Acy at 1:58. Another Dallas Maverick guy who man I had such high hopes for him never ended up being much for us Carlisle just didn't plan that off and Jose Calderon who of course Help Dallas in that San Antonio Spurs playoff battle is down here at 152. Now. I'm just kind of looking for former Mavericks that are at the at the bottom of this list and kind of see so Kimber chin at 1:45 is a restricted free agent for the Orlando.", " Magic, he's a guy I would I would keep an eye on if things kind of go south with Max ich liebe and some other big men in Dallas. I like him, but right above him is checked Diallo and it seems like check Diallo to Dallas is basically a done deal according to Tim McMahon. He didn't say that but like he makes it become more and more clear that he would not be surprised if he is in Dallas.", " Keep scrolling through here Raymond Felton is entering free agencies at 137. Shane Larkin is in at 135. Cos Shane Larkin. We all know what he's famous for Tyson Chandler and at 132 is an unrestricted free agent. He will not be making another trip back to Dallas as much as I know. We would all love it. I think he's over getting cut and re-signed by Dallas Devin Harris. Okay now that we're talking about this.", " Let's talk about current Mavericks free agents.", " Because I like we're 45 minutes and you guys are already invested. So here I go on current Dallas Mavericks free agents Devin Harris in at 131", " and I don't know how I would feel if we signed Devin Harris again.", " I love Devin Harris. I always will love Devin Harris. I will always love what he did here in Dallas, but it's time to move on. I'm going to be a hundred percent honest, even if it's for a like a minimum contract like", " Give that minimum contract to somebody else. It's time. Okay, give the minimum cut like JJ. Barea is going to be back. He's another free agent which by to make a prediction here on JJ Barea and this is", " I don't want to say too much, but I have a good feeling JJ Barea could sign a one plus one type deal. If not, a two-year deal and retire after that. I think he's got two years left in them. That's just my my assumption which anyway so current free agents Devin Harris time to let him walk because look we have JJ Barea. We have Jalen Brunson. We might have Patrick Beverley and if we're going to give a minimum contract to someone that's a free agent for us.", " I'd almost rather that's a guard I'd almost rather give it to Trey Burke from being honest, which is a name that the Mavs like Mass hands aren't talking about bringing back, but he had some nice run for us and he kind of got buried but that was kind of because we still played Devin Harris some so yeah, I love Devin Harris, but I'm not really going to be excited if we bring him back because it's just another roster spot to a 36 year old guy another Maverick free agent.", " So I'm going to run through the list here. And this is how we're going to wrap up. Okay, kristaps porzingis. He'll be back JJ Barea again. He will be back. I think he's back for I think he's playing two more years in the league and I'm a very excited for it. Devin Harris. That's the name. We just talked about don't really he might be back in a coaching role, which I would be hyped about Trey Burke.", " Not going to be back, but I think he did play his way into a nice contract. I think he I think you should get at least the mid-level right? Maybe possibly I don't know Dorian finney-smith. He's a restricted free agent. I hope he is back. Now if we have to release his cap pulled to go sign. Someone not going to be super mad, but I wouldn't be happy about it. I want dodo back. But also are we going to be surprised when he goes and joins in Smith Jr. New York because", " The Smith way Never Dies Max ich liebe. He should be back. I'll be upset if he's not back. I really will and I'm starting to get worried because it seems like a lot of teams are all the sudden talking about him. A lot of fan base is already talking about him. I don't like that. I want Max Cleveland back bring him back. I don't know what he's going to cost but sign up for just about what everyone's I think it'll be like six to eight million, which he's more than worth that and then it's Kostas and Dale Makin their on two ways, so they will be back in Dallas.", " Wow Let's Talk 450 straight freaking minutes as a lot of maps content. So it's free agency time. Sweet me all your thoughts opinions questions comments concerns. Tell me what you liked about this podcast. Tell me what you hated about this podcast. Tell me what you want to see the Mavericks do today today to freakin day and NBA free agency. Thank you guys. We'll talk soon."]}