{"showID": "0a0jLPxKIjaDYUaZPbhsWO", "show_name": "The Hawg Talk Podcast", "show_description": "Jacob Davis,Ty Hudson, Porter Hayes and Kyle Sutherland come to you weekly with the biggest news in Razorback sports. If you like our show hit that subscribe button and share us on social media!  Support this podcast: https://anchor.fm/HawgTalk/support", "episode_name": "The Hawg Talk Podcast", "episode_description": "Jacob Davis,Ty Hudson, Porter Hayes and Kyle Sutherland come to you weekly with the biggest news in Razorback sports. If you like our show hit that subscribe button and share us on social media!  Support this podcast: https://anchor.fm/HawgTalk/support", "transcript": ["If you haven't heard about anchor is the easiest way to make a podcast so hear me out. It's free. My father-in-law always says the only thing better than cheap, it's free. So take advantage of it. There's a creation tool that allows you to record and edit from your podcast right from your phone or computer anchor will distribute your podcast for you. So you can be heard on Spotify Apple podcast and all the podcast platforms out there. You can make money from your podcast with no minimum listenership.", "Is everything you need to know to make a podcast in one place? So download the free anchor app or go to Anchor dot f m-- to get started.", " Thank you for tuning in for another episode of The Hog talk help us get our message out by subscribing on Apple's Spotify Stitcher or your preferred podcast platform. Once you've subscribed be sure to share with all of your fellow hog fans on social media.", " Razorback Nation, welcome to the hog Talk podcast. This is Jacob from the Hog Pen dotnet and tie from picture on network on YouTube. Thank you for all our social media followers for helping us get to 4,000 followers on Twitter. Thank you guys so much that that is something we've been working hard on for a little while 4000 doesn't seem a lot but I want to tell you four thousand will help you grow much much much more in faster than than what it was on the way up the hill so tonight our special", " Ask is sports and culture your supporter Hayes. How you doing? The not order?", " Good guys, like hell for having me on it's an honor to be willing with y'all. Hey congrats on that 4K. I know y'all been grinding and doing all sorts of stuff. So hey 4000 the it's a big deal. Oh, yeah absolutely taught man. It's been a busy week. Yeah. It's been crazy been a crazy week for sure. A lot of lot of lot of stuff going on with with certain folks on Twitter getting their information wrong. And then of course, Arkansas had a commitment for the", " 19 class that's a big deal. Excuse me, 2020 class rather. That's a big deal. Absolutely. Yeah. So this this covanta hey Dixon, Todd tell me about him. He's the next commitment in the 2020 class for the Arkansas Razorbacks. Well athletic kid 6-foot roughly around 6 foot 6 1 somewhere in there a hundred eighty pounds out of Carthage, Texas for this 2020 class. Not a bad pick up for the Hogs. Looks like they're going to play them at running back. I think I think he'd been kind of noted as", " someone who could play multiple positions on offense, but obviously Arkansas needs to rack up some depth in the backfield. That's what they're doing. He has some pretty decent offers Baylor Colorado Houston. He does have some in state offers from SMU TCU and Texas along with Oklahoma State. So Jeff trailer was his lead recruiter and it's obviously a big pick up again, you know you and I have talked quite a bit about what they need to do at the running back position alongside filling up depth at the linebacker.", " Fishing along the line of scrimmage running back is certainly a position that they need to they need to fill out as well. But he committed on none other than July 4th show how it works. Yeah, baby, nothing nothing wrong with a little extra fireworks on the fourth of July. But again, he picked supposedly he'd pick targets All Over Texas, but I think I think Texas was his runner-up and TCU after that so raised it back pains. You can go on our Facebook page Arkansas hog talk or you can go on Twitter and", " you can click the link to the Hog Pen dotnet and it will send you to the video which go bhante Dixon's humble and watch this guy. This guy has speed he has agility. He's quick Shifty elusive in a guy. They just can hit the edges Arkansas have struggled over the past maybe four or five years finding guys that has the edge speed. I was watching videos of Darren McFadden Felix Jones The Glory Days of Arkansas running backs.", " Nowaday, this Cedric cops guys that had this feed not only to hit the hole up the middle, but they had speed to get to the outside and this is what kalavati Dixon honestly brings the Razorbacks. I really like this kid. I'm really high on him. I think Arkansas really got to steal out of this one out of the state of Texas. I think he's rumored. I don't know what his official 40 time is I don't know if it's been laser timed or not, but I'd heard it somewhere around mid to high for for maybe a low four five.", " I've he's apparently a pretty big. He's a he's a track star. He's you know, he's an athletic kid. And like you said they need someone who can hit the outside hit that outside edge, especially in this offense. So it's yeah, it's a big addition as far as you know, when you talk about getting outside edge Runners at the running back position. This is a good place to this is a good place to start with this class as far as you know, the running back position and getting someone with that kind of speed and let's not forget. This is the eighth commitment.", " State in the state of Texas from The Arc for the Arkansas Razorbacks this year. That's huge. And this is the I think this is the first set of teammates for this class. If you remember back into the class of 2019, I mean there is three or four sets of high school teammates. This is talkies Crawford offensive lineman commitment the highest-rated offensive lineman and highest rated player on the board for Arkansas this in this class. So come getting Cobalt a Dixon's a big deal.", " It's commitment number 11, correct? And that right. Yes commitment. Number 11. Yes. So there are you know, we have the we've got the barbecue bash. I don't know what they're calling it this year. But you know, they're going to bring all the recruits in for the barbecue at the end of July. I think it's the 26th. They could they're actually on a dead period between June 24th until July 24th. We know that I'm expecting some pretty big news as far as who's visiting on that for that Barbecue on the 25th. So hopefully we'll know a little bit now recruits can still talk to people in the", " Media, they just can't talk to coaches during that Dead period so maybe maybe we'll get more news the week leading up towards towards the barbecue but I suspect you know, July between July maybe like July 23rd through the 25th will start to hear more and more about who's coming up for that for that barbecue. But I do expect you know, and I hate to do this. I'm not that's not really who I am as far as they're going to get a commitment on this date, but I feel like going into that barbecue or at least coming out.", " Of it. They're going to they're going to grab at least a cup a commit or two out of the out of the barbecue for the razor bags. Right? And so I mean, it's me and you were talking about this the other day Porter about these guys. Would it be better to get commitments going in or would it be better to get commitments coming out of the barbecue?", " To me, you know just coming out because I mean you don't know if you're building those relationships, even if it is something like a barbecue, you know, something the bond and all that. They might get a better feel of the teammates around them as people because a lot of these recruits there used to just doing these camps and all these Elite Camps and they just know each other on the field as a competitor side. So you get them in there coming in doing these barbecues doing this and you get a see what the coaches are like so", " Anything coming out to me is like man that they really got something out of that. So that's where I would lean towards absolute. Ah, I'm the same way. I to me. I mean I commit to commit I'll take them before or after but I you know Porter's right, you know, it's it at least shows that the the that event is successful and we saw it last year you and I have talked about that quite a bit Jacob the amount of commitments. They had immediately following the barbecue.", " In that in there doing it again this year. So I think it shows more success or something for these recruits to kind of look forward to you know, the future recruits like who I don't know what's up with this camp, but it's obviously changed the mind of some other players and it kind of creates that fan hype something that we can all kind of latch onto before the actual season like, oh, wow, we've got a barbecue coming up. That means we could maybe expect some commitments but for for what really matters as far as", " You know as far as looks and for people on the outside kind of looking in on what that thing is all about, it looks better when you've got guys committing after because it just it just shows that this thing is working at this barbecue is a good idea and obviously if they're not committing period then they'll scrap it and I'll think of something else and maybe they won't do a barbecue. Maybe they'll do something else but so far, it's been a it's been a success and I don't as long as Chad Morris is here. I think they're going to do it every year and I think it's going to continue to be successful for sure.", " So guys that are going to go into this barbecue. Who do you want to see come out as commitments?", " Hmm. Well look I first off linebacker position for sure. I don't care who it is. We all know who we all know who we want the certain for star player out of Memphis. I would sure like would sure like to commit but they need to they need to hit linebackers and I still believe offense of line if they could get another offense of lineman or two. I don't know the four-star lineman that they're in on I don't have his name up. I'm forgetting it.", " Garrett here in Jesus. Yes. Yeah. I don't know if he's coming to this thing or not. I last I heard he wasn't but if they could get him to come to this barbecue and then I don't know. I feel like he's an inch away from announcing his his announcement date and I feel like it would be Arkansas, but I wish they could get him to that to that to the barbecue event. But yeah to me, it's I'll take whatever they can get out of this thing, but I would certainly like for a linebacker or two to come out of this with a commitment to Arkansas.", " Sure, so go ahead and Miss Gibbons given over here to the Adrian how it's how you say it War Janowski. Is that how you say his name from ESPN? Yeah, Adrian wojnarowski from he's the ESPN Insider for NBA. So tell us a little bit about this time. He so he put out a tweet a little while back about Patrick Beverley and on how he left and it said that he was exiled from the University of Arkansas and", " I did do a video on this last week sadly it was my only video of the week is Fourth of July was crazy that entire week. It was just nuts around here. I don't know about you guys, but when you got two kids and and you know relatives all want to stay the night and you know can't and all this stuff going on. It's kind of hard to pump out more content, but I was really glad I could get that video out and kind of show like this is this is wrong like what he said was wrong and this guy has I don't know. He's got millions of followers on Twitter and he said that you know,", " Patrick Beverley was exiled by the University of Arkansas to the Ukraine over in Europe. And that's not true. He was actually if I remember correctly and don't quote me on this, but he had ran into some trouble before the incident of another student doing his homework for him. Now, that's been I mean that's been a decade ago that's been a long time ago. And since then he's been great in the NBA is one of the best defensive players in the league, you know, Arkansas still claims him as one of their own we still claim him as a Razorback you always", " I will be once a hog always a hog, but there's obviously that kind of Separation there and and I guess Adrian here saw things a little bit differently and it didn't happen the way he says that it happened and I was really happy to see hog fans reply. Danny West actually who works for 24/7 sports.com with Trey bitty call them out and said that you know, that's not how it went down at all and call them out and then a bunch of other hog fans followed and who remember that", " Remember what happened with Patrick Beverley and his final days at the University of Arkansas Patrick. Beverley even said that he owned the the mistake that he made he paid the price. He admitted that he had done wrong and he chose to leave the University of Arkansas the you they didn't kick him out. I think if I remember right actually they had asked him to take the year off. I think they're going to use a red shirt on him because he was an SEC who's all SEC freshman. Hmm. He was second-team all-sec as a freshman. I mean, we all were expecting", " Big things this was a pretty big blow back then to lose Patrick Beverley. So they wanted him to just sit here out as part of his punishment. He decided to go to Ukraine. That's not that's not getting fired. That's leaving your job because you know, they were dishing out punishment for something you did wrong. So there's a difference between getting fired and quitting and he left and I don't blame him. The guy was I mean, there's no doubt. He would have been a draft pick. I don't know how high I can't remember his projections back then but so yeah. I really I was kind of", " That always bothers me when people especially someone who works at ESPN and calls themselves a quote unquote. I mean, that's what he is. That's his job. He's a NBA Insider and he has the watch pod, you know, the NB a podcast that he does. So if you're going to sit there and just blatantly lie about a situation or at least you have an uninformed opinion when you work with ESPN and you've got millions of followers, I think I would probably at least", " back up what I have with facts and with you know, if I'm going to make a claim like that that I need to have fat and he did he didn't have any facts he was wrong and he didn't delete the tweet and I didn't expect him to I mean, who are we, you know as a hog fans calling him out. I mean he doesn't care but at the end of the day, I just wanted to I want to bring that to the light and I'm really happy again to all those hog fans who responded to his tweet and call them out. I loved it. I loved every second of it well and you know with him, you know, he's trying to build a store in a narrative.", " I thought it was and he was wrong for it. I'm not trying to justify but you know sometimes ESPN they get so caught up and look where this guy come from and look where he is now and he just he threw that narrative out there and he got called out on it's what happened. And yeah, like you said Danny West was straight to call him out. So hey that ain't what happened. So we get so caught up in these stories and the Rinaldi and woes and all these people just you want that feel good. You want that feel-good story and I think that's", " He was doing and it backfired on him. That's exactly what it was. And I don't I get it, you know, you want to build up this maybe not hero mentality or backstory or whatever, but you want to build them up as something and I'm not saying the Patrick Beverley isn't deserving of what he got with his contract because that's what he was. That's what he was referencing. Was that big contract that he got and that's great. We're all happy for Patrick, you know, we're all ecstatic for him and excited to see what he can do with this new contract. But yeah,", " It just I just wish they would get things like that. Right and that kind of it's a it looks worse than it really is when you say things like that and it kind of paints this Narrative of well Arkansas is going to Arkansas has Pinto says on Twitter all the time on the hog hog gonna hog, and and it kind of paints that narrative and pintos right Hogs certainly do that. They're capable are certainly capable of tripping over there their own feet, but that was certainly not one of those situations where that", " and this was this was something different where Patrick Beverley broke a team Rule and and it was asked to sit a year out. He was not exiled and he chose to bounce to Europe little it puts a blemish on the story. I mean it I mean like Patrick Beverley he is well deserving and he is one of the best defenders the NBA's had in a long time. I mean lockdown and for him to say that and it kind of takes away from Patrick Beverly's journey to sit here and and say something like that and it comes out.", " Also, it's like man. What was he really come from need you really aren't it? But that dude on the court has earned everything he's got he is he is tenacious. I love his attitude like his his mentality. I he's just Fierce man. He's a warrior. He's got that 90's mentality of an NBA player, you know, he's willing to get down and dirty and he's going to get in your head. He's just such a good Defender to like I really like him and I hope he continues to I mean, look, he's he drew this huge contract now I'll", " All I want for him is to get a ring. I'd love for him to get a ring in the NBA and I think I think they're capable of doing it. So, oh, yeah, definitely. I looks like that video. They showed of him entering the that summer league game and they're talking about how he's already locked in ready to play the Lakers and that some early game. I saw that that was he looked like Deontay Wilder going in there already ready to fight. I love that man. I love it when athletes as long as they don't take it too far and they like try to live it.", " We beat the crap out of someone. I like it when they bring that that chip on their shoulder because that's that. I feel like that represents the state of Arkansas. Like we all have kind of a chip on our shoulder because we're so look down on whether you're talking State just as a state or as a university we're or everybody's little brother or whatever you want to call it. We just have this chip on our shoulder and I love that. I think Patrick Beverley he captures that man at that next level. He just he's ferocious on that court and I like he's fun to watch to he's entertaining.", " Heck of a defensive player when it is one of the most he's mr. Excitement. He may not be mr. Excitement and offensive prowess, but man defensively guys locked down. I actually agree with that. So Razorback fans just make sure to go and subscribe and rate our podcast get our message across if you're enjoying the show, pause it right now get there. Like if you liked our if you like our podcast make sure you get in there and subscribe.", " Now shared all over social media helping to helping to get our message out. You can listen to Spotify. You can listen to it on anchor you can listen to an Apple podcast Google cast and I heart radio. So make sure you get in there right now. Yeah, subscribe and share it all over social media. So guys real quick. Turn the scrip. This is something I want to ask Porter real quick. It's a it's about team Arkansas TBT what's going on with that man? It's one of", " of those things that streaming big on social media Keith Kelly as it going in the right direction right now, but where's the attention coming from with the with the University of Arkansas right now? Why are they not giving out anything that I don't know. I wish that they would because man Arkansas such a unique State and not only do we hold on to that. Like you said once a hog always a hog so, you know once these players and they have guys on their", " Ronnie Brewer, you know Al on does Harris, you know Kareem reads one of the coaches, you know, you all these former stars that used to play for Arkansas or on this team Rodney Clark. I mean, I know he was just there for a couple years and then went to Butler but he's on the team so, you know, they're having this scrimmage open scrimmage you like Teeth Shiloh Christian high school. So I mean you're out and about Northwest Arkansas man, definitely go up there in a and watch the scrimmage and get to meet the players.", " Yes, but uh, I don't know and we've I've talked to you know, Keith a lot. I've really followed the team and its really got me excited about the tournament. It's a two million dollar cash prize that you know teams just formed their players and it's fan-based, you know, if Ryan get so many followers they let you have 1/10 roster spot, but Arkansas is alumni team. So to be an alumni team you have to have at least seven players on your roster that went to the U of A.", " and so they're the Arkansas alumni team and", " They it's from what I've heard. They've just gotten some negative feedback from the U of A and basically telling them not to to contact their alumni boosters. And you know, if everything they want everything to go centralized through them and to me I they're missing out on a huge opportunity to you know, for these players that are playing Auntie markets on TV T to give back to the Razorbacks and I know it's a business but like I said,", " You start giving back and you start supporting a team like this. It's going to speak volumes to the players that are playing for this prize and they're going to be like man. I'm going to start doing some camps and keese even told me that they're trying to get you know, they're trying to get to her Fayetteville could be a host site. That would be huge because this thing is is Big Time on ESPN. Yeah, and the guys like I said, they're playing for two million dollars. So, you know, you're going to get the best out of these players. It's not just a pickup leak. It's", " it's legit, right?", " So what was Sports and culture? I've been following it for a little while. Let me get a little background here on this. So the other day I know this isn't Razorback related, but you guys got a little bit more credibility going on now with with your sources and connections that you are building with the NBA and that and that part with Tyler. I saw where you guys were in on Kevin Durant story.", " Wait a week before ESPN getting in on it. But you guys were plugged in and you're getting stuff going right now. Tell us a little bit about what sports and culture is all about Fortune culture man. We're just trying to be that small small dog that tries to follow things that other people aren't following and you know Tyler man, he's done an amazing job. He gave me, you know my shot in this in this business and doing podcast and being able to write articles and spread the, Arkansas love.", " Out in the east coast out there in South Carolina and minutes all due credit to John, you know, Mike Neighbors in you know, the ladybacks because when they had the SEC women's tournament out there that's what sparked all this. He wanted some inside information and I reached out to him and you know, we started connecting then I started writing for him. But man, you know, we got this, you know, we got these sources and stuff and it feels really good when you know that all this hard work and you're breaking things on a Thursday and they're talking about it on first.", " Take on a Monday. It's just really it's really cool for small-time guys that are getting contacted by an ESPN Outlet in La. You know, where did you get this contacts? And though? Yeah, I broke the Katie story. They actually broke the Magic Johnson story before it come out and you know, they were that was on Friday and they were talking about it on Monday. So yeah, we're proud we're getting some credibility on the MBK side. So it's really exciting.", " It's not easy. It's not easy to do and as someone who's had a YouTube channel for two years and you know been on this podcast, it's not easy to break through as a little guy and I mean we're small and you know the hog podcast cell has over 4,000 followers and we're still in the grand scheme of just the SEC were were itty-bitty were tiny and it's so challenging to grow and you guys over at sporting Sports and culture doing a really good job of breaking those stories early.", " Getting out in front of everyone even the big dogs. That's a that's a big deal. That's pretty cool. I think the biggest thing is, you know, nobody wants to be wrong because you seen you know, what happens when if people comes out with a hot take and they're wrong they get blasted. I mean, look at that guy, you know, Trey shaft, he broke out that store and they blasted him and it ended up coming true. So everybody was crawfish and you know, so I mean that's I think that's the hardest thing when it comes to you that up and coming.", " As you're afraid to have that hot take your afraid to say you have a source because everybody's got a source nowadays. Everybody's got a source. Oh my gosh. Everybody's got a source. Everybody's got a podcast and that right Jacob a cure your right and your mama's got a podcast to so partner. Nothing wrong with that though. It's good. No, not at all man it just because it's getting crowded doesn't mean it's there's not enough information out there for everybody. That's right. There's always that's the thing when you start printing receipts and you start showing that that's what really", " Got the traction, you know when Tyler was Post in the stuff. He was you know, highlighting those timestamps and those what I call receipts that proof and that's what really started steamrolling because when you're seeing on July 5th, he's posting this and then it comes out on the eighth. You know, that's where you get that Traction in that credibility because they know you're not just throwing those hot takes your print those receipts off along with what you're talking about, right? Yeah just backs up what you're what you're", " And like you said, it's just a time stamp and it shows that you guys hey were there first, you know, we live in a day and age to wear being first seems to be what matters the most and it's something Jacob and I have have to work on like we you know, we try our best we want to get stuff out there. But you know, you don't want to claim sources because everybody's got sources and that becomes kind of a cliche buzzword. I've got a source so and so at the athletic department, you know, it's it just gets kind of I rolled every once in a while, but you know, but it's true though, and if", " Can get out there first and you can validate what you're saying and you can back it up with timestamps and in proof then hey, you know, you're going to be you might be recognizing you might blow up and that's just what this is all about. Social media is a tricky tricky mistress. It's really it's really a challenge to get right and you know, I applaud everybody who finds their own way in this arena for sure. Well, I still swear the John Green's wearing a red top. So and that is, Dylan, Arkansas.", " All or Mike Gundy. I mean his his mullet was with shade and pointed towards the north to Fayetteville. I mean, obviously obviously he's coming to Fayetteville to be our next football coach and then out of nowhere. It's Chad Morris. Yeah. Oh, yeah, nothing wrong with that because I love Chad think he's going to be easy to do some good things at Arkansas, especially right now with recruiting recruiting is doing well coming off a two and ten season. So I mean it", " Going to it's going to get better basketball teams is going to get better better baseball team is just in the middle of a dynasty building. They haven't won championships yet, but they're on the cusp of something great. That's that was a question that I thought you and I and we're not going to talk about in depth here because obviously we still got it. We got to get to the questions that were asked to us on social media, but I was going to ask do you consider? Maybe this is a good pole for us to put out this week is Arkansas blue blood or can you be a blue but blue blood in college baseball without that ring without a champ?", " Chip bring and look, you know, what's his name it D1 baseball. Do you want to make small.com has Arkansas pegged to make the College World Series again next year. Yeah. So I mean three years in a row. Let's say that happens. Are you a blue blood or not? Whether you win a ring that that I think that'd be a really good poll to ask everyone on social media. What do you guys believe they are probably are because man, it's so hard. It's not we got to think this is the only sport that they play a series, you know, yeah, you got a tournament but when you get the national championship game,", " Basketball it's one game. Yep football. It's one game and baseball is such a technical sport that Anything Can Happen your picture has a bad day or your reliever has a bad day or your star here, you know one guy has a bad game. It could throw your whole rotation in your lineup also. Oh, yeah right now and this is and I kind of hate to kind of compare it to football, but it's kind of like with me and being a Clemson fan is Clemson and their success.", " Yes, are they a blue blood in my opinion? No, it's recent success. Now, they're going to have to win a couple more national championships to be considered a blue blood are they in the LEAP program now? Yes, but I think in the case of Arkansas, yes, they are that blue blood program because they are getting kids to come from all over the country to come play and not get a full scholarship. You're not getting these full rides. You're getting kids from California to come.", " Play for partial scholarship. So yeah, in my opinion they are yeah, I mean they are I think their household name and you know, we don't pay attention to high school baseball recruiting Because it's It's Tricky It's Tricky. You don't know when these guys if they sign with a with a major league baseball team if they sign a contract to go play in the minors. It's hard to follow and if you get them on campus, obviously that's a big deal in Arkansas. I mean their household name and high school baseball their household name in college baseball and so they have that reach", " That they don't right now in any of the other sports maybe outside of track, but I'm not even touch on that because I'm so out in left field when it comes to track. But yeah II personally think they're a Blueblood in baseball even without that Championship whether they make the calls World Series this year or not. Well, here's my biggest take on it. And I think this is what with Vanderbilt and Arkansas what they've proven over the past couple years. They are changing the narrative on what you pointed out of people coming to coming out of high school and going to the", " Prose or come into play college you do get treated like kings when you come play a sec baseball you're playing in front of 10 to 15,000 people. You're getting three meals. You're getting all this nutrition. I think Arkansas and Vanderbilt is starting to change the people's eyes of maybe I want to go play for years at a college baseball and gain it that way because look at Ben and 10d, you know, he paid his dues at Arkansas and now he's already in the big leagues.", " Opposed to these kids are coming right out of high school and they're wanting to go do a major league grind. I think that's really helping. Yeah. Yeah and Isaiah Campbell's a good example to someone they were able to turn around. I mean coming into this year. We didn't really know what we had with Isaiah Campbell. It's easy now to say, oh, yeah. I mean look, he was great. Look what he did, you know in one season but coming into this year. We really didn't know he wasn't he was a looked at as someone to be drafted as high as he was and he came back his junior year his third year.", " And he definitely got a bump in the in you know in the Major League Baseball draft compared to where he would have been a year ago because he was eligible last year if I'm not mistaken. So in my opinion the uncertainty of Isaiah Campbell was the reason why they were preseason ranked solo, you know, because they didn't know yeah, that's a starter.", " Yeah, that in really lost. Jacob pointed this out. They lost two-thirds of their Bullpen, you know, they had to start all basically from scratch and they have to weaken starters or freshman. I mean good grief and this team still managed to win 40 plus games and go to the College World Series. So that's amazing. It is a real quick. If you even think about it talk about draft where they were drafted and stuff. Look at the NBA and we're Daniel gaffer did on night. One of the summer league. I know it's summer league and you can't really", " How much about it but Daniel Gaspard came out and looked like a guy that should have been drafted in the first round. Am I correct? Yeah.", " What about that? Sorry guys, I don't know. I mean, it's the summer league. That's my only thing but I always thought he should have been you know, a first-round draft pick and he's got the size yet. You know, the athleticism along with that size. Is this pretty extraordinary. It's not really that common in the NBA to be that size and that athletic and that you know, that hustle that he has going up and down the court not to mention just as she rides lettuces am inside. Don't get me wrong that we could point out things.", " You need to work on you know, the free-throw line. He need to improve on his his percentage there. He didn't really develop an outside shot like Portis did from one year to the other but I still thought he should have been a first round pick. I mean going into his sophomore year he was talking about is a lottery draft pick and this is from NBA Scouts. This is from people who do that for a living. Not you and I on, you know on a podcast. These are people who do this for a living projecting him as a possible lottery pick or at", " He's somewhere in the first round and I thought he should have been you know, it's not his fault. What happened and how Mike Anderson used him his last year and I'm not going to get started. I'm not going down that road, but I thought he should have been but at the same time it is the summer leagues we've seen this before we're guys show out in the summer leagues and then you know when the bell rings they disappeared you never hear from them again, so I but we'll see. I'm it's just cago Bulls, you know, they tried their luck with Bobby Portis didn't really work out and and maybe that had something to do with off the", " Antics with him and another teammate I don't know. We'll see if gaffer can work it out at Chicago. I'm going to be you know, I'm a Celtics fan. I'm not a big bulls guy. I actually can't stay in the Bulls almost as much as I hate the Lakers. Sorry, Otis Kirk, but I'm still going to keep an eye on both Bobby Portis and Daniel gathered and also the other Darrell Makin is making his moves to would Dallas right now biggest concern with with gaffer. It's his toughness.", " You know, we seen the big guy so many times on the floor on the court just get knocked down. So that was my biggest I guess criticism of him. So I mean, yeah, he's showing out but he looked like he had that toughness last night or the other night and was having fun. So we'll see what happens when it gets to to big-time Ball. But if he can get there and bang and really show that toughness, I think everything else will fall into place. Yeah, I agree.", " So real quick, we got some Twitter questions. We reached out and we said with a podcast going on a hog Nation. We we're going to do a Q&A portion. So give us a quick actions. We had a few people come back in and real flavor beeps AKA formerly formally Skittles. The artist is one of our top fans. He says plans to do more than one show a week. That's the first question.", " Ian Tau should we do one more than one the week? I think I think we should I don't know when we're gonna do it Skittles, but I think we should I think we should do it one day Skittles AKA or real flavor beeps AKA Skittles. Yeah. I think when the football season gets here now my schedule is obviously going to change during the fall when school starts. But yeah, I think we're going to Jacob and I haven't really talked about that a whole lot. But I think we do want to do more than one show where you get special with the growth that we're having on.", " Social media. I mean, we're well over a thousand views and on a podcast that's pretty extraordinary through Eight Episodes. Actually, we hit that marker. I think through seven episodes and yet it's not like YouTube where you know, you're just it's different comparing viewer ships from podcast to YouTube videos. So that thousand clicks thousand plus clicks is a big deal. So it's obviously it's obviously something people want and we've had that's not the first time I think we've had someone ask us about that. So yeah, I think that's probably in the in the future for", " Sure, and just an update on that big in those listeners, you know thin listeners, right? You know, they keep listening and they want more. You know, y'all give them more. Oh, yeah, speaking of number-wise just to give you an update and we'll go over to the next question is we are up to one point five thousand podcast downloads and in a little over two months, so I didn't work. Yes. That's the difference though. That's that's the thing with YouTube It's a click you'll watch it. My videos are five to six minutes, but a", " Carries on for 40 45 minutes and you have to download it to have that many views with this with this little podcast that's impressive. I'm proud of us Jacob. We're doing good work, man. Yes. Yes, we're doing real good in any also said part 2 how many wins in 2019 to electrophile hog fans about football program again. So I'm going to spend this off on top because I know you don't want to give out your season prediction yet, but this is a good question. How many wins does it take for Fanny?", " cheers to get back up to what it", " Why is maybe free 2014 we're pretty 2015 well to Electrify I don't that's look the path is laid out there for six to seven wins. I'm not saying that's what they get the path is there because I don't really believe Ole Miss is is going to be much better than where they were at a year ago in Arkansas should have beat him a year ago Kentucky lost a lot of their of their best Pieces of What made them go and I think", " That's a coin flip. I'm not saying these are automatic wins. I'm seeing their coin flips Mizzou. I'm not buying into Kelly Bryant and in that system at Mizzou. I'm just not right now. I'm in show me mode with what's going on at Mizzou on offense and we know defensively they're going to probably struggle a little bit ironically enough. They do a good job producing defensive lineman, you know to the next level, but I'm just not I think there's there's a path laid out there to win six or seven games. So if they can do that if it because", " Nobody whether it's Athlon magazine Lindy's. I don't know about Sports Illustrated and all the others. What's the other one street and Smith. None of them have Arkansas going to a bowl game. And I think the majority of Razorback fans probably believe there's somewhere around a bowl a bowl game presence if you if you make a bowl game and then maybe another win. I think that would Electrify the fan base. I think seven eight wins that would absolutely Electrify the hog fans or the Razorback fan base for the football program. I just the path", " Is there I don't know whether or not they take the path. It's laid out for them, but they're still a question of talent and youth and you know, you're trying to get developed along the offensive line or on the line of scrimmage. There's a lot of work to be done. But I think that yeah seven wins. I'll go with seven wins. I think what Electrify would get hogs at least excited for The Following Season kind of hype them up for 2020. I'll go with six because that means you made a bowl game. You know, that's that's a big improvement from 2 & 2", " But I think my biggest thing is can they play a full four quarter game without getting gas without letting teams like North Texas, Colorado State come out in the second half and out man you if they can play a four-quarter game and play competitive and all their games and get to that five six Windmark you're showing promise in your showroom progression. So that's what they need because they're so used to what Bielema did and that digression. So if", " If Chad Morris comes out and they went five six seven games that's going to Electrify the fan base now Porter real quick. Yes, sir. You said you said falling apart in four quarters against North Texas. We weren't even in that or Texas cake what? I'm get. Well, you know what? I'm getting. I know I know what you do. You let people get gas and I think a lot of that, you know, there's a big misconstrues ins on that now I my Outsiders, you know opinion on that was last", " last year was a wash because you know, you've got a guy like Chad Morris company with this High Tempo offense want to totally change the way Arkansas plays football if these guys the year before last play a four quarter game in a slow play action run offense and they were getting gassed like that. You can't expect them to go up Tempo and block for a full four quarter game. So like I said that if they could start blocking in playing a full for critter game and not get gas.", " That's what I was getting at. Yeah that North Texas game was just atrocious. I still wonder if and I know don't listen North Texas fans love me because I put a video out that before the season started about the non-conference teams that worried me the most and it was it was Nor taxes and the court of my analytics you could follow where people share your links and I follow I went down the rabbit hole and sure enough that video was shared all over there North Texas fan site or one", " Of their websites and I read some of the comments I was able to open up the link and see what all they said. They were all about it and then obviously reading the comments after the game was even I mean it was it was kind of like pouring salt on a wound, you know, but it was still like well, okay, at least at least there's some acknowledgement there that I was I was saying that these guys are dangerous but Mason fine as a quarterback, who by the way really under the radar Towns at quarterback and showed out against Arkansas. Well, maybe not", " Showed out but look pretty good looked you didn't look fazed at all that it was inside Fayetteville and playing in an SEC Stadium. But North Texas was definitely the most it's got to be one of the most disappointing games. And you know, when I was little I was actually at the Citadel game that Arkansas lost for Jack Crow is a head coach and I was I'm too little, you know, I was too young to know like how devastating my lost that was but my dad said well now, you know how it feels cause our clock frog stomped by North Texas. So yeah.", " When the coach gets Walked Out Of War Memorial Stadium and straight to the unemployment line. You know how bad that loss was. I remember that the whole so real quick about a quarter backs from small colleges in Texas. This is for pig skin will been Hicks tied to the Razorbacks staff fog their judgment. Will they feel like they owe him something even if he plays poorly seeing that this is his final season of eligibility.", " Tha go that's a really good question from pig skin on Twitter. Thank you. That was awesome question because this is something I want to talk about on a video or even here on our podcast. Yeah, I don't think so. I think they're going to play who gives them the best chance to win a game because this isn't this is a business we've talked about it and we're in the day and age where you got to win now. It's what have you done for me lately and if Hicks doesn't give you the best chance to win games if he's struggling to mesh with the rest of this offense and starkel who someone who's played in the SEC?", " Who's played power 5 football where been Hicks hasn't and they feel more comfortable. I think they go with with Nick starkel. I probably said that backwards but I think they end up going with with Stark over Hicks if Hicks does it show out but then there's going to be that what happens when been Hicks struggles and they keep him in the game. The fans start hollering for Nick starkel to come in and do they stick with him? And what's behind that is it because they like he says like pigskin says if you know their judgments being fog because they feel like they owe and something for coming.", " I don't think that happens. I think they're going to play whoever gives them the best chance to win. So you remember back in 2006 when Mitch Mustang I knew I knew you were gonna say that.", " Remember Robert Johnson Robert Johnson, who is the quarterback to her wide receiver Mitch mustain was on the sidelines Five Star Quarterback Springdale Zone. He was he was in there came to Campton. This was everybody wants you everybody wants the backup quarterback to be the starter doesn't matter who it is. What year it is or when it is they always wanted and they were chanting Mitch Mustangs game the whole time with Arkansas was down for", " Four to seven. Well, I yeah, so you're talking about the USC game. Yes, and I was there being me and my boy Duke shout out dude. I don't know if you're listening to this. You're not I'm sure you are but we were there and he and I were just looking at each other. Like when is he going to come in? It's got to be any moment. And if you remember that game Felix Jones fumbled the ball, I think if I remember I like two or three times it was we turn the ball over so many times it was hard to put all the blame on the quarterback and the offense but it just wasn't working and he and I looked at each other like okay, they're gonna put bitch in at any moment.", " And sure enough they do toward I think was the towards the end of the fourth quarter and he throws that dime to Damien Williams. I'll never forget that because we thought here's the future. This is what it's going to look like from here on out and sure enough. It really end up being a catastrophe and we all know how that turned out. But yeah, I I wonder if it's going to be that kind of situation but I guess the difference being neither one of these guys been Hicks or Nick starkel. They're not five-star prospects this freshman, you know, these are two guys they're older they've been around a little bit they kind of", " What's up, and I don't think there's any high expectations for either of these quarterbacks. I think obviously everyone's waiting on on KJ Jefferson and Chandler Morrison even still people that bring up John Stephen Jones. He could who knows about John Stephen. I don't know. I'm not going to count him out just yet and it's going to be interesting to see how that plays out. I think it's one of the most intriguing quarterback battles and obviously we're biased because we're we follow the Razorbacks but it's going to be one of the more intriguing quarterback battles. We've had on campus in a while. I'm kind of I'm looking forward to seeing what happens there.", " And then run go ahead. Sorry. Go ahead. You know, he's the center recruiting Chandler is the same thing Cloud coming in on that, you know, I thought that was the big thing and I think Chandler's kind of showed it. No, he's a player.", " Yeah, he you know when we had him on he's a he's got a good head on his shoulders. I think he's I'm excited about what he could do what he gets on campus. There is the question of kind of kind of similar with like what you said are they were they blinded by the fact that this is Chad Morris is Son and picking him over someone like Jacoby Criswell who's committed to North Carolina who went to the Elite 11 camp and finished in the top eight and", " More and more people are starting to ask the question, you know, do they pick did they backed the wrong horse here? And I'm going to say this. We're not going to go into depth on that Elite 11 Camp. I think there's too much there for us to cover and we probably carry the show on for another 30 minutes talking about that but the don't go by what someone does at an Elite 11 camp or any of these can't like you need to first off take into consideration. This guy plays at a very high level in Texas State football in high school football and is competitive and", " competes and wins at that level. I'm going to look at that before what he does at Elite 11 Camp not to mention Arkansas has had quarterbacks go to these Elite 11 camps do really well and no, I think they've always sent it's always been twenty or twenty five quarterbacks. I can't remember the exact number. I think it's 20 right Jacob.", " Yeah, okay the arc. I think Casey dick was an Elite 11 quarterback. If I'm not mistaken, uh, I'm pretty sure he was he was at least invited. I don't remember how far how high up he finished it. You take it with a grain of salt. Obviously, it's always nice to see what Scouts think of these players and what kind of feedback they get at these things. But you know, we've already had one guy from who covers all of Texas football the Dave. Is it Dave Campbell? Thanks and them in the magazine.", " Yes, and then they had someone one of the Riders they're talking about about Chandler Morris. Like look, he's legit. He could he could compete anywhere. So I feel pretty good about Chandler and I don't think that that's the same. I don't think that's the case. I hope not I do like Jacoby Chris well, and I think he's going to he could ball out at North Carolina. But yeah, they are you're right Porter. That's a similar situation there and I think they made the right call but time will tell we've still got K Jefferson on campus. I'm excited to see what he can do as well. Yeah real quick.", " I just took a comment from Ron and Malvern don't believe the staff is is tunnel vision is last step was with Allen brothers. That was the comment going back towards pigskin with been Hicks if they would have tunnel vision with been Hicks and then and then J Fork out of the on Twitter says do you think KJ Jefferson will make a push to start where most likely richer. I don't think so. What do you think? They're tie? I don't I don't think he I don't think he", " makes a push or anything. I think he starts for games and then red shirts are not starts for games but plays of four games in red shirts. This this is the most commonly asked question in my comments section. Look any time you get a 4 Star Quarterback when they've got that star power next to their name. He's the Messiah every class. It was the same way when Ty story was was committed. I remember the feedback then I remember what people are saying on social media. He's the Messiah of court at the quarterback position. I'm not saying KJ.", " Then won't I think people are putting way too much on KJ. I had someone in my comments section tell me that KJ runs like Darren McFadden. Okay? No. No, he doesn't he doesn't run anything light damage that they're big fan rental legit for three 740 time for two seconds. Good grief. Well, I think yeah, I think his overall. Yeah. I think he ran it for to seven is official 40 I think was like a low somewhere in the four threes. Regardless. Yeah, I'm sorry. KJ doesn't run a 4340 he is however an impressive dual.", " At quarterback and I don't think people need to you know, put so much on him and have these super high expectations of KJ. I don't I don't know that he pushes it's obviously it's going to depend on what happens with starkel and Ben hex. I think those two with the experience they have will battle it out. And eventually I think starkel takes the lead and that's probably how the year ends. The questions going to be what happens after that what happens in 2020? I think a Jefferson he's a little wrong in the past.", " Game, but I think he's got a high ceiling. I'm really hoping that he's patient at the University of Arkansas. Hope he sticks it out because I think he could be something special him and I don't you know, the jury for me is still out on on Chandler a little bit just because there's just not enough there. I'm obviously we're going to watch what he does his senior year. I'm not saying that either one of those guys, you know is better than the other but that is the future. I think of the quarterback position is between those two. It's going to be exciting to watch it really is", " And KJ's talented and he's a little wrong the passing game but he's dangerous outside the pocket. He can make moves out of the pocket. He's got good awareness. He's got a little bit of a delay and and when he cocks his arm back to throw there's a little bit of a delay there when I'm you know, watching this film but he's got really high potential. I'm going to say he's going to play enough this year that he doesn't burn his red shirt. And then I think they obviously weren't sure at him and we got to look at the landscape of college football now, you know the last two national championships", " Quarterbacks were freshmen. So so so they're looking at these guys coming in will look at what to it it look whatever Trevor did this. You know, now that that pressure is now being put on these guys coming in that they want them to be ready to come right out of high school and move college game. Yeah. It's not just on the players its on the coaches to because you're going to hear it if oh if so-and-so doesn't work out just like we said earlier. Oh second string quarterback is right there breathing down your neck. So I mean", " Yeah, I think I think AJ plays enough that doesn't burn his red shirt but starkel and then he takes her solidified as the yacht to guys. I think that I think so too. I think so too unless you know, obviously we can't see obviously if someone gets hurt God forbid knock on wood all that stuff unless something like that happens. But yeah, as long as I'm getting a lot of people that are comparing him to like the next, you know, Elite quarterback that Arkansas has just hang on pump the brakes. Let's just wait", " See how this all goes, you know, there's a lot of time between now and when you know Chandler Morris, she still got to deal with with him and how that all kind of pans out. And so there's a lot of expectations coming from from all these quarterbacks really not just KJ and Chandler, but everyone that's on campus right now for someone for the love of God take the quarterback position and do something with it, you know blind first. Oh, yes got a block. Yeah speaking of blocking. Do you think Arkansas pulls out two ends the s", " CC. Yes, Tom, I don't know if I want to answer that yet. I like I said the path is there I don't know. I'm just concerned about the youth with the skill position spot the durability of the running backs. We know Duvall wailing her Keen boy have both had issues, you know playing full seasons Chase Hayden has also had durability issues, you know the offensive line. There's a lot of change up front defensive line man there.", " Much work still to be done, but they've got a lot of seniors up there. You got Montrose paid the linebacker position. I", " the it's the path is there for right now? I'm just going to say probably not but again, I've still got about another three weeks before I put out my official well actually longer than that really but before I put anything out official on my channel as of right now, I'm having a hard time seeing them get 2 SEC wins right now. Well that could change. Well, obviously the big thing sorry. Here's the biggest thing we got to remember, you know, we put so much emphasis on blocking but now you", " Two quarterbacks one who's played in Chad Morris assistant, you're only asking these guys to block for two to three seconds. You know, these guys have the arm to get the ball out to the receivers with, you know from 1 to 3 seconds. So it's not like you've got a guy who liked I story who you know their pocket passer and they need so much time to develop and find the receivers. So that's why I'm saying, you know, because you know with Ole Miss I think Ole Miss and Missouri how low they are and now you've got a", " a quarterback who can get the ball out quick they could get to at least two wins.", " Yeah, I say I think I'm going to go to ends as well. I think I'm gonna I won't say absolutely two wins. But if we do get two wins on the say Ole Miss and Missouri and anything in between is just excellent. Yeah, I'm not I'm not sold on these other schools, you know, Ole Miss I think stays about the same where they're at a year ago Mississippi State just they had an incredible coach for a while and he's gone now and I don't think that they're that kind of caliber of a program to maintain that kind of that kind of", " those winds that they were able to achieve and then Mizzou. I'm just not sold on all them. I think the path is there honestly for six or seven wins this year. But again, there's just so many questions and for me, that's right. What I look at when I when I'm breaking the season down how many questions does this team have versus how many possible answers they have and there's for me there's a lot of questions and I'm just not there yet with two SEC wins. Yeah, and in the final question report, he said", " Best opportunities for freshman all-sec team from the offense and defense Alice. I'll State my guesses last go ahead Porter.", " All SEC freshman - stuff. I would have to go. I mean just from the hype that I'm hearing train ox, but other than that, I mean, there's not much that I see coming in on the defensive side that those people are going to really come in and step up and be that all SEC freshman caliber team because we are talking about the SEC.", " Yeah Ty what about you?", " So all SEC freshman on offense and I gotta agree with Porter. It's got to be trained Ox because I really, you know, I really don't know who else could step up I have heard TQ. Jackson has also been balling out. He's actually put on a little bit of weight. I think he's actually above 200 pounds. So you're talking about a guy who's about six three and a half six for 200-plus pounds another tall receiver another lengthy guy to go up and snatch the ball. I think it could come down between those two maybe Shamar Nash on defense at", " Key, I you know zags imos. I'm sure we'll play he'll be in rotation with the linebackers. We've heard a little bit about mati also lie, but man to get all SEC freshman if it's anybody I guess I'd go with Devin Bush if anyone were to make it to me would have to be Devon Bush, you know, four-star 6-foot hundred ninety five pound kid out of New Orleans. I like him a lot. We know he had that interception in the in the red-white scrimmage. And from what I understand. He's also been he's a", " He showed out quite a bit during the Spring workouts in the spring camp. So I like Devin Bush a lot. Maybe even Jalen Catalan he could I think he'll at least be a guy in rotation and could have, you know an opportunity to show out for Arkansas this year. I think he's going to get some playing time. So yeah, and there's some other guys along the defensive line. The thing is up front of the defensive line along the line of scrimmage. You've got a lot of seniors you got a lot of got a lot of seniors and upperclassmen. They're going to rotate up front. So, who knows?", " It's yeah right now I would go with train ox and probably for the defense Devin bush Okay, so on offense, let's see. I am going to go with", " that's a hard decision. Well, I don't want to go entree Knox. I don't want to say", " I am going to say that's a really good question guys. I'm so sorry. Let's see. I'm gonna go with", " Trey knocks, sorry, I know it's cliche to say I really honestly think trade knocks because the guy I think he's got the mentality of a guy that wants to be there and go in and just ball out. I think he just hasn't mentality. He's also so I believe he's a sighs he's got the hands and the want to and so and a defensive got I really think Enoch Jackson. I don't think he's in a red shirt. A lot of people a lot of people go", " to be like, you know Jackson. Why do you think him? Well, honestly, I think he's a guy that he's a defensive lineman six foot three hundred pounds but moves like a linebacker if you don't believe me go watch us tape and and then go back and come back at me and say, oh man, he is a really big ball. He's a guy that so Jalen catalans teammate touring Carter's teammate out of a Mesquite, Texas. So he's a good kid that I think he's he's one that's going to turn on this season. I got not like so", " We your or a calling clay or AJ Lee cattle and I think you know Jackson maybe a guy that means SEC all SEC freshman daughters. So I don't know what you guys think about that. But that's my take on him. I like that. I like Enoch. I think he talked and you know, Tori and Carter when you talk about interior defensive lineman that he got Marcus Miller get out of Warren Trey Burke says teammate six five three hundred pounds. Those guys could see some playing time. You know, I man, I feel good about their death long the", " Defensive line there and they're in good shape. I hope they continue to build off that but I'm really surprised. None of us picked who I think you'd have to argue is one of the better prospects the state of Arkansas has pushed out in a while and Hudson Henry. None of us mentioned Hudson Henry and I think that actually says a lot about the what's going on at tight end already at Arkansas. I mean, you've got Cheyenne or CJ O'Grady whatever he goes by these days. You've got him. It was probably an all SEC caliber tight end, but", " After him who's going to play I mean Grayson Gunter or so, I think yeah. Yeah, that's true. They I forgot they moved him from wide receiver down there. They tack some weight on and but Hudson Henry could have an opportunity to but I'm I'm with you guys. I think Trey Knox is on offenses. He's got to be the guy, you know, he showed out in the spring scrimmage. He had a looked really good not even on on the passes that he caught their other plays where he actually burned the corner. He got by the corners beat him off the line and he didn't get the ball thrown to him because the quarterback", " Was flushed out but yeah, I think Trey Knox I think everyone would probably majority of listeners would probably have to agree with that. I don't know maybe you guys could reach out to us on social media. Let us know what you think who you're all SEC freshman might be for the 2019 season or maybe even just the guys who come in and have a big impact because we can't forget about the Juco off. It's a lime and on the offensive line as well. So you got those guys should what should wezen wanna and Myron Cunningham", " Yeah, so there's there's plenty of guys out there. I think we have plenty of holes coming up this week. Just coming off this podcast that we can talk about. So that will do it for episode 9 of the hog Talk podcast. Thank you guys for tuning in hog Nation. Y'all are the heartbeat of this podcast keep showing it out keep subscribing keep Readiness and shared it all over social media for Jacob from the Hog Pen dotnet and tie from Pig.", " Trail Network and then our special guest today Porter Hayes man. Thank you for coming on. Hey, thank you for having me guys. And if y'all want to give us a look man you on Facebook. We're on Sports and culture media and our Twitter's at my sports and cultures how I again, thank you guys for having me on it's been a pleasure. Absolutely. Thanks for coming on. We really do appreciate Porter. Also guys, like Jacob said earlier on don't forget to give us a rating if you want to give us I don't know five stars would be great.", " Want to leave a review on the podcast on iTunes, that would be awesome as well star power wins it all. Hey guys, before we go man. I want to get a get a little special shout-out to Jacob sister man for blowing up on social media and getting to you know, meet all these famous NASCAR drivers. I see her all over Twitter. So Mana huge shout out to you for that man. Thanks, man. I will tell her to listen just to hear you shout her out. She's I don't know if she's a regular.", " Listener or not, but man, she loves Razorbacks and loves NASCAR. So there is definitely a market for that too. So guys, thanks for coming on tonight listeners. Thanks for listening tonight and woo Pig."]}