{"showID": "0A0rUcBRvpL436mIflNoVg", "show_name": "AFL Deep Dive", "show_description": "An AFL Podcast deep diving into the game before the drama.", "episode_name": "AFL Deep Dive", "episode_description": "An AFL Podcast deep diving into the game before the drama.", "transcript": ["Hi and welcome to the Dave Dawn to live dive the beyond the game dive how he mr. Smith good trans. How are you buddy? We're back. We're on time. We establish everything. Well this week apologies for that. He shoes we had earlier on a couple of tech issues, but we're back. We are back now everything seems to be running smoothly. Welcome to everyone Greg.", "He didn't get frightened by our family Jim Cullum Gremlins. Let's leave it at that and hope your team won on the weekend. It's been a very very interesting start to the season chance. They didn't know not. Yeah, absolutely. But unless you're a cat supporter. Yeah, it's going well. There may be nice knowing ya be interesting to see next week. I think next week we'll do a bit of a lighter recap, but welcome to the Deep dive. This is very much about our around for preview. So obviously run through all nine.", " Games as usual before that we'll do a few bits and pieces of news. I think we'll from next week. I think the latter is really going to start to take shape was tempted to put that on the agenda, but I think let's look probably Park that at this stage. It's already up in the air the my Melbourne could win and on Thursday night and then that you know, this season's no good here crazy and Melman could upset. Well, who knows? Yeah. I mean, this is the thing this season is proven. It's going to get crazier. So I think let's just hold that for a bit.", " Have some but messy thanks to our sponsors at hopster home hopes times the craft beer delivery service fantastic sponsors of ours back on for 2019 best way to get craft beer. Really you want craft beer delivered straight to your door fresh. They get there. They're can send directly to them and then they are intended to so it's a fantastic. Absolutely especially if you want a bit of diversity in your selection, you have to think about a curate it immaculately usually seasonal, but sometimes they put in some weird and wonderful.", " Things I've obviously they guess and we do wonderful things in and it's always a delight when it arrives on the the door steps on your doorstep. You'd have to leave the house rumor that no, no don't leave and as always if you use the promo code I felt Deep dive. Yeah on your first order you will receive $25 off your friends are bugs order, which is fantastic value. It's cheaper some of the value. Yeah already from them. That's the thing. I don't there's some perception that online craft beer purchasing is quite expensive because you're you know,", " Seem to shipping costs actually pretty good General everything on top of the getting 25 bucks off you it's pretty no-brainer. Give the service to go hop Stone.com a big thanks to Ed beyond the games back on. Yeah. I'm so we take everything. He's far as audio visual goes video. Audio lighting we will continue all this 7:30 on a Wednesday night for the foreseeable future. We're going to keep going absolutely so bitter news so he's a bit on the boil bit of news. We've got a nice little bit.", " New so we'll get to the Martin situation in the second. Yeah. I wanted to talk about the reality that the first two rounds and particularly around two and then round three we're extremely over umpired. I don't really understand like look, please feel free to disagree with us. I'm sure there will be people that will comment on Facebook here, but for me high scoring games don't equal.", " Great games last there's then I thought was a pretty bad game like the Melbourne Services Friday night the Melbourne the S and game it wasn't a particularly. Good game. I don't think either of them were playing styles that are sustainable for the season and that's a big concern because both teams I had both teams in my a so that's that's pretty concerning. Yeah while less than a one they still conceded what like 19 goals. So anyway, the point is though that highest it.", " A lot of people said I was gonna throw back to the 80s and it's like well, you know, there's wish that'd be like each other and head and never little dust-up. That sounds like a bit different. Yeah, but sorry kick-out. No, I was just going to say I think the main thing for me is I wanted a bit of a discussion and feel free to comment on thread on Facebook here. But do how do we feel about however, I'm tired. It's been and you know what? I mean now, it seems like they here's the problem is they've overreacted to", " License and now it comes into round 3 and I felt like they overreacted to them in a completely different way. So that's the thing like they reacted to some things why over the top and then they're like, whoa, hang on. Let's hold that way back and didn't want to fish over officiate the game too much like you nobody Millie had his head kicked off. Yeah in the Carlton Sydney game and the Umpire did nothing like it and you know, like simple pushing Cicely and well the Cicely one we can't tell as much but yeah.", " Jeg, ER, he doesn't like Jagger apparently. Yeah, it doesn't the AL mate the pushing there was a lot of that in the following round and round 3 and the umpires just stood there and just let it go. Yeah, look at warning them, but they wouldn't pay any free 3/6. Yeah, and I think what do we think about? Well, I'm aggressive because then on the flip side you had the Grand Final rematch and was quite low scoring and arguably and only obviously round 3, but probably the best game. Yeah finally game you can use through it. Yeah seen this year. It was low scoring.", " Highly skilled again. I still felt that there was over umpiring and the problem with over I'm hiring is is there's an influence from umpires on the game. It's not being taken care of by the players and the coaching and the structures put in place. It's actually the umpires are now having so much of an influence on the outcome of a game. Yeah to a point where not only us as viewers getting frustrated the players while they're watching other games again frustrated. I mean, obviously", " Patty Dangerfield, everyone knows he's tweets that went on through the weekend and that some of the below the knee free kicks. I think that was in that West Coast. Yeah. Well sometimes well, yeah kind of rear. Yeah, absolutely. So and look you're going to guess it's like politics one side sits on labor and another liberal. The rule was brought in because of some very extreme accidents over preceding years, but when you're taught anyone, who knows", " Play Junior footy you taught to go hard at the ball and put your head over the ball. And now when you get to these are later levels or even senior levels, you can't do that. So you've little Natural Instinct and what you've been trying to do is being taken away from you on top of that. There's all these other rules now. It's not the umpires per se no, no and they players have come out to look good. It's not that we know is on their boats. They've been told to officiate in a certain way. So it's just really really frustrating that there's too many rules that have got.", " They are yeah, they're not black and white like if you kick the ball over the line on the full the boundary line. It's out on the floor. The opposition gets a freaky. That's yeah the white so I live how I was well though, like the only thing I would say about the dangers of thing is I'll up he would have to know Steve Hawking really. Well. He was actually long when he was there. Why was why is this not wise to still going? Yeah, like he's the I felt up here PA. Yeah, there's an approach that's what's happening anyway, but I just wanted to have because this is", " It's such a strong talking point and people have been talking about it pretty heavily through the last couple of weeks and given that there was such an over reaction to certain things and then in round one or two and then in round three, they under reacted to things and then overreacted the other things and I look it. I think the first thing I wanted to say was that the umpires don't make the rules the umpires are adjudicating the rules. They're not sitting around going. Hmm. Why don't we really heavily go on this this week? I don't think that's what's going. I might get some food.", " I might be asked to provide feedback in the leader while they're asked to do different things clearly from round around because it was um pipe Dolly differently again. I mean like at the end of the year that they don't need probably seen your central umpires that are asked to provide some feedback as a collective about what the umpires think can can improve the game. Yeah, but they do not yeah that is no one sitting on the board of rule changes or whatever. They called making any direct decisions and not sure.", " Because they're the ones officiating and I would think that would be a gray area there exam say who does it there is all my you know War Michael Christensen and just to talk now about the mro like, yeah that was just ridiculous again this week, you know, it was obviously so will paraphrase it all with the Martin thing, which I'm sure everyone knows about now. I personally thought it was extreme two weeks or that one week was probably fair enough given given the history and the accidents of something larger.", " Only last week that Grimes got a week. He could easily have heard Elliott much more than what he did. Yeah and last year Brownlow Medal listing or Mitchell learned. Oh mate told gold. You're saying yeah, I think all we want is consistency if that is two weeks. Then everybody has to get two weeks. Yeah, absolutely. What am I missing? And and he was just like, oh it is what it is like it was so mean. I think he handled that press conference really poorly. But that said, I mean there was a lot of confusion around that and this is all we want is", " Is it's hard because this is the first year terms of the rules and interpretations and the mro and the rules committee. It's hard because a lot of things have changed in one God. So yeah, I wonder where things need to be staggered a little bit more so that there wasn't so because I think even the umpires are confused commentators are clearly confused and people that are you know, trying to describe the game a clearly heavily confused. Look at the definite concern and if you have any questions", " You know shoot it to us on the Facebook a now or on social media of look because it's an interesting discussion because I something's going to have to be done by and the problem is that what will happen is it'll evolve throughout the year and they'll be some rounds where it'll be bad and they'll be some rounds were it'll be good. Yeah, and I just can't understand why we can't have consistent umpiring and again the grandfather was not that long ago. And that was a really well officiated game. There was definitely a few things that in it that will probably let go a bit much but but that's fine. You expect that. It's like that's a player.", " Why I is make mistakes and yeah, absolutely every every single year we go through this to some degree and every year nothing gets done about it and this year it seems particularly frustrating because there's all these new rules. There's a whole range of things that have changed and there's some rules that have been bought in and others having and if something happens and I'll explain one example, how is it going to be adjudicated? So player can play on right from a kick-out and they can run now if he kicks it and it goes out of bounds without someone.", " Touching the ball. Is it a free kick to the opposition? Yeah, I was I haven't removed that but even if he doesn't play on and he kicks it out. Yeah, I'll roll so we don't know nobody's clarifying that type of stuff. So yeah, it looks it's a work in progress and that's always a work in process is what's for us. What the - it's the Monash. It's always bad football. It's bad and it shouldn't happen during the pre the regular season but on. Yeah, I'm watching. Yep the steak. So I'm at a point now where everything at the moment. It's Thursdays.", " Be Fridays, but at the start of the round I'm sitting there is a fan thinking how they're going to Empire this way and that's and that's not good where every week. I'm sitting there thinking. How is the game get it and I know it. I understand. It's a difficult game do umpire. I understand that it's weird. You know, there's so much interpretation. That's part of what makes football a great game. But I mean, come on like there are there are some rules that need to be thrown out and then there are some", " things that I think it what why is this so difficult every single year we go through this and and we talked about it last year and it's frustrating because as a fan, I think a lot of people are in our situation we sit there and think of the star The Roundhouse. What are we going to get this round and really all what are they been told really all we should be thinking about is what gay or what gear? I'm going to drink with the are where who am I ordering it from this way and he's all mine opsite. Yeah, but no but no, but honestly like it is super frustrating it is it's highly frustrating every single round. We're in a situation where", " We have no idea what's going to happen and it's so obvious now as well that the umpires have been given memos around different things. Like don't do this too much. Like there's a bit of punching probably let it play a bit, you know people we got a bit of strife on that. I mean, it just looks like it might it honestly makes the league look amateur hour. It really does like I get it that it's hard to Own Part here every single week. So it's the hardest game in the world jump. I don't know. They haven't played every game and I haven't studied every game to know whether that's true, but you hear that constantly and", " And if it is if that's the case, I know it is because my brother was nine Byron. Yeah. I met a lot of his friends that one pies why make it more difficult by bringing in more rules simply kill all at once as well simplify. Let's go back to the rules that they incorporate a nice kick and I'm being facetious here and just stick with those rules. Yeah, because you started off kick and they know I'm a jockey but they can definitely simplify some of these rules that they meet you juice and not always just have a knee-jerk reaction because of one instant he or two Winters there.", " The case may be and maybe just he's a brain idea. I think it's been mentioned before you ask the population of supporters what they want to see on the field because they're the ones paying well everybody wants the game that like, I think it's been pretty heavily established that the fans generally speaking. I think this speaks for a fair amount what the game to be let go like I think people people love the umpiring in the finals consistently you hear people saying,", " Saying that was a better game because it was allowed to be played like it wasn't content to be honest round two particularly. We watched a couple of games together and it was so frustrating watching things get interrupted so constantly anyway we've gone on for a bit. But yeah, there's the other thing it takes away. I don't want I don't want to talk about it, but it's a big issue because every year it's happening again, and it's frustrating and you know Simon's written in here, you know. Hi guys, I agree with you about the below the knee roll. It has gone beyond a joke and these 50 meter penalties are", " Intense a hundred percent and I mean, it's absolutely ridiculous. Yeah that, you know we talked about if you listen to our review episode, we do the sort of a bigger deeper dive look back on the round. I am raising a few other people noticed this with McVeigh exploiting the you know, the double 50 rule by basically running into other players so that it looked like they were encroaching his face. Like it's the players are always going to be exaggerated this stuff. Yeah, I think yeah. Anyway, I think there are certain things that clearly need to be removed.", " And if Michael Christensen is going to you know, officiate all these things. He has to be consistent. Absolutely and to basically say, oh, well it is what it is was that's what was embarrassing it was completely embarrassing like this is meant to be a billion-dollar business like to have this guy stand up and say, oh well, but you know that she cooks like they were asking him saying. Oh, well, what about the Mitchell incident? What about the Grimes and only last week? How did that only get awake? And he said I will you know, it's down to you know potential to cause injury. That's that's", " Absolutely crazy like this logic is absolutely crazy. That's like you need to judge it on what happened? Yeah. It's not on what could happen. No, I think that's that's ridiculous there to be honest. Like that's it any way we could keep going and going and I'm sure you know, you know, you can see where we're going but not if it's nothing against and we just wanted to free up a little bit. Yeah talk about it to some degree. But yeah, I know that but no no, we don't want to talk about it. I'd love to", " not talk about it at all and go straight into the round and talk freely about some of the games but you know anyway, so the Martin fine if you miss this Martin, yeah, so he's been awake reduce which I think is probably a little bit more accurate obviously caught massive fines for the the flippin the bird and all that sort of yeah. I know I did wasn't if I mean do we want to wear this I wasn't offended by it. I'm not and I thing is he's not the person that should be getting reprimanded for this. It's the television stations that actually Hollow. I don't know.", " A show every newspaper every day don't need to highlight that they don't need to put it on the television because even though it's a bad look for people watching at home or go. Hang on. Well don't put on the television. It's really easy. Don't not to put it on there. If a Streaker goes onto the field the cameramen do not visualize it at all. They just don't do that. So why do something like this really if that was just on the field a handful of people in the crowd wouldn't know so because it's in the middle of the field. Yeah month it was", " Maybe he's away. So this could have been a non-story. It's because of who he is such a high-profile player and it got picked up. I've got picked up by the cameras, but they know not to do it and I if I was AFL personally and they wanted to cut this stuff out. They should be going back to channel 7 Fox 40 and all the other broadcasts. I do not highlight this on live or hype replays of the game. Yes, if it comes out in a story, that's fine, but Young", " Young adults and children that might be influenced well now about the root and you know about it. Anyway, we spoke about this we know we start my recording but for all the PC people out there it's not going to offend them anymore. Is it like this is ridiculous ridiculous argument that I will kids would have kids see this. I was swearing it 18 months. Well, you know, I mean the reality is how can you be offended by that place? Exactly? And the other thing that's being heavily underreported. Is that the big reason why hard it was?", " Really annoyed after the game was that there was some pretty average stuff by the JW's players said to Martin on the day. So I think his reaction given what I've heard was said was it's it is rumor so I'm not going to say what was said because I who knows it might not be the case, but it's the average stuff and it seems out of character for hardwood to get so upset. What's happening socially not just a tag and what's that in know and what's not out of character is is someone like a", " Desai some of this stuff because he has done this before. This is not the first time he's heavily sleds people on the field hockey and we'll minson a definitely liked said some pretty cool stuff as an example. You know, I'm not throwing you under the bus, but it's been that's pretty known. Like I don't think I'm really going out and I really saying anything that no that's not been enough anecdotal evidence like yeah anyway, so I mean look if someone said this sort of stuff do you I'm pretty sure you'd be reacting in a similar way and I actually think he handled himself actually not that bad to be.", " To see put up a sorry thing on Twitter and I was like, well, yeah, let's and that's the other thing. I mean so much of what football is of naturally been taught to do growing up to get an advantage over the opposition has been taken away. They can't play this physical type of game anymore. So the one advantage I can get is by getting under the opposition skin into their head. And this is the type of stuff that's going to come out more and more so I mean, but I don't mean all the time. Yeah, it comes back to some of the rules I", " Allow little bit more physicality in the are gett protecting their head and not punching and all that type of stuff. I'm not saying let's go back to the 1980s, but somewhere between the late 90s and early 2000s where there was a little bit of physicality. So some banter banter absolute, that's fine. But this from what I heard was said is not bad. This was fairly offensive. So I think it's fair enough to react in the way did anyway, that's all I want to say because I was heavily underreported because it doesn't back the story. No, it's not the story nothing. It's much better story that Martin's is flipped it. Yeah, that's", " That's really the people don't see a million times a day, you know exactly is our while that's so offensive. Woohoo. The route finger. Wow, and the other thing too is the hello gesture in Australia isn't exactly and someone will swear in every sentence. Anyway, someone said during the week that you know, I will about this whole kids thing. I can't rehearse I read this or saw this like, I remember someone said well couldn't people couldn't kids also ask why was mom for not playing for the best, you know, if you couple of weeks like Anna, yeah.", " Hey, so let's I think we'll probably move from there Katie Brennan signed obviously into the FLW Richmond team years away the news the news. There's a lot of kind of movement. I think what we'll probably do is wait till the end of that kind of trade period And once things have settled and we'll do a full kind of yell go over every law every move and who's going with who and see what's going on and then do a full will do a very big preview early next year obviously because there'll be a lot of new teams and a lot of lot of stuff to discuss and nearly everyone.", " Have a team by next year. So yeah a couple other big names that I mean, Aaron Phillips will know whether she's back yet playing and Daisy Pierce will know whether she's coming back as well. You would think so. Yeah rather than just mention One play here and there over the preceding week. I'm coming weeks and be easy to do a big big chunk of it. I think so, so that's stage. We might need to talk about rules. Hopefully, please no. Yeah. That's the thing as we said, we don't really want to talk about it. So let's get into Round 4 massive rounds. I mean", " I mean everyone is messy but particularly given that there's been so many upsets. There's a lot on the line now for a lot of teams. Yeah, there's a few tests to give my really be so far behind the pack that's going to be really difficult for him and a couple of times they could start stretch pulling away even further. Well, there's a lot of stories that could happen out of it's absolutely yeah. So game one on the Thursday night Sydney versus the D's 12 verses 18th. Can you believe it up at the scg or the bog Heap? That's", " the new name of the acedia the mud pit the mud pit. So that's where something we did raise willy-nilly to just over a month ago that the sog was going to be a fair but should ask why we have a drop if I got to drop in Pitch there. So it's fair to say that they'll be using the wide expanses of our that's right. They don't have any white expenses that the scg and this is going to be and I'm very interesting game to see how this plays out. Obviously see no one better get injured. That's the other thing. Yeah, it could be some lawsuits after this game. Who knows? Yeah.", " Anyway, well so Sydney Sydney obviously got off off the canvas last week against Carlton with a just Yin on convincing win against the Cowboys should have won that game. Yeah Blues starting to really probably get people excited and super frustrated because they really should have seen shooting but should have two wins easily on the board and potentially three and it's Sydney Sydney a likely not to be zipping through. Yeah, I think", " Sydney look, you know we were pretty abused for Sydney were not looking much chop, but I to only just get over Carlton and they should not have won that game the first 10 or 15 minutes Carlton completely controlled that game so I'm definitely concerned by this but they coming up against Melvin who by far defensively of the poorest team in the league. Well, they don't have a defense to they know they got no defense. They basically don't have a forward line either. They've taken McDonald up to Sydney.", " I don't I really don't think he's going to play but who knows? Yeah, man, wait a minute probably had to be the main man. That'll have to go forward. But look, this is a fascinating game to say the least because you've got a really undermanned Sydney. So Hayward and McVeigh out Grundy still not certain started this week and I'll be surprised if he does. Yeah, and who else so mcinerney is first game and Karen Jack comes into care and Jack's a good in. Yep.", " But he yeah, I mean, I know he's he is bigger than in as he was back in the day. I probably wouldn't have thought so I think if they can control the game and slow pace he becomes really important. But if it if Melbourne get off the latian have their running game going I'd I can't see how he impacts Sinners chances as much if it was just like gamble I'd say yeah, so Melbourne preuss and stretch come in college as knee goes out and Neil Boland heard a pretty average go home. Do you know Melvin don't know much depth of the", " Frost get snow again. I mean I that's get it. He was strings. I can't wait until they can't wait for me to get fit. And yeah, well, he's had love leverback as well. Wouldn't they want the like made to be fit? But yeah, so if you're wanting sort of a chat around last week's games more so check out our review episode on able to drive on any of the podcasting platforms. This is more about Kool looking further. But yeah for me what who we go with here like I think", " The thing about is that site the scg like you can mount an argument that it's actually going to be worse for Melbourne with the the size of the ground. I think with the shape of a to that that could could cause issues as well. They look so unorganized are completely defeat depleted or defeated as well and forward and back, you know, even some of their meds have been pretty out of form as well. I think Nathan Jones looks like", " Dreamland equipped Vine, he's been okay, you know bits and pieces of their engine look okay, but there's there's definitely some issues as well. There's issues all over the ground. Yeah. I did then this is all over the protein is absolutely so look. I don't know if you heard this stat earlier earlier during the week. So body Franklin has played Melbourne 15 times. Yeah, what is record is not to be like 13 or 14 15 and Z. Yeah. He has not lost a been terrible for his most awesome lb", " And I think this is going to be similar to the Melbourne gaol on game last year down the category and I think Melbourne are going to lead for the majority game until the end and buddy or Hanson or somewhat. I'm them overrun them. He knew was incredible last week we went to be so there was signs that some of the key personnel at Sydney are starting to get their Fitness back and then mojo back and because it's at the scg at some positive how bad Melbourne have been I'm going on picket Sydney this one. I think I'm gonna have to go with Sydney as well. I think not confidently, but no I think", " You know Blakeley has been good. I think some of the kids look okay, but I thought it was Pat, please best game. I've seen for a little while last week as well. So there's definitely some some good signs Melbourne just look like a rebel. I just how do you back them? Like they look I mean, you never know. They're probably bounce back. But I mean, this is the thing they still managed to kick a pretty big school. I suppose they can still attack and if they play that sort of game maybe they still would beat Sydney even even with all this.", " Issues. Yeah, I don't know I the problem is though like who goes to Buddy exactly. They have no defense like this is the thing if he's up and about and if he's informed.", " It's going to be pretty difficult for them to curse is Sydney meat-filled, even though it's not as good as it once was still has enough in there to Corral. Yeah Melbourne at the moment because Melbourne's except for Oliver. It's not really firing on all cylinders the moment. They're still missing we mentioned male ever. There's no Louis there as well. No, so there's some key personnel down back and I that's the thing. I just can't see them contain containing buddy and or haneun some of the other forwards at Sydney even though it's", " That potent at the moment. No have a defensive just leaks goals. And even in Melbourne's for thine is so heavily depleted and look at it. So therefore line at the moment. So Corey Wagner Tom McDonald who I don't think we'll play. Oh that's so that's the other time with Donald Jake Malcolm James harm Sam where demon and angers brochure Angus brochure so busy in the middle, I don't reckon. He's really good at like a notch time. That's really kind of brought him to be dams harms had a pretty average either. He it wasn't wasn't particularly. Very good. Wait a minute ride.", " He's such a young Play Can't you know, put too much on a man milk shims been good. But again, he's not going to get too many options, you know versus Callum Mills Dane rambutan. Mccarten, Jake Lloyd alir alir and Jackson Thriller. I mean, I had backed that Sydney growth. Okay Melvin grow absolutely on paper but look Melbourne are bloody hard team to to read but I mean look unless Tom McDonald, you know has some sort of Miracle recovery. I really don't see", " This and even then I he's been pretty out of form as well. Like the between hand wait A Min they've kicked something like six or seven goals in the first year no idea ever and obviously there's a lot of pressure on Young Gun petrarca and whether he's dealing with that well enough or whether they're you know, so they don't with him as well. But if he has a he has one of his better games on Thursday night that will go a long way to helping Melbourne get the wing because he's pretty important because if he's be performing well, obviously obviously", " Leslie takes a Defender a way that has to follow almost got a tag and a freeze up like players like nachshon and brochure to get to go forward and just help out those bigger players. I'll mates Michael on Facebook. You said there is a guy called Isaac any to yeah, we were just talking about him before that. Yeah, I you know, he's going to be extremely difficult to Qatar with no defense. So I think you look given us at home. I'm going to have to just go with Sydney. Yeah, I got for this one is let's keep moving. So", " Next came the Friday night the pies versus the dogs 11th vs V and that's size 11 doggies V if you haven't been yeah, that's a date which is unusual. It's strange. So Collingwood having a much tougher game and losing to West Coast. I thought they were pretty Gallant. But yeah. Yeah the West Coast I think of probably the best side in the league and then against the doggies who lost to the Gold Coast. So yeah, I figure I think I think the pies are win this by", " I probably 35 40 points. I think yeah, I think I mean the retail atoms and in return looked fantastic look good. Yeah, and he's a confidence only going to get better and better Grundy. Obviously play extremely. Well dominate The Rock pedals was a little bit down by bottom was five but always good that he I don't think he's playing and I don't sorry. I'm mistaken. I confused him with seedsman for the crows who's out now so I bought all the play. So now seidman Teemo is no wasn't I'll come and play it. So yeah, I think that was just--", " I'm probably common with politics very well against West Coast that happened they play like that against any other team than when and yeah, the dog is the forwards look good to Jordan to go is really good or not. Yeah, uh push through it and the obviously very good good how West Coast offense but he pushed through his jaw. He's a very good player puts our get up there cocks, obviously cover the mistakes. That smear check was really good up front. He was good. Yeah, and they just Kelly it's only gonna get better as well. It's going to get better. I love how he deals with the media afterwards. He's really good. Not don't ya don't care what?", " You say I am not just can't be bothered to tell me about that. So very good and the dogs really good gutsy Wing. Okay. So with all in one week and therefore they were very lucky to win that game. Let's be deliberately on bodies in great form though. I must admit. He's in Better form. Yeah. He's he looks good, but I think there are other no match for the there are a few tickets short. I mean the other thing too is that the pious back line is looking better. I think against the dogs. They should be able to catch all that pretty easily because the dogs in their hand on enough of the footage.", " Actually put a score on the board to scare or something missing bits and pieces. Yeah, absolutely been just not big enough as we've said our the last sort of iodine months is no not enough big bodies and I think yeah 3341 on that for a while and I think you're definitely on to something. That's a good starting to add up. Yeah. It was like a tomboy back and some of these younger players put on a bit of he's playing vfl this faux come in, who knows whether he's ever going to get to that. So track form. It could be us. Yeah. I'm yeah, I think we're both going to have to go to the pies. Obviously the pies only one.", " And so far this year, but they were a little unlucky to lose ground along and then you're like West Coast were clearly beside but West Coast directly beside them. Pretty much everyone. Well, it's a long season on top of the ladder and West Coast top 4 5 so the come up against some big competition. I think John West Coast to the two best teams in the league for me right now. Yep, my great aunt bee but I think I think collingwood's is in that same group that they're the three. I don't think it's too hard does not enough sample size to maybe West Coast lie in front, but I think", " Long and and calling it a very very close, but for me, I don't need two dogs are good enough weapons. So they'll be elements of them that will disrupt their game. They seem to have adapted to the new rules quite. Well, there are side that seems to to you know, you know, like the six six six. So there's elements. Yeah some of the new things that have worked. Yeah, and I expect you do say that. Yeah passages apply a will the dogs will dominate for periods like five minutes here 10 minutes there where they'll get on top of Collingwood. I just can't see them.", " I'm being able to then translate that on the scoreboard. I think the common defense is going to be way too strong and they'll be able to really hold that defensive structure. Even if they get multiple for 250 coming in one after another this such a good saying calling with their so well drill. We say this week in week out and the dogs are getting there but obviously had a couple of poor years and losing some key personnel. I think it's just going to be a bit too much of it asked to try and", " Get off of the team like Collinwood at the moment. Oh my Bose come and said tomboy top form. Hahaha. He's played one who gave me his life, huh? We didn't say was top form. So I'll mate Boyd. We just said that he's on the list. Yeah. Those are two big bodies on the very young player. And yeah, we're talking about big bodies in terms of the the tiny they just look like boys up against some of these other teams the dogs at the moment. So just just having some big boys that can crash crash the packs get it down to the", " The mosquito Fleet they've got they've got some great Runners and really good girls and it's but they just if it gets bombed in there shaky is still developing. He hasn't got a really big frame at the moment. He's tall Norton's the same obviously English is in the Rock so you can't expect those boys. They're all young to be dominating this early in their career know exactly and that well, yeah, and in terms of Tom Boyd specifically like obviously things are looking great. No just not just new. He's got me buddy please on", " She's on the list of yeah next game into the Saturday the cats versus the Giants probably game of the round. Definitely one of the better games around for sure cats first versus Giants and forth Giants are looking pretty good to be honest. Definitely smashed the Richmond Tigers. Yeah, Angela long. Yeah, really looking very good going of Adelaide and a great win. What do we think at GM had to be a stadium? So I don't think the kids are going to lose too many games of the calorie know this is the one game that you think may be the one they dropped.", " It's through the year. However, I just that blade I can't fault on at the moment they look so so this this is a team that reminds me of those great teams from sort of mm not to the same extent but sort of elements that 2007 through 2012 Delong teams. We're really sound defense without being super dominant how retailers they're the mean anything is formed. They've got Henderson and chewy to come back into that defense. So it's only going to get stronger Scott, sir.", " PS got seller as well. Jed view is another one and then you've got this ridiculously deep Midfield that can play anywhere from half back through the forward line and eats gelling really well. Obviously man, Angola Has Lifted his game is so diverse. He goes up on the radar Murdock's another one and you've got Callie and then go off it mentioned him radically radically as the other one yet and he's going to start once he gets his match Fitness back. You would think he'd be able to chop you", " To help Stanley in the rug. Yeah, he's having a really good year and then obviously you got a fairly balanced for lying with Hawking's my is now a young guy and you got danger not that he kinky gets shot goal. But I personally only thing bursting out of Midfield can kick a blind and the master little Gaza. So they're just very balanced they seem to be really enjoying their 40 as well which helps a lot on the flip side. You got a very well drill highly skilled lots of draft picks.", " Giants very fast you've always anywhere else in Australia. I might lean towards the Giants on going with the cats because it's what about enjoying Stadium? It was in China would you go for the John's? Yeah, just just adjust it the other thing just to back up what he's saying but the cats as well as the the big thing for me why I mean obviously like you've got people that weren't in from last year and we're sort of having mixed roles are in form again this year that obviously makes a massive difference of people like, you know, Taylor's an", " Apple but that said the big reason why the cats are winning and winning. Well is they've got you know, constable and Myers and all these guys that are playing extremely good roles and it frees up Dangerfield and you know, extremely good players to play on the outside and and to play all these other roles. I mean look at our Blitz game. It's probably the best. I've seen him play for a little while definitely playing was operate in ways not well Gary Knox and he's not hard on ball. He's not he's have I mean look at the way tighter.", " Like, you know a lot was made of Adelaide, you know setting up really poorly for Dangerfield and you know, don't you got 10 clearances or something like that, which is fairly ridiculous. But that said, I mean, I mean it yeah the kids are performing and it allows all these, you know veterans to do absolutely because yeah, they can't all tagged every player. Otherwise they will they'll never do anything. So, yeah, it's become a very very difficult team to match up defensively, especially in the center John.", " It's look Giants have been good. I think they were pretty poor against West Coast. I think Richmond pretty much have no defense almost and that's why Jeremy Cameron was off the leash. So heavily, you know, seven five and thirty possessions of that. I don't I can't say it's going to happen. No that happened because there's when he plays against France these averages a miniscule. So that's the thing. So I for me I'm going to go the cats as well. I just think at home with them and mention that they've got going that it's all positive is really endless only really massive.", " Comes out in the next 24 48 hours or a recording this on Wednesday night. Yes. I want something pretty crazy happens. I've got to go to cats as well. Yeah, just just with you a form for the John's. Yeah, exactly. I mean obviously the deal these days. Yeah be chance at Collinwood and Toby grain come back into that Giants lineup that will definitely bring the game much closer. I would expect obviously. Toby green is a freak forward brings a lot of pressure and he's very hard matchup and collingwood's just bull and a gun in the Midfield so", " Oh mate Matthew died Murdoch is at the sun's I thought you said Murdock early also. Hey, I'm it is not there anymore. He's not there. He's gone. You mustn't think of the summit know it was sorry. You're right. I was mr. Duncan - I'm so sorry. My apologies look a bit. Thanks for that pickup yet. That would say Nia has great form bringing back. Yeah with bird. So very very good observation. I did twitch then when that was said there were a lot of names and I was like, no, it's fine. Let's yeah", " I think not for me. I've gotta get a cat. Yeah cat throws it back at home. Yeah cats tonight. Yeah next time incident versus the Brisbane Lions 15th versus second. Can you believe that? What do we think here? So MCG to 10? Yeah. Really? This is such a challenging gain to work out who's going to win and what type of game we're going to get there was signs obviously as and got their first win. So going to have a little bit of", " Confidence coming into this game. They started to look like they were gelling we knew each other. So the the possessions and the teamwork is one thing so that's a positive sign and initially I thought hang on this might be the kick start for them to then go on and win some consecutive games. I'm still leaning towards the The Dons at this point in time just because it is down in Melbourne. And obviously the lines are up and about playing really really well. Yeah.", " But at some point I don't think this young team can continue to go on the way. They just want a way lot of travel my maybe some of them might get ahead of themselves not because Fagan and the coaching staff and instilling a certain type of humility, but it's really hard when you're a young team and all of a sudden you've gone from a year where you're almost won games and one for overall people have to do it already almost already there. They've adapted only thing with the dog is even more so the line", " Inducted to the new rules probably better. Yeah, the most of the other teams looking nails really most the inform player of the game at the moment. I think he's leading the brown layer race. But yeah, I look s in an ultimately were awful for the first two rounds. It's really hard to get much of read on them outside of awful and then the third game they were a bit better, but I still I mean they obviously were better but they did play Melbourne who are the A-10 side in the league who yeah, really? How do you how do you", " Really? How do you really write it? Yeah, and then on top of it, they're playing a game style that's completely unsustainable to make finals can pluck completely unsustainable and the obvious thing is they've so rotten and you know, a lot of you know, the people that have come into the club in the offseason and we're really trying to push a new game style and I think there was a lot of confusion out there and that that's that's all the noise you hear out of essendon and they've basically gone back to the way they were playing which I don't know. I mean that", " That each time. It hasn't worked. It hasn't got them, you know into a position where they can make a serious chance for the flying. So I don't know. I'm going to run with the Lions again. I agree in that it there is probably going to be a point where it does fall away, but the lines just came here and and one recently. Yeah, I think you know, if you come it isn't the G and I think they've got nothing to lose and I think they've got a they've obviously got momentum they haven't lost a game so they were a little lucky to get over poured in the", " Import had a fair amount of control on the back end of the game. But look they played the end of the game really well and they would have lost that game last year. So I think they've learnt a lot and and I just think with Neil and such good form. I think yesterday have to play out of this Hindu win this game. Oh my God, that's great. They're in really poor form team that can win ugly and not playing a diverse. I'm talking about Alliance here and still get the four point is a shot. Sure sign of a maturity. Yeah and a team that really knows their game playing play our game plan really. Well. Yeah because", " When you're struggling for my eyes or teams coming at you like poor dear to be able to withstand that and still keep enough score will pressure jumping over to get the wing. He's aggressive together. Look really well faggins obviously had a plan from date Dot and it was a slow process. But all of a sudden it's like it's been pretty stable. I don't think he thought it was going to happen this quick I thought but yeah that like The Snowball Effect that little flake has turned into a", " Ball and it's coming pretty quick but also to pick up locking Nails a message messy messy. He was such an underrated player at Fremantle. You know last year we constantly, you know raved about how good of a player he wasn't if he was in in Melbourne or when he's I will never not that raved about but yeah, well, yeah, he'd be pretty pretty well known if he was here playing for a big Club. Absolutely anyone, you know the dance. Yeah. I'm going to go to Don's and if they don't win I probably won't tip him for a while. Yeah, I'll beat you know with the lines one more time. I'm I'm on the line ago.", " Is but yeah, I think I think the Don's got know what they needed last week and they're the one of the best teams to watch in the league at the moment. I really like watching them. I'm full chips in with the lines. I'm going to run run with them for another game excellent and I think s and and generally speaking it says them in really poor has been so next game Port versus the teague's eight verses 14th and Adelaide oval I think power going to involve a fair bit. I think things are looking up.", " No, good. All right. There's this rumor going around that re what might be playing. I always know apparently there's a fair amount of noise around it that's been partially generated by him. But I I think power power pretty good side. There were the first two games are unlucky not to win the third that came up against a very good lines, but I know I think I think Porter gonna win by 30 40 points. Yeah the power obviously they're probably so far got the best.", " Out of the draft with as it does mama Butters and Rosie all playing unbelievably good roles some match-winning type roles almost with Rosie last week in five goals. Yeah, and there's a big chance that Robbie gray comes back this week. Yeah. So yeah, I and Adelaide oval obviously big big outs at Richmond Martin coach and Iran we get Grimes back, but they crimes back. Yeah Cady.", " Eventually played 70% of vfl. So you think that's a bit of a made maybe. Yeah, maybe but rants very well cotton Martin greeting bang bang. Holy man. There's some big plays there now that's we're starting to really see that the depth being really test it and I want to go with Richmond in an upset because they want to prove a point. But without cots in there in particular Martin, I think it's going to be too big of a mountain to climb against", " But I don't think yeah Port Adelaide for me as well. Yeah, I think Port I think Porter win by a tangle free. There's that they should be Thrones it like you said. Yeah, I yeah well potential. Anyway, John is said here on Facebook. You can't kick 20 goals and bare bottom side. Well, I'm kick 19 know pretty close to the Old Maid 20 and yeah, it ain't on the ladder. So you kind of can actually team kicks 21. Yeah and Pete said, what are your credentials? Who are you?", " No straight Markel Bingo love-40 like football. Yeah, just our opinions. Exactly. Don't take them to the bank. Yeah. I think I'm powered by favorite. Yeah, I think Richmond looking pretty average. The defense is just bleeding with my cheese and and they're sending looks pretty out of form as well. Yeah, but we also have the holes in it those sometimes that's that's it. I'll show you right it doesn't", " Chase credential crazy did yeah, we know it's-- we know cheese North versus Adelaide so is set on the bottom Port Port. Yep. Yep. Yep North Vee the crows 17th verses 13 to what do we think crazy bounce back? This isn't a z. This is at Marvel. I Marvel how my videos hey, I'm gonna go the crows you have I think I think not have north of the most under like like they've gone I didn't know how they yeah, if it was a Escape it all to quarter game then.", " I'm be tempted to pick North like you mentioned last over the weekend. Yeah that they just fall away all the time and they did forward big-time against Hawthorne, even though they were in control of the game. And even though the crows have their little issues. I think their Midfield is way too strong and if they can just work out the structures up forward. Yeah, they'll get this this done and pretty convincing which I reckon 20-plus points. Yeah. The crows are a good side. I think that yeah, I think", " Definitely got some deficiencies. I don't think Don Pike and the coaching great bar in their best form of the moment. I think he's been out coached a little bit as well. If I'm honest, I think whether that's a combination of them not following the game plan. They're wanting them to follow / them just being slightly out of form. But yeah, I think North just don't look very good at all. I just I mean that and they've also as you highlighted they've played, you know, we watched the north Hawthorne game and I said to you I was like no no whores. I'm gonna win this game and they were like,", " Like, you know started to really like the lip idealism Point fairly down and you will like what he's talking about and also trust me I've seen the I saw the first two North games they completely fall away and it happened again. So I I don't think that's going to get much better. You know, they've got look, you know, there's definitely some some fantastic players within that group kickers and Huntington a doing him a daycare and Z balls still a very good player, but Ben Browns probably out of form though, like he's not that to be fairly.", " I mean a lot of people Tipton for the calm and he's not looking like that at all. No, he's not hasn't got enough space Defenders a reading his lead quickly and these days so I think he's been found out a little bit. Yeah. I think he can overcome it. Yeah, but obviously delivery into the forward line is to improve a little bit more for him to be able to do what he does best is which is a Straight Lead and kick off because once he's out in the open nobody's stopping his not Mark he takes it the highest point is everyone.", " One talks about he's so tall anyway, and then he's got an unbelievable. Kick. He's pretty Deadeye Dick. Yeah, and they recruited heavily for the outside run. So they recruited heavily to you know Pollock and all these guys, but it hasn't it's made a difference but hasn't made much of a difference really at all. Doesn't if you can't get it out to them and that's that's what and they haven't got enough time. Ultimately. I don't ya and look Aaron Hall and Pollock have been serviceable without being exceptional. They just need some help and I think that'll come towards.", " The EPA again and War chest they do need a war chest. Yeah, and it's drying up back to the draft again that to the draft again. Yeah so crows for me. I think too much Firepower up for I think this is a game where we'll see that in full flight and the Midfield is going to be able to match it with North Melbourne then over time the power and towards the end. I think so like yeah, obviously like, you know crows are going to miss seedsman throughout a big chunk of the Year. Probably the whole year. But yeah, I mean I", " I still think there are very good very good side. They'll be a bit of Shifting but I think I should win this game and it should be fine at Marvel the West Coast Eagles versus the doctors. So Darby pretty likely with our five so six verses third. So Dockers Dockers at third Eagles at six, but obviously, I've only played three games. Yeah, you'd imagine fifo and play surely. I mean I yeah, he looked pretty cooked. We watch that game live the talk is that he's in okay spirits and didn't train with the main group today, but", " Jolie doesn't play. Yeah, and I understand that there's protocols in place for the concussion rule if Fremantle doctors give the a okay. If on the AFL I'm saying my own doctor over there before that match habits to make sure because if something really bad happened and I'm sorry to say this, but I think it's going to happen at some time. There's going to be players that", " their managers come back to me go your career was cut short so they fell because I didn't have a duty of care to these pliers when it's because the greens are too hard or all these rule changes or whatever the case maybe there's lawyers out there that know what's going on and and which stupid your frame mounted a risk not only good life because a I don't think they are good enough teams even matchup with West Coast with with or without fire. He'd love to buy the Derby but particularly given the I fell on the team's it's", " Like an NBA situation where they can't haven't got as much control. Yeah, like I think there will be a met at some stage don't know this is not about the game. But at some stage there will be a man and tree I think mandatory one week off when there's a concussion that's been discussed plenty times anyone but it looks so we assume is not let's say let's look at this. We're talking about this on Wednesday night. Let's assume that's we have to record it enough ahead of time. So you guys have enough time to listen to before the round starts, but I imagine he won't play so let's say he's not going to play so I mean, but even if", " Does play West Coast? Yeah, absolutely. Yeah, that looks amazing. We saw the second half of this last week's game against St. Kilda. Jane Fremantle should not have won that game at all. No to secure his inability to kick goals is what cost them in the end frame an accuracy was horrendous. They butchered the ball without and if Fremantle didn't have Michael Walters, they would have lost he was Sublime and I think he's participating to be even keeps his form up. You'll be in the squad for a", " I think he's that good of a player. Yeah, but again the 130 points like eating round one looks like a distant dream then Evan getting close to that ever again. So yeah for me the Eagles because I'll just pile on way to me goals Eagles by a long way. They've got so much talking Burrows as you've highlighted Gap, you know, it's he came back and had an incredible game last week and you think he's just going to get better. It'll be interesting to see how do you know where amazing we think this? Well, are they gonna get stuck into him? Who knows? I hope they", " I hope they just are recognized. I'll be something there will be but I hope it's minimal. I thought it was disgusting from the the pie supporters last week. They'll burn him. I was the point it wasn't that loud though and at through the game and kind of dropped away. I to be honest of Duty and 30 touches, but it's probably spur demonic entity tearing them apart. So yeah, I'd be shut my mouth that was always going to happen though. I didn't really care so much about that. But yeah, it's not it. Yeah it but it look they'll definitely be something apparently the", " It's pretty much been, you know, buried even Josh Kennedy was speaking throughout the week saying that like just don't it's not necessary to boo brochure. But you know, it is what it is. I'm sure it'll happen. Regardless. Yeah, look I didn't frame L don't have the the power the game plan the the cattle to get to see light snow. I'd be shocked if Fremantle on this guy. This would be what the biggest upset of the I think today. Absolutely. Yeah on the Sunday. We've got the sun's versus the blues that", " Canton Blues night versus 16 s pretty interesting game. Now the on the paper early on the season. Your thought is is looking pretty darn good is another spoon spoon a spoon rank up, but don't cut it's been cut but then the blues have been pretty in games but again still not winning them and the sons have been in them and should be 3 and zip because that that mean that's why one point said, well that letter which they should they should have won that game that we won that game is yours. But let yeah, so what do we think the sun's can continue this this role? Absolutely they can and the", " Thing that's stopping me from picking the blues is for those of you who aren't in Melbourne moment. It's actually been quite a cold day today and it hasn't been overly warm this week. And I think if the weather stays cold or cool wish in Melbourne then going up to the Gold Coast where probably humid. Yeah. I think the sons will have the advantage of being able to deal with this a greasy conditions up there. I'd love to see the boys win this game just too.", " Throw another spare in the work. We're really nice real sections of LA and just to give their supporters and then the players a bit of Commons because it's frustrating when you play a sport where you know, you're almost there and you're constantly lose. It's like when is it my when am I going to get this when we're going to this win but hats off to the sun's they've got a really good structure in place. Stu Jews got them all wanting to play a pretty good brand of football. I am I'm actually really looking forward to this game and it will be really interesting. Yeah, I think it'll be pretty fascinating because I think it sounds funny. Sorry. Yeah, I think sounds familiar.", " And the sun's kids look really good. I think they've got actually some decent depth which is like the first time I've said that many much hands down in their whole history. Like they've actually got some weapons that it's time we ever talked about depth at the Gold Coast was the graveyards our dig in. Well, we in the season preview, we literally sat down and had a look at their website and read through the turmoil. It's like to just to figure out if we lose that we like it was it was well or 13 plan and", " And to their credit, oh my confidence having a laugh on radio lockets it I looks great that they're gonna they're gonna get smashed throughout the year. Let's not get too. You know, this is not some fairy tale win, but they'll probably win six or seven games this year, which is that's awesome. Really good. It's really good for football is yeah, and that will that as we say, but we even though we you know talk to piss out of them a little bit. We obviously we don't ya you have to if you don't want coins a football to be a complete disgrace like I think for the sake of the game being trying to be National", " Are they? Yeah with Brisbane looking really good and Son's been semi competitive. Hopefully they win a good six or seven games that are be great. If so, this is an interesting game. Look out. Yeah, I think that I think the boys are have a real chance of winning this they controlled sections of the game against the Sydney Swans last week, which I thought last year there weren't very long sections that Carlton actually controlled a game like there was small passages. There might be a stoppage or there might be", " be a two or three minutes section of play but it really wasn't that much but there was a good solid like nearly 10 minutes apply at times. I know we're really excited clutching at straws because I'm gonna grow this is but that's at least that's something they are building. It was yeah real good for quarter performance, where where they do that and they've got the best Personnel on the field. They're going to be really hard to debate and they're going to start believing themselves. Yeah, obviously the kids they've got the guys that have been there for two three four years now I started to", " A bit of belief in themselves. Yeah. Well so it look I'm not going to be surprised if the blues get up and win this game. Yep, but for me up there, it's the sun's eye. Yeah, I reckon I'm going to go with the sons as well. This stage be interesting to see the ins and the outs but I'm going to go with the sons. It's a very very long Ball. But yeah, I'm going to go with the sons as well. But I look Carlton are going to win a game in some stage. So they'll win a good you know, look, it's hardly see these both these teams win round anywhere between five and eight games, I think.", " Sati I think Bolton needs to win more like eight games because I think it's been pretty garbage. I mean if he wins five games no, I don't know if he survives eventually those five teams are I guess yeah who needs like Hawthorne Joe long, you know Richmond like I like you think you'd be weak but beta big Melbourne team or two big melon teams at the Met and helps. Yeah. But yeah, I agree. I think he needs to be closer to the 8th and student tutors. Absolutely because yeah given that it will there it's hard enough to get a coach to go up to the sons.", " Let alone do anything else. Yeah, and then into so we one question here with on Facebook does do we think Sam Walton can get the rising star? Yeah. Absolutely. Like I like he's obviously such a good place just been offered a two-year deal, which is the max that they can offer at the moment around sort of 450. Yeah, maybe the cash will get him to go nuts. I don't know. He's a pretty good player. He's a very good player. Yeah, I do I think Rosie or yeah, I think Rose is the pick for me from Port Adelaide to take it as usual.", " He's just saying that consistency but it's so early in the season and it depends how teams want to nurture their young players. I mean we saw last year with Davis jr. Cat North Melbourne could be in for a week or two and then they bringing back and rest him. So if he's not out in the park on a weekly basis, they need to play roughly 19 to 20 days to really be a legitimate Contender. So depends how Carlton manage yeah. He looks like he's set to play.", " The whole season so yeah, I think it's I think he's a great chance for it. So great question. Yeah, I think yeah I got here. He'll win at some stage and last game Saints versus the Hawks 10th versus seventh interesting game. Both teams have won two games so far this year two games and that's that you will would have painted this in by how much yeah, you would think on the Hawks by a very long way but not not convinced either neither team has been noticing either in any of their", " games. No, but I'm going to still going to have to go with the hog. So I just can't count given, you know, how much we watched a lot of this and that's the thing. We actually watch that Sunday night game security versus Frazier and they just butchered the ball so much and their wins haven't really been that impressive. They shouldn't have beaten the sun's so yeah. Absolutely. Let's be honest and again a bit like Collingwood Hawthorne's defense while it's undermanned at the moment. They tend to just absorb the pressure of him.", " Have 56 and be able to repel their I think obviously Chad. Wyngarde had a slow start but then political the game but we'd gone. So that's going to help him and obviously another game to Scully. I think it'll better yet. Look better for the run yet. Look it was it MCG. I have no qualms in picking Hawthorne being at Marvel it brings it back slightly. But yeah, I have to go with Hawthorne just bit more experience.", " The defensive sankyo don't how they're going to stop Bruce gunson peopple. Oh, it's just one guy for drift forward as well. Yeah, and because yeah, Sicily obviously ready to play very well and straighten as well. Yeah. I think there's just too much experience social points here. And I think that's because I back for I just I don't know that even though both teams are playing fairly poorly and it's still don't think either of them top eight. So I yeah, I think the Hawks get up in a really down about it.", " Tiny gun. Yeah. Well like last week I thought yeah, I think I think Hawks by about 20 25 points. I think that I've so I got it done. Yeah. Yeah. Well, I just think Sakura still missing so much stop. They'll win a few more games this year, but I don't see them winning much more than six games for the kind of at Max you're going to get beaten down by a bunch of teams. But yeah, I think they're just going to be super competitive we can work out which is what Bruce looks better like so, you know, they've definitely got you know Billings has been good. Like there's definitely pieces of their of their", " well that that look better but I just don't sit in winning that many games do I think they're you know, I don't think they've got the greatest coaching group, but I think that helps but on top of it, I just don't think they have much depth. They really need I can see the notion of picking up a hand and Bri because it will be great to get a very good all Australian mature Premiership Premiership Hodge type of thing like copying the Brisbane thing, but that's not an", " And I need to try to find that but that's not in him. Anyway, hopefully Jack saving he's back. Yeah run, but it's well, let me good same hopefully he comes out and plays. Yeah. Look, this is the thing. I don't want to be too harsh on the science because they've been you know bad around pretty heavily. But yeah, you can't get that. You know, we were shocked really at how inefficient they were going inside 50 and how much they were just insanely Butch the ball live beyond belief. Yeah. And then again, how long does that festering in the plays mines are?", " It's so early in the season if that's the kind of decide of a bun now. I mean what's going to happen? Yeah in a few can turn around that quickly in most instances. So I think that stuff tell me something don't need to work on over the break. Yeah and me G and hopefully they can turn around. I really can pick up some more people to give them. I think I need to go to go to the trade period as well anyway, so let's do a quick sort of recap our we both thinking swans. Yes once is wrongs over the geez. So we think the Pi's over the dogs yet pots again.", " We both think Jang over the John's. Yeah cats for me. And but this is the type of game that they might say loose down there. Yeah, just a giant applying very good 40. Yeah. Yeah, but at the same time, but after that West Coast loss, I'm still not 100% convinced. Yeah, and Richmond are I think worse than people realize the Dons versus the Lions. So we're spending so where's all your gun lines? I'm gonna I'm gonna run the gauntlet with the lines one more. Obviously. This is a game that the the you could see them last year losing the lines after having a bit of a bit.", " Up and about but I think I think they've learned enough from them. Semi convinced. Could Coal Power versus Richmond? Yeah port for me. Yeah. I think I'd just going to full strength Richmond. I think they could definitely challenged this game pretty seriously, but that they're not even close to that at the moment North versus the crows Crow. Yeah cries for me as well. I can't copy north of the moment. No Eagles versus Freer. We've I think the Eagles Eagles here look too strong. Yeah, and then we both think the sun's over the blues Sons. Yeah, really entertaining game by this guy Scott. Yeah and definitely won't", " be surprised if the blues get up in this one. Look they have a crack. That's the thing and I really liked it's not just because I like the team at least the sons of having a crack in the ice. So far this year you have to say you've seen a lot of effort and that's all you can ask for us, you know, they're constantly their second efforts are better. They actually look all right, and I think if they bring that to the game, they've got a real chance real chance. Yeah, and then the sites versus the Hawks. We think the Hawks Hawks. Yeah, I think probably hook Smee. So thanks so much. I love that. Thanks so much for listening guys. We really appreciate it.", " I'm watching if you're on Facebook live. Yeah, massively. Thanks to everyone watching. Thank you for listening. Yeah, it's been a bit of fun couple of comments. Yeah, check it helps to home. Hops time.com W craft beer delivery service great sponsors of our thanks to our producer old mate are thank you want to be a legend again or maybe on the game. Thank you. Check out all this content on YouTube and Facebook. See you later. Enjoy the for the footy."]}