{"showID": "0A0SL2WQhWgGV6phvwJgU7", "show_name": "Variant Podcast", "show_description": "The Podcast you deserve.   Like Variant Covers in a comic book, the Variant Podcast offers a unique voice in the crowded world of Comic Book podcasts.  Support this podcast: https://anchor.fm/variantpodcast/support", "episode_name": "Variant Podcast", "episode_description": "The Podcast you deserve.   Like Variant Covers in a comic book, the Variant Podcast offers a unique voice in the crowded world of Comic Book podcasts.  Support this podcast: https://anchor.fm/variantpodcast/support", "transcript": ["Towns are quoting someone that I'm Gonna Leave it to start. Hey, welcome to it's a very informed cast. I am Pedro. I'm here with Kim and I'm here with Aiden who did the hee hee hee hee that leaves one person to that's you Aidan. What? Oh, yes.", "There you go.", " So pretty much what varying podcast is about it's pretty much just going to be a podcast. I Like Comics and we have the variant covers of comic books. We are going to be kind of like that. We are a little different. We're an alternative to the main podcasters out there. There's a lot of great podcast with out there for comic books. If you really want to read them all listen to them really but we're just going to be one of those I would talk a lot about DC we talk a lot about Batman will talk about Flash soups of exam Shazam all the guys. So talk about avatar Last Airbender.", " Her age, but I would even though it's considered actually a part of Dark Horse which in a way is considered part of the DC comics bat so it on hold all Workshop. So that's what we do. We are pretty much just you know, why I'm sure people wondering why do you want to do another comic book podcast? Well, we just start that because we just love talking about Comics or I like time of comics. I like Tamil Batman, and I've always wanted to chat to more people about it, but no one ever likes to listen to me.", " So now you guys are stuck with listening to me on internet and if you know what let's just leave me and stop following us, but I'm sure you'll love it because we're going to do a lot more than just talking about Comics you're going to literally talk about whatever we we can think of but what I would you guys think? Yeah, we will talk about all the fun stuff.", " Yeah, well not well not only talking about Comics talking about our feelings our feelings. We can talk about feelings deep very deep. Yeah, you know, you're so red right now hit it. That's okay. They can't see you. They can't what I just explained the how to how you look right now. Thank you - so I got here at me Kim and Aiden Kim is I would like to say a novice. Yeah. I am super novice. What kind of books and Batman all she knows but Batman is what I tell.", " About Batman and Batman. That's what it shows how we watch like the movie like 5 times y Sofia I watch them for twice and then we got eight into here too. It is a big comic book nerd however out of a comic book, but he likes the he knows everything. Yeah the tell me more about it. What do you know what you know, what do you bring to the table?", " I bring an extensive knowledge her like library of knowledge about Daredevil. Okay? Well, that's a Marvel. What else do you bring? We don't like Marvel here. Apparently no, I do. I don't mind my robot. You want to see you bring such Daredevil. I'll put you on the spot well.", " I really love Batman vs Superman. There you go. Okay. See now now now he's just trying to get to my side of the feelings because he knows I love that movie when everyone else hates it that's like the one that's three hours of straight can refuse to watch. All right. I just can't sit still for three hours. It can sit there yourself with three Alice's mother Miriam that I was Harry Potter. Mhm. I was two and a half. So it's better. Nobody has like three hours. He likes the unedited version and I'm just like, oh my God.", " Yeah, since we got we're gonna do little car a quick little break and then we're just gonna jump right into our news. We're going to talk today a little bit about the Joker just a lot going on to joke last couple of weeks a couple weeks last couple of days really talk a little bit about the new Batman movie coming out in a couple of years the new guys that are being, you know rumored to be part of the of the project and then we're going to have fun when I'm talk about in a little just broke today. It's Spider-Man.", " And back again. See you my thoughts on that and I'm sure Aiden has a lot of feelings because you love Spider-Man and we have a going to have a Batman quiz for beginners. Yay. It'll be fun and entertaining for you. It's gonna be great. It's gonna be super simple. And yeah, we'll be we'll be right back.", " So first things first, we're going to talk about something that's been in the news for what maybe a couple of like maybe a year or since it came out saying that it was gonna have a movie The Lovable clown Prince of Crime is having his own movie Joker coming out literally next week getting chills. Just thinking about it. You can't see my shirt as well coming out next week joking Phoenix apparently is phenomenal personally. I think it's just a copy of the Dark Knight Joker, but that's just me.", " Um, but it's been getting a lot of good reviews. It's not rotten rotten tomatoes, which is a rare for a DC movie more to it won the best film in the Venice Film Festival, which I have never seen a movie kind of superhero movie go and get that butt.", " getting all those a client like a getting all those Awards and whatnot still brings a lot of negativity and I think we were talking about that earlier today about how a lot of people have been coming out of the Woodworks talking about how Joker movie comes out is going to feed a new", " Group of people that are quote unquote on the edge of becoming like Joker and like doing Joker ask things and so I don't know. What do you what do you guys thoughts on the on the on the on the thought process of making that actually become a thing?", " I don't really get why everybody's why do you say that because it's the Joker he's supposed to be controversial.", " He's crazy. What do you think? I don't know. He's crazy. That's that's that's a backstory that I know fell into some acid or something, right? That was an acid. Well, that's that's that's Harley as well. That's that. Oh man. See I know so much was a joker. No, but here's the thing to think the biggest issue for me. Is that one? You're making a movie about Joker like what do you really expect to? It's a rated R movie. It's not for your little kids to go see it.", " Three you telling me I can't take you can take his it's like it's like swimming and Johnny's birthday. Next Friday may not be the best thing for a little Johnny to see well maybe as a parent to Little Johnny. He might need to step in and know what's best for a little Johnny, but that's just my opinion. He handled Deadpool to pretty well. That's the problem. The problem is as much as I love Mark Hamill and and I low down in the Batman animated series it did it did.", " A very poor job in portraying who the Joker really was the Joker and the animated series was as funny clown happy-go-lucky. I did was in the paint some fish poison some fish and made him have a smiley face funny stuff, but joke is not funny guys a psychopath. He kills people in those other things to people that shouldn't be he does a lot of things and when you went to movie comes out and they say, hey, we're going to have a movie come out of the Joker. My first problem was why would you do that?", " I like I think I talked to you a couple easy about it later. Why do you want to have a movie like it's like seeing you know something bad and you know, it's bad but you don't want to see it because you know, it's going to be really bad and that's Joker if they're going to do it the right way, which they are apparently because they made it a rated R movie not a PG-13 movie. It's going to be", " Weird it's going to show like a way it's going to show people like, oh you can just be crazy if at things happen to you, but I think you mentioned them in the show and the movie I know from the in the killing joke. That's what it says. Like all it takes is a bad day and that's how you spirals out of control. Like if you don't if you don't know the backstory The Joker we should know. I feel a little back story The Joker he was a comedian before all we know about him.", " Ever we've ever known so this movie going to be a brand new thing. It's completely out of any Batman art doesn't really exist doesn't it's not a real things only. This is own little pocket of whatever what all we know about the Joker's one. He was a comedian to he was a bad comedian three, he got into some bad decisions with people he decided he needed some money because he had a wife and he had a pregnant wife really had a pregnant wife and two words are just one.", " Had one wife those pregnant just clarifying. I'm so clarifications important and he did money to know survive and being a comedian wasn't working for him. Right and he decided to join this little gang. So we robbed of Christ who robbed a skeptical all we all this is all we know about each other which is great. But now they're making a whole thing but still go rob ace chemicals and as he was robbing a scandal robbing use chemical Batman comes in to stop them and Batman does,", " Something I don't really remember exactly what it was that made the guy who just scared off and maybe running whatever the guy that joker is now he fell into the tank of acid and he became crazy you just fall in a tank acid friendly because ace chemicals had a bunch of a civilian around that's kind of dangerous. That's like a whole other issue so health code is she that's her best friend. That's why he's close absolutely is chemicals.", " Yeah, yeah. Okay, no problems here and doesn't make a okay. So that's all we know and it becomes crazy. Yeah, but there's nothing you know about anything else about him. And now you're making this movie that you pretty much paint kind of piecing a little bit of Killing Joke which is fine and then you're creating a bunch of different other things that you didn't really know about and they just assuming things about them and now you're just going to make it seem like this crazy thing and I saw this", " I saw this this post with the other day a while back. I don't know if it only was it was like how to make the Joker 19 and 1940s, you know, put them in a tank of acid and sake how to make the Joker in 2019 put him in society. So I think this move is going to be a mixture of both. I think it's going to show that people people can create someone like the Joker which ad I've never had a doubt but I've always thought it was weird.", " If someone can get pushed that point they can do it. But if someone if people bully the person enough and that's what they're worried about. I get that like the the people the Aurora families from the Aurora. They had the Dark Knight Rises shooting up there day sends a letter to Warner Brothers asking to stop the movie because of that and I get that. I'm not this I'm not discrediting them for what they believe and I agree. I don't hundred percent agree with I'm like listen.", " It's not for like everyone but what did you expect when they were going to make a Joker movie?", " Yeah, that's my only thing if I understand I understand the record it coming from I understand their frustration. I understand why they're worried because it could essentially bring someone, you know, push someone that way right but you should have known that one you movie made and if you're kind of if it's a kid, don't bring him to the movie exactly same thing can happen with Deadpool. Deadpool came out member on that poll came out everyone thought I was a superhero movie. That's been my kid doll the bad reviews. Well the people", " I had to literally I forgot I don't know. I think it was a Deadpool. Deadpool official accounts had to make a post saying hey, this is not for your kids to go. See like you can't bring your kids to this movie. I mean you can use your own judgment and responsive. Yeah, we're not rich always got a responsible parent if you're gonna bring the kids to watch Deadpool, but like don't bring them in. So I think I think the joke is same way like you gotta have a you gotta be like, hey, you can't you can bring a kid into this.", " Can I play Devil's Advocate course? You can't unless you're here for hey. Hi, um, so this reminds me of what is I just lost the name of that show that Netflix show. It seems is why 13 reasons why I think you that, you know people all had access to and I think people sneak into R rated movies all the time and if it's forbidden and kids when I go see it kids are going to be sneaky enough and you know deceived enough to go see it and look what happened there. You told me what is it that suicide", " In skyrocketed it did or anything and you know places like across the world like Brazil and other places do then it's just like well you're showing someone getting their life on a TV show which they edited it out later. No, but that was like a year and a half later. They did. I guess you're not a half later. So if this kid if a kid comes in a sneaks into the movie, I don't know what this Joker movie is, so I might leave this joke a movie if I go see I'm being 100% honest. I'm super uncomfortable. So most people", " Who are worried about the violence? But where was everybody during John Wick? That's my thing. Well, I don't think it's you know, there's like there's difference between like action like boom bang bang shoot. You want a gun like bubble bubble of Silence, right and like like Twisted violence, but legs and John Wick a twisted movie. Yeah. I've only seen the first one is the next killer. He's a he's an assassin. He's a murderer and he kills people like he literally killed someone with a pencil. I saw that one it wasn't.", " So did the Joker but you didn't see him do it in the movie. Hey don't make at least a depends on what the guys brain it was kind of disturbing but I would probably not watch that. It gives it gives people the idea to do that too. Like I don't under I don't I just thing is", " Even if in gun movies, yeah, like John wait, all three of those movies are probably gonna have like maybe triple the kill count Joker's going to end up having but I see what came of cyanide but like it's different when it's like a pure action movie that people are expecting versus someone. That's like a mentally ill kind of like Twisted things which gets super like", " It gets kind of it can get you know, it's very touchy. It's something that's like it can get like really really messed up which is wheat, which is interesting why it got very long standing ovation at the Venice Film Festival if it's if it's a such if it's such a bad if people feel so bad about the movie, how come it got good reviews on well, how come you one film of the Year? Well, maybe because it was actually like a really well directed produced and", " And acted in the movie. That's what they're saying. They're saying spread on the bed base. They're saying it's one of the best send the Sydenham cinematic cinematic films of the year. I can't speak speak very good. So that's okay we have you is the highest rated comic book film it is and so that's the thing. Are we going for comic book character accuracy? Are we going to go for naught?", " For not. What's the word I'm looking for. We're gonna go for comic book accuracy or we're gonna go for not, you know offending people because if you're into a comic book accuracy, it's not going to be great. The Joker is a Twisted Twisted human like his his his love interest has shocked home syndrome. Like when people tell I remember when The Suicide Squad came out and people are like, oh my gosh, I love Harley and joke, but it's so cute. Like no you go. You don't understand like you don't understand and that's the thing. I thought I don't think people understand that. I don't think people have the and I get it not everyone.", " Knows that everyone think it's cute. Everything people are going to see and they're going to be shocked by what they see. I think I'm probably gonna be shot from overseas and that's why I told you because I told you I said be a great girlfriend. I told you I said, Hey, listen, you don't have to go see this to me because I have a feeling it might be kind of uncomfortable. You said no, I want to go see it. But like I say it was give me the heads up. I'm giving you the heads-up if I walk out of there you have nowhere to go for a jog with no I'll drive my car. But that's the thing. I think if people", " If people if you're gonna go for comic book accuracy, it's going to be twisted. Yeah, and even in the comic books like you got to pick the one like I was telling I was selling committed but because I got I'm getting this weird collecting phase. And yeah, you are really into like collecting covered. I think covers are great. I like you. I like the Arts the art behind covers. I like how old the covers are any likes variant covers. And so I like seeing that but there's some covers. I don't want to see there's some", " Over-sexualized covers that I think a really bad under percent and there is some really badly. I'm sure there's some really bad joker covers or like that. I don't want to see either like I'm going to send the joke is my favorite character all times. I think he's a very good complement to Batman. I think he makes that another great hero, but I don't he's not my favorite of all time. Now, he's really really good. He makes he makes batteries like the yin to his Yang, but I'm not going to see him go my gosh. I love Joker. He's great because he's crazy. I don't think anyone in then.", " Their right Minds Gonna Wanna Say That Joker's our favorite character, you might like rendition of a character. I liked believe it or not. I like Jared Leto's rendition of the character because he was a twisted psychopath. That's his fellow justices Rule and no it's not a cat release. It don't mean James go to bring Leto back. So, you know, it's like you're real like Renditions of a character Jack Nicholson's was great Heath Ledger's is obviously", " The best you got an Oscar for his I'm in it for his performance. I'm not gonna sit here and say yeah the Joker's my favorite character of all time because I know behind the scenes what he does. I know how crazy is I see what he's got does I don't want it not tell you that's my favorite character. That's gonna make you assume things. I don't want that. Right but the Joker is a Joker in the movie comes out about him. It's gonna be that and if it's not it's not really Joker and then people like me, I guess I'm like, that's dumb. I don't wanna go see this movie.", " She yeah, so you do want to see the comic book Joker and all its weird creepiness. Yeah, because I know that's what he is and I'm going to go in it with my headaches expecting to see things that I wasn't really wanted to see but I know it's going to happen gets a joke. It's not like I'm not going to go in there and go. Oh, I hope it's me happy go lucky. It was me super fun. It's me. Yeah, if you go into their thing is maybe like Star Wars, like don't it's not gonna be like Star Wars silly. That's a whole other podcast not gonna be like that. It's gonna be a little messy.", " It's pulling it's gonna be a little different than I didn't it's gonna be a little intense for people that aren't ready for it like camping in tents. Yes. Hey if you want to see joke if you want to see Joker, I don't even understand camping in tents. It's a whole other segment. But if you really want to see crazy Joker, you gotta go read The Cut The Killing Joke really Killing Joke understand a little bit about the character and go from there. But with all that being said the Joker is getting rave reviews from actual film critics.", " Critics are loving the movie. The fans are.", " The fans ever since social media became a thing everyone has their own opinion. So everyone hates either loved it or hated are both are both. Yeah, there's a there's that but at the end of the day, that's what that's what's going to happen. You're gonna have a crazy guy probably kill a bunch of people. What I wish we would get is a live-action Killing Joke not like that animated movie that I was not as good. So for the beginning of the game is terrible. Yeah get Joaquin, Phoenix.", " Or Jared Leto even better the Jared Leto do with Killing Joke have Robert Pattinson. He's what I want. I want I want or Jared Leto. I was joking Phoenix. I want a new Joker to make the three Joker's movie.", " Danny DeVito actually do if you're happy. He's penguin because we all know, you know, we all know that there's three Joker's in the DC Universe you put three Joker's in a movie against Robert Pattinson's Batman dun dun. I will I'll pay money market level Mark and Mark Hamill as the Joker to be great rumored for a this ew gross. So yeah, he has that's our and that's an S topics a good guy good.", " Good jumping in and get a Segway point to the CW crisis on infinite Earth. Whoo what? It's called crisis on infinite Earths crime having a president as I don't want, huh? What does that happen to cross overs of a million different things? Yes, that sounds things harder man into the spider-verse, but I'm bad. I'm bad you okay. Hold on relax. Well extra flesh season 5 relax relax relax. Did you see? Okay. So did you see the new Superman outfit? Yeah.", " Actually, it looks sick. All right, Brandon Brandon Brandon Roth is it is come on Ralph. He sort of and again looks sick. Great. Who else is coming into the movie that the show Kevin Conroy is finally playing live action. He's come. Yes, Kevin Conroy husband becoming Batman, but you only only Bruce line though is not going to be anyone else right is that could be back on itself? I hope that be great. It's kind of Quarry is the animated animated series Batman.", " The voice of Terry McGinnis they did that. That would be cool. That would be cool Tama getting this in there. So awesome. Well Tom, Tom Tom bailing Wheeling Superman Superman from Smallville. He's going to come back to Smallville. He's gonna be he's gonna come in a Superman Lois Lane from Smallville zombie Lois Lane shows. Well looks like a hotness is going to stream on like Disney Plus or something.", " CWD CBS CWD see universe is Mike and they're going to have a bunch of guys you're going to have both sides closing to be in there. Ashley. Scott isn't being a Huntress. Jonathan's psyche is going to be Jonah Hex. Oh,", " Tonight's event. You did get Josh Brolin. Josh ship is going to be for the Flash in one of the one of the ball one of the universe's the 90s fire. Yeah. Yes. No thats not nice watch.", " I don't think this one is lunch.", " Yeah, John ship. Yeah, is that the funny? / yeah on fact. Oh, yeah, but he's already been on the flash. She's already in the flash. Is that for your flash again? Okay. Well that means Mark Hamill could come back and be a trickster Mark Hamill has been killing like murder every time I couldn't take Mark Hamill series as trickster and the Flash series because I just thought he was a joker loved it. Yeah, but he just sounded like the Joker doing it was like man wasn't the trickster and the Joker some very similar they do something.", " They are very strong ones jokes jokester right are Joker. So it's like but the trick the trickster, I would like I'm not really well into the flash Universe Comics, but I think the trickster is the flashes version of The Joker just not possible, which is yeah, which is ironic don't Walmart. You get Pop-Tarts which are really good. Then you get the Walmart brand we get Target. Okay, but it's pretty much all the trick serious.", " But the kingdom come I have never liked much of the CW stuff. I stopped watching Arrow season 4. Yeah, I think it was the last season it was okay bad. That's what it becomes bad. I stop there. You just got to Broody forgets he got some yes, that's the problem and then the flash got the Flash.", " Really good for like two seasons and then what's just started crying? Everybody said cry Iris Iris fast. And then I have never lost you. I've come to realize I was like come to realize about the flash. It's the same thing over and over again. It is already it starts off. I'm not fast. It starts off with him finding this really fast dude against them and he can't beat them. He's depressed and I was like seven says we are to flash Barry who gets killer to gosh. I love you Barry and then he's really stupid it is and then", " Finally gets has and beats the person that he dies. He goes into like some Sweet for so he goes away episode Iris. Well, then that's it. And that's why some poison Flash and Supergirl. I washed it first. I saw the second season. Oh, it just looks bad. The census was really good. Was it I just saw it like a second season was good on the first season. I remember because it was on CBS. Yeah. It wasn't even I don't know. I never watched it. So I was confused because it was like on a different Earth than the flash crossover flash would go on to like", " Space and destroyed the whole space-time. I'm on a different Earth now guys, where am I? He doesn't cry here too because of a lot but he so that's mean CW did a good job and and they doing what they can with what they have. I remember when they try to bring in Suicide Squad they had heart the heart and they had Harley Quinn had Tara Strong faced hard. That was great. I know that I jumped out of my couch and then WB Warner Brother said, hey, you can't have", " That because we're going to we're going to use a Suicide Squad an actual movie. So then he pretty much they pretty much killed off in kind of Suicide Squad be cut off the best order. Yeah, they got because they literally killed off the entire Suicide Squad which probably was the best. I've Arrow season 2 or 3, whatever I don't remember that at all. Yeah, it was two or three it was sure he was deep. This was a boomerang a boomerang was in it Deadshot.", " Bring it on over Captain them that shot was in there was the - Our Girls part of there when he died. I wasn't that shot by forever. I was definitely slate. All right, relax. Okay, but but he was good Guru. They had Harley Quinn, but they didn't show her to just showed her the Shadow and had like in the background you can see the hair and her talking so that's pretty cool. But this he does the best they can with what they got again. They will have a lot they", " Rtb. Good stories started the stories got bad the stuff. You gotta remember to see W is also the the network that brought us Gossip Girl. Xoxo xoxo. So like you got to bring you gotta you gotta realize smell like they're not going to have then unknown to Delhi is not known for their Prestige writing. Okay, then we'll have like the writing they have somewhat the stuff but I really yeah.", " But listen tell you but yeah, we don't take another quick break and when I'm going to do this quick fun Batman trivia quiz gold and see how our friend here Kim. Does this quiz stay tuned.", " Alright, so we're back with saying podcast. We're gonna do a cool little game here quick. So quick game will be won't be more like five minutes just a little bit of a Batman trivia for beginners with Kim here AKA come here. These can be very simple Batman questions that everyone should be able to learn except me. Well, you should not and we'll go from there. Some of them might be a little difficult but they're not really difficult to just kind of send part of all right, so we got like that's a lie. We're going to start.", " Which super villain once broke Batman's back a stop? Don't tell her a Killer Croc. Stop it on. Tell her be Ra's al Ghul see the Joker don't look at him or D beIN the look at her you can't do it. Can I photo frame, you know?", " If you get this one, right you can phone a friend. Yes. So the other question is which super villain once broke Batman's back side note. If you watch The Dark Knight Rises, it would know this I watched it but I just oh, oh, I know who's in that woman's back. Oh, what's the last one? Right? It's a Killer Croc be Ra's al Ghul see Joker. No, we're D beIN Divi theme seemingly Lila.", " Thanks for the tip friends, too. What are the names of Bruce Wayne's parents a James and Elizabeth be Thomas and Martha see Wayne and Alice or D George and Elaine.", " As she looks amazing. I'm just like Mama y Papa wait. Wait. Wait. Yeah Wayne is hello our billionaire. My name is Wayne Wayne Wayne. So the also the question again, I'm gonna go there was a James know there was there was a James one, huh? And who's the other compromised James and Elizabeth be Thomas and Martha.", " Thomas and Martha Wayne see that's why I don't know that's a challenge for Martha Martha. Exactly. That's right. That's all we're trying to say. There you go. What is Alfred's last name? A Chatsworth beagle Penny's Worth or win him?", " I know it's not Penny's worth. That's like the weird creepy clown right? Are they give those know you can give her even give her 50 percent. So you gotta give her to Chatsworth beagle pain is pennyworth or when him so actually as a TV show now. His last name is the name of the TV show. She wouldn't know that I don't know things.", " Okay, I'm gonna I'm gonna 50% of the okay. It's either chadsworth or penny worth something. I feel like it's a pennyworth because you gave me a little look about that. So is that that my friends that know that you're part of that your fundraiser?", " Don't hence whatsoever. You did it final question. Oh for all the marbles for all the marbles. Oh goodness. What are the names? Oh you gave me this one. I don't remember of all the Robins. I don't know the robins. I know dick Grayson's one. Uh-huh. That's all I got. That's the only one that I remembered. I know there's for Robins even", " He's up. There was three. I know the third one is his son fourth ones his son his son died of the last one. Can I phone a friend? Yes Aidan help help me kick. You can give her two of the four names because already has one. Can I score whether everything 5 I think there's technically for it's only five, but I don't like count carry as one because while I was messed up, but", " You know in the continuty of the comics and the show's I think there's only four carries great. Nothing wrong with you got nothing against her but I just think that we should get the actual ones. So the answer is no I'm going to find it. I know it. Well that goes this way you should know this one, but I saw this one on your so this is a funny story when I first stop touring throughout your Facebook. I I saw this photo dating by the way, my first", " Facebook I saw this photo on your profile pictures and I thought it was really cool. And then I realize what that was for it was a comic book. So here we go on Earth to who was the daughter of Batman and Catwoman a Oracle be Katana OC interest. So it's dangerous. There you go. Yeah. So when I first saw when I first got in here and yeah.", " And then I looked at the comment and she said oh, yeah, this is Batman of Catwoman's daughter from Earth to I'm like stop. How do you know that I just Wikipedia and then yeah, I was super impressed. I can't find these names. It's okay. It's okay. That's it. Not enough. I'm almost there. And this is just a loading. Okay. Oh, oh, I got it. I got it. However Drake because of you know, Drake, okay.", " So Dick Grayson Jason Todd Tim Drake and Damian Wayne. Oh there you gonna be next for them dies. No-oh-oh his know the third one the second one. The first one is what's the name of the Brisbane times degrees Jason Todd?", " And there was a voting on in the back. It says vote if you want him to die or not. And it blew my mind. I'm like you could call it and vote. Yeah, that was really bizarre. Jason never had a chance. Yeah, so that's all that now, it's the final once the final one from this to Mordor super simple to more so it's about me yeah, what is the name of the former district attorney?", " Attorney that later became known as Two-Face how we would want. I want to give you that. How are you? Hey, and now here is the final question for all the marbles. I thought the marbles were two questions do who killed Jason Todd?", " Well, technically the to face that called in. Kill Jason Todd. Is it your face? Is it Batman? Is it the Joker or is it pain?", " Is the answer actually that means I did ask her about me an answer. No OK hon. Mmm. So joke Joker kill them Joker. The name is everybody we discussed this earlier about this Joker movie, right? So you're officially a Batman a Batman fan. Congratulations. You got every question right except for the robins one because you got to look back in your questions, but I'm very proud of its it has to look back in my passions, but you sent me the answers. I just didn't memorize them very well to make sure I know it is very good.", " There you go. That's alright. That's our our beginners quiz today, don't you guys go back?", " And to close out our first episode ovarian podcast. We're just going to talk a little bit about the literally the breaking is it happened earlier this morning, but a man's back everyone's talking about it Spider-Man's back into the MCU. So let's get jump right into it in. This is a lot more excited about this than I am. So it in was what makes he is. Why are you so excited at Spider-Man's back because Spider-Man", " Is the future of the MCU I'm gonna be honest with you. Why do you say that as he's they've said about this the next Iron Man, he could lead the next Avengers because they've already into that. He's gonna bleed some sort of team. So now the Avengers going to happen again.", " And I'm just glad he's back now. Here's the thing that I have with to ask you.", " One it's a one movie deal with an appearance in an expanding Universe movie. Right and then from there.", " They can cross over into the Sony universe that they're trying to create. So how is that going to get it today? Make it a bigger deal for the MCU because right now what as it stands as it stands right now, they're going to have a movie coming out in July of 2021.", " And then he can appear in another as you feel MCU film. So, how are you going to make that?", " And say he's gonna be the future of the French of the of the MCU simple. You do a new Avengers movie, huh? He dies in that.", " Heads starting another future with Miles Morales. Spider-Man is little little did we know he's going to be in the next one calling it right now? Okay. Okay. Here's my problem with the whole Spider-Man MCU Marlins, huh Marvel and Sony debacle. I don't think there was ever a debacle. I don't think they're ever I don't think there was ever a problem. I can see that. I'll tell you why I think that last do like yesterday the Jonas Brothers.", " Count yeah, I'm saying it last yesterday. The Jonas Brothers account got hacked quite a quote by Diplo could pull out a bunch of really weird photos making fun of the Jonas Brothers. Everyone assumed it's great that he was like, oh, he's calling Jonas Brothers at oh, it's like it's a beef. It's a feud come to find out at midnight that day. They're doing a song together, which I have it was but the point is it was all for publicity. Yeah. Now here's my here's my thing about the Marvel Universe.", " These the Sony and Disney they already had this done because the contract was already done for another movie. Right? Right. They just I think I think personally that Sony", " I had nothing to lose by saying publicly that hey we're going to cut we're going to take them out of the show Marvel because of what you said. They set him up to be the next like Tony Stark. They set him up to be the next big thing because Marvel is Spider-Man. Do you see like if there's a whole thing of in Spider-Man DC Batman built the house of DC like Superman's first, whatever but people know Batman more than Superman.", " Marvel is Spider-Man. I'm a big Spider-Man family or not. That's one reason. I like Marvel. I'd only I didn't know who Iron Man was until Tony Stark Robert Spider-Man is the guy and it's ironic that the only character that back in the day Marvel was big into wasn't part of the universe and now there's another dead in Sony, you know realized realize As I Lay we're gonna we're gonna take them away because we want to get more money out of this which I don't understand what more", " They need because they are there actual reasoning reasoning they came out and said was because Kevin feige's too busy with X-Men but Kevin fight, he's already said he's not dealing with the X-Men for like five years. What kind of vibe he's doing Spider-Man and he's not spineless Star Wars. It's not something I really ruin another franchise everybody. I really believe I really really believe that there was never a few to begin with. I don't think that was and I think now and now and now the now the those are the those are release", " article on", " Thinks comicbook.com. Sometimes it says some time ago this today the said Spider-Man can now show up on Venom to because of the new more will do and that was the whole point. I think I think everybody wanted to see Spider-Man take on Venom, but I don't think this Spider-Man can take on Venom you could maybe but isn't isn't this Venom an old I never seen Venom preferably isn't Venom an older guy.", " Apartment 20s or early 30s mid 30s because a high schooler. I don't think isn't is from my knowledge of Spider-Man comes from the Animated Series flat-out being honest I've ever run into comic books. My it comes from the animated series of Spider-Man which I love those great. They're both the same age. They're right Venomous Spider Man like Eddie Brock. Yeah, it has brought version. He was like to see was like the fatah go. He was like the", " Order in Peter Parker was the photographer of The Daily Bugle and now Peter Parker now is like a high school's Junior and Eddie Brock is 30. So, how are you going to how are you going to bring those two together?", " Because I don't think I don't see I don't see it ever. I don't like it doesn't been working together for Venom to because Carnage is going to be the main problem there. So at it, okay, maybe they tell us a little bit in the beginning but then they come together destroy Carnage. Okay. Yeah, I mean it could happen. I just I just don't I just my entire knowledge of Spider-Man comes from I made a show which I get is not a very good at a very good source.", " Material because I made him shows like we literally talked about earlier today changes up to stuff a little bit, but that's all I know about Spider-Man but I do know that son is going to get 70 75 % of the stake in the move in the in Spider-Man and this isn't get 25 and they have to pay for the production. Oh, oh, that's why would you if you're dizzy though. Why would you do that?", " You don't you don't it's because I think that they put their well, I know for a fact they get 100% of the merchandise, right but I think so, I think of the millions of Spider-Man shirts and other stuff. Yeah. I just think I just think it makes up for it. I seen the field that they were so, you know scared because of the made him such a big deal that they're like, oh shoot now. We have to really put in Bring It Back", " And that's all they had to do. I don't know. I I'm excited. I know all my friends are really excited. I know, you know you're excited about it because I to see Spider-Man back and him see you. I never saw it as a crazy thing, but I'm glad it's happening now. You'll be good for comic book movies in general. Yeah and from there and I would do no one can stop it. So what I want from Spider-Man see", " I wanted to be on the run from the government.", " But they hire Keanu Reeves as Kraven the Hunter who taught down Spider-Man.", " That's that's what then he defeats Craven, but they set that up towards a Kraven the Hunter solemnity. It's from the director of John Wick directing the hunter only green or bringing the Sinister Six as the true main villain because we know vultures met what's his name the Scorpion, uh-huh due to that end credits scene. Mysterio is probably out there somewhere. I think if you look closely in the airport,", " Can see Quentin back in the back and then no, it's Polster. It's probably made some friends in prison. You're the hate your first Guys fan podcast episode 1 Keanu Reeves as the who Kraven the Hunter Kraven the Hunter but yeah that I think I'll do it for us or our first episode. Sorry about the Kinks in the in the podcasting. We're going to get when you continue getting better and I'll first episode of anything. First of anything is a little rough.", " But think it's some really good content in there. We talked a lot about you know, the Joker movie because it was very important talked a little bit. What kind of Dad we're going to like dip our toes a little bit into the CWD bombs hit the CW Crossovers and even mentioned that one which that could take another hour and then we did it our fun little Batman quiz and then I will just close it a little bit with Marvel, but that's what podcast is all about. We're gonna what even though we are talking more about DC doesn't necessarily mean. That's all we talked about. It just happened.", " Today, we had a lot of Joker to talk about because it's such a fresh movie everywhere news right now. We are going to try to do a joker review. Maybe next week don't know Rose. Don't don't don't expect it. I would probably not going to promise it when I try and I'll give her our takes it so it's gonna be a completely spoilered spoiler episode. So if you haven't seen a joker by then where I tried to pitch a spoiler-free page,", " Going to put another Jenga spoiler. It's maybe a hundred percent spoiler. So if you if you if you haven't seen it, don't let the listen to it. But yeah guys it was a great great first first podcast. Hope you guys enjoy, you know, follow us on Facebook Twitter Instagram. They're all at varying podcast. You can have check out our website. It's also very empathic ask.com. We're going to we're going to have some news in there as well. We're going to try to implement a lot of not just podcasting but a little bit of comic book news as well and we're not going to like update every", " All day, but we're going to try to get the best of the news that we can find that we can get online. Also shout-out to Andrew and jar for the amazing support Andrea John. Thanks guys. Yeah. It was great. We'll be back soon, hopefully and from there. We'll keep going. Thanks again for joining us for the from next for last couple of the almost an hour. Hope enjoy. I hope you guys enjoyed listening to some kind of book talk and I will be back soon. Thanks guys.", " Very well."]}