{"showID": "0A0SrnP0qm15L5Hv27sMAI", "show_name": "West Didsbury & Chorlton AFC", "show_description": "The latest news and reaction from Brookburn Road, brought to you by the West Didsbury & Chorlton media team. ", "episode_name": "West Didsbury & Chorlton AFC", "episode_description": "The latest news and reaction from Brookburn Road, brought to you by the West Didsbury & Chorlton media team. ", "transcript": ["So welcome to the West has been shortened podcast. I need your answers normal. I'm here we have rumack. I was speaking after west of lost 3-2 against stay with bridge in the FA Cup, which well with we will or we should have an interview with Jim will be interviewing broad cooker one of the management team, but we're recording that before this, but I will leave the Postmaster General to Stew.", "McCain he's probably seen more of it to make supper sir. I've got I've got memory about 30 seconds of the much. So so so for yourself as a co-chairman, how was tonight are ours is an amazing occasion and you know to think already we've had so many amazing days out in the evenings in the you know still in the first week of September, you know, I've been crowd of over 500 a Tuesday night with the work with the weather like this. I'm not apparently Bake-Off started tonight as well. So, you know, we've been", " Grams by Channel 4. It's a know. It's amazing to have this many people are in the noise and the just the atmosphere was just incredible from start to finish obviously on the pitch. You know, I far from boring game. I think it went to the other Spectrum from the nil-nil in the you know, it's day the bridge were not a lot happened and we just clung on for the last 10 minutes, but tonight, you know, obviously that first goal for my eyeball and it's an absolutely amazing finish and I managed to catch it. I was doing a million and one jobs tonight, but it's one thing I did manage.", " You forget anything any people just give her like a friend who I've got much of the Mesa too many people do that. But people who listen to the podcast to have not checked the result. We lost 3-2 West one wound up from my bowl and and found about 10 minutes in there was a pure limbs in there in The Showdown. Yeah, and then stobridge called to fairly quick succession which both fairly let's say fairly easy goals, but like kind of goals. I think that Rob Sadler in", " you'll be quite see you later kind of goals that Rob's are we quite upset that we've we've conceded and then we acquire is just on the stroke halftime probably about 10 minutes north of a half times in second half they will say let's let's say it's contentious go over the side, which scored where they it was is sent home flagged off side by the referee fug da fly by the linesman and overall by the referee, so,", " Yeah, that's their how the game went. Sorry. Sorry. Okay. Sorry. Just we've got a guest speaker. We've got a guest speaker. It's a Stephen Oaks who you are phone mate, and now I'm off to the bowl to make okay, so I'll meet you in the bowl. Oh really? Come to the Bowl. Yeah, we'll go for one night. But yeah for you. I how was how was that and so I think from end the stunned from supporters.", " Is everybody was really proud of the promise of up especially seeing as in any other person gets a any other game but like another game like it could have been it could have been a West Wind coming across a like they scored from what was ruled offside. We immediately went up there and it was giving off side which is marginal for me and slight lead home. So in another game another day, it might have gone a different way. I was it for you. Yeah. Yeah. I mean there was a spell pose.", " No got criticized a bridge those the spell from when they weren't one down to pull little just until the equal at week wires were. Oh, yeah, they like the kitchen sink at I was ten folds. Yeah, they looked that's the boot. The only point in the game like that 20 minutes where they worked. They definitely look three three others above as well. We couldn't handle absolutely and then you know credits are lots because Years Gone by we've gone to on down and we fold and they going to get third fourth fifth and we go in here what an amazing occasion but the equalized and you know gave as good as he got second half and they were", " crimp increasingly went longer and longer and longer to that fast one guy who was obviously, you know, Matt Cook did really well to contain for long spells the game. But yeah from from just an occasion from the number of people that you know getting down there at six o'clock and there's still people already coming in and you know people coming out to help us put Hive is on obviously like Mike and caffeine the beer tokens, you know, the guy from stay the bridge Thursday the student who was so lovely. It's Daily Bridge. Yeah, he offered to help in the car park before the game. He's come down with stage IV is on lovely young lad.", " I mean, it's like just shows what you know, what sort of a night is was that so many pits capture people's imaginations What Might Have Been and the game of football was deserving of the crowd I think and vice versa and yeah, it was like really in Saving and sales like 550 853 I think and we're you know, you think she's an axe in the past. We've put a call out a month ago old to ask people to come down because we really needed the support, you know, because in the past we do a hundred ten hundred twenty minutes on a Tuesday. No, yeah. It's like when I when I start coming down like you do it maybe a Tuesday and it be", " Literally 70 people there. Which a bit wish to be like, yeah. That's okay. That's all right. So, yeah, so to have this many people here and so obviously the atmosphere as well. I mean God knows what the neighbors must be thinking what's going on down here, but don't mean it put obviously are like agree. I was first so positive and see I've shopped on the islands on the way up people my out here people come and thank me for I don't know anything but you know, but I'm holding. I thought he put a price to come back her up. But yeah, you know, but, you know, you can just tell like the whole place has been, you know, it's been galvanized by providing the Lord to come in.", " And have no support of the deserve the success because it's been a lot of thin for us three years in the Feast of the thick end of it. Now, I really think you know, this is just the start a cat the Catalyst to boost our season and beer now Rick's eyes. Get back to League football. Now, I want to I want to play some League games. Yeah. Well, it's a yeah, I'll just say I didn't want to do the the introduction just let it just movie like it was absolutely great because I think like yeah, I could be in because when I don't can come across as being", " Yeah, just like very biased but I think I would have if all the for the other alternative gone off and come for another pine because there were so Overjoyed with a really good performance. I think. Yeah, it's just a really strong performance from from the boys especially against a team who like in the last minute like their keeper to make an incredible save to keep them to keep them ahead. Yeah. Well, that's", " He saved us like a long way. It's like he's okay the keeps on loan from my United. Is he I believe so, yeah. So yeah, so it should be more fries near post. But either way it's an absolutely fantastic night. And if you are to go out of the cup it is like I was gonna say the best way to go but I'd be like where we were pretty much equal to them. I'd say throughout like both our goals were like all the goals were fairly equal and the difference was", " Was the linesman being a rule for an upside? Yeah. Yeah another day that that goes that goes for us. Yeah, I think for me is our they've created a lot of chances. We've made some AJ's been for no. Yeah, they make the like they they deserve the wind must be clear about what that's the one is a sit down. You can go. Yeah, this is Mike going our way here there to the way, you know, I'm the but yeah, we had them hanging on at the end. Yeah, you know with Ten Men, you know, and yeah, we're going to go out. I want to go out first.", " It's three to Performance because we've exchanged one out, you know, the best of five with aside from three levels above who've got former conference pedigree. They are a big club with on my solution enormous cop. Yeah, you know and it's it was occasion just to have them are from to call think away or Jesus Lads have got away with it's like no because if they did not win that game of that going to such a Time the big question how many chances do miss? I mean, it's yeah, it's it's it's to interrupt you like there was a", " I know I was sent comments from their sport which mention of it like we were the worst team. We played this year which give them that like they've also this year and yeah, but I think they're they're probably aiming for upper mid table and the league but they're in I mean in a sense we probably were sad we play because yeah, well, I think I mean you go back to that game last Saturday in those, you know, it was a hot hot Saturday. It was a horrible game absolutely horrible the downpour areas.", " Made the pickerel easy appear in the way. They move the ball 15 to 15 20 minutes. I thought it was really real really showed their quality and you know, it's not like we've they've had to come here and they've had to play well to win and that's what's really pleased about it, you know good looks on the next round. Also, we want to watch the winners yummy like so hopefully we're gonna win it but no like I think what was yours really good is we've We've Come away and you'll that Rivers role in that cock that post in there for him. I don't think I've been saying that I've been up against", " Hello, and I think that's what that's what's key and we can take a lot of lot of tonight and we can go into that and you know, you're living now - Lords, no Crystal. Yeah, it was you know, there's so much more to come from this team. And you know, we I think we set up in the past. The first thing we have to do is how to beat this a Briny side and the footballs come early ahead of schedule and I think know even colder everyone at called Canada and had tie. Well, yeah, I'm sure that Jim will be in be so so we'll get something out to see that a lot of comments here up. Yeah.", " Just one last thing. I think I might have gone been delusional cuz I think even saw Danny idea behind the bar tonight. So special mention saying because I'd always have some things going on lately. But yeah, obviously all the volunteers every one of called tonight you support your contributions your time your effort, you know, always internet nights like this and that's what so thanks very much to our own bar for Steve myself. Yeah, your your efforts that have been really really really even like I'm also on the committee just to clear things up like", " yeah, but yeah, it's like when I went into the bar like the amount of hands behind was incredible and it's something that", " Call Janet will crowd the crowd like this on a Tuesday. We won't be able to cope with so yeah, the F Bank says volunteers. I'm sure we're doing an interview with Jim Jim doing interview. Somebody just now but yeah, so Robin Yount say goodbye. Yeah, thanks Matthew. Cheers Rob. Thank you very much. All right. Yeah something buckets the better never formally assessed. But yeah, he is.", " If some kind of Link has some kind of intro to her to gym doing into during an interview with somebody. I have no idea who's things for you, but yes, enjoy. Cheers. Bye.", " And just continuing the podcast with no got the manager here with is the game is finished but a magnificent code down of over 500 today. Watch this lose heart breaking the now at Natalie Distillery Bridge C2.", " It says Daft go beat but yet still so much to be proud of how did you see it? Yeah. I thought it was I thought it was a very very even gay my fault, you know considering the difference in level or for you know, the was almost between the two teams have got a safe, you know Fair plated stalybridge again of the corpsman of the think that's sixth time. They've kept the same team that same star.", " 11 so congratulations to them they'll go on a good run now and they've got some very good players, but from for me personally, you know, it's it's it's tough to take because I thought we deserved but we deserve to get to go to extra time, you know, at least but we've give absolutely everything and we've had a massive massive crowd on and you know, I'm I'm proud of the lads of everything that they've done but you know, we've got a were we've got a move on now and we've got bigger fish to fry now. So we move on and we go from", " I thought I thought we were good value for a lead. I'll be honest when this segment and I thought was a little bit worried. But again the character that is team. I thought we took it back to the game back off. Those. Are we five minutes bail after they scored the second and I thought we took it back off. Absolutely. I think we've took the lead and deservingly so I thought what was the better side to start with and I've been saying a saddle who I've been saying a sad there. Are we go get some", " Ian's of was going on. They look I just felt it. I would just feel going to go one little the the frustrating frustration for me is so uncharacteristic the three goals that we've conceded or the two goals. The third goal is, you know been overruled by the referee which just about sums, you know, I look up tonight, but the first two goals were disappointing and we've had a great start and then we've had to dig in now.", " We knew that they fought that we crumble because we heard him say it an early goal and these will go and probably gone to One open the font that it was Game set match, but not this group, you know, we don't roll over we don't roll over and get our bellies tickle for anyone. I don't care what level you are. If you're playing against as you're going to have a you're going to have a difficult game no matter what and the lads of dog in and deservedly got an equalizer and then second half that there's nothing in it 2nd Ave. Really? I mean, they've had they've had a few days.", " Chances are thinking of it the bar to go for to walk after the goal. But we were chasing at that point and you know, we've nearly Nick one at the end there to take it into extra time. And even with 10 men there I felt if it goes into extra time. I really felt we had a chance to go in on a winning the game wouldn't necessarily again. I said that shit too. There's one of the boys who don't think of donut often and so we tired legs last exit for the gonna be tired legs are going to clean a blue jersey because Whitney because no we don't", " we don't Tire, you know, we're well on well-oiled machine now and you know, we bring lines off the bench in the just a stronger slides that are coming off the pitch and that shoulder again tonight and I'm just debit. I'm devastated. I'm absolutely devastated which is crazy to say but not not for me it is what it is for me, but for the lads, I just felt like they deserve more than that. I pulled them in the changing room after and I said, you know, unfortunately Lance I've got a break something to you. We was never going to win the FA Cup.", " We're competitions now that we've got a chance in so never mind. I haven't yet. He said that someday have to explain it to bend steel because he's that thick has been staying with you thought it was a replay replay again as a support tonight when magnificent every day. Everybody was so proud of you and they could there was nobody", " going there was that sense of disappointment, of course that has but at the same time what I since I played I don't worry blow smoke you have Gap about we there's a feeling growing that were building something really special here and support us can feel it. Yeah. Well, that's what we've said from day one. And we you know, we wanted to put pride in the shirt. I don't think anyone who watched this game tonight can say anything. Other than that, you know, we've put pride in the shirt and lands that are going out on the pitch.", " The you know, the the doing the club proud in the doing the self prouder, we're trying to build we're still only want three month three and a half month into a job. We're still going to get better. We're going to get stronger. We're going to get fitter or I've got a I've got a very very good group of players very very good group of players. We've got a great dressing room and we're all buying into the same thing. So, I mean what you've got 550 fans here in the the, you know, walking off the pitch.", " Each there every single person's clapping them off and the deserve every single Applause at the Gap because they were magnificent massive. Thank you though to the fans have come out in the droves tonight and you know, the should be proud of the team and we're proud of them and supporters. We didn't do a man of the match Snape I can assume during standby to do it. I said to Josh I said man of the match. He said you kind of pick one up at 11:00. No. No, I picked one that 11 could you know, I don't think so. There was so many so many really", " Strong performances and tight, you know games like that. I don't think you need a man of the match do it's you know, everyone's dog in and everyone's worked as hard as is the person next to him. So I'm so proud but then I'm absolutely devastated as well as you know for because you know, we wasn't too far off was we were dubious goal away from taking a side that freely anxiety than us with a budget. I don't know how many times more than us.", " You know to two extra time and potentially penalties and going through our whatever. It may be so we can all that I'd usually played yourself prodi elides. Absolutely magnificent. Thanks very much. Thank you.", " so that was a boss Jim speaking to speak to the money abroad cook after today's 3-2 loss the first loss of the Season against a new bridge who are three three leagues of others less, so,", " three leagues above us and it took them to the Murray pie and a questionable sigh goal to to get a resort consensus, which I think says a lot about the quality of our team the quality of our defense and our attack and yeah, but the Joy on the stove richer basis full-time shows that they feel that they have got a waiver or little bit as I", " Write this and as I say this the still of West funds in the clubhouse Aurora all chanting the names of the players everybody's or whatever. It was a really strong performance for a team olive oil. And yeah or another day we could have won it sadly. We were missing out on playing I believe it's Marine which would have been one of my dream one of my dreams eyes, but unfortunately Marie work making the journey to watch their own child.", " And they were making the journey stable Branch. So I think they've beaten the pallium this evening next up for West a week today. We have a behold Stand United as there's no game this Saturday or buying Abby Horton. I stood on Tuesday, which will be another tough time. Yeah. Yeah. Okay Lee great performance vote.", " See you Tuesday. See you later. Mate League having just making his way home. They're having being shunted up in the clubhouse. But yeah, we're playing Abby Horton on the 10th, obviously with 553 here tonight. If we have anything near that next year's that incredible. Yeah, the level support. The season has been phenomenal beyond anything. We'd ever dreamed.", " But yeah, I think we'll need the supports being full voice again given but with experience I thought first loss of the season and yeah, which is always going to be a bit of a downer, but I don't know if they could have gone it could have gone a different way. We won't be doing a preview podcast for I'll be home soon. We might have another chat with somebody before hand giving this another week before that. But yep. Yeah. Thank you very much for listening.", " Thank you very much of EK. It was what one of if not the best experiences that I can remember down at Barone is a farm. I think a lot of fans would also say the same. It's just been absolutely electric and the the amount of support. We've got the seasons been magnificent. Yeah. Wonderful. I'm probably four points in Five Points at this point, so it's probably the best time to close.", " this podcast", " if you've got any questions or comments science to the West stems or if you'd like to be on a Podcast chat about your experience of being less fun. Honestly, we would be overjoyed to have a little chat with you about why you came start coming to West and what has kept you going back to last because I think everybody's stories really interesting especially at such a small but vibrant Club. Thank you very much for listening and as always", " Come on West. I'm so proud cut worst. Good night."]}