{"showID": "0A0TSLljzX8akWoSYqF6Hm", "show_name": "Unsolved Murders: True Crime Stories", "show_description": "Unsolved Murders: True Crime Stories is a podcast drama with a modern twist on old time radio that delves into the mystery of true cold cases and unsolved murders. With the help of an ensemble cast, follow our hosts as they take you on an entertaining journey through the crime scene, the investigation and attempt to solve the case. With many surprising plot twists, it’s important you start listening from the first episode of a cold case. New episodes are released every Tuesday. Unsolved Murders: True Crime Stories is part of the Parcast Network and is a Cutler Media Production.", "episode_name": "Unsolved Murders: True Crime Stories", "episode_description": "Unsolved Murders: True Crime Stories is a podcast drama with a modern twist on old time radio that delves into the mystery of true cold cases and unsolved murders. With the help of an ensemble cast, follow our hosts as they take you on an entertaining journey through the crime scene, the investigation and attempt to solve the case. With many surprising plot twists, it’s important you start listening from the first episode of a cold case. New episodes are released every Tuesday. Unsolved Murders: True Crime Stories is part of the Parcast Network and is a Cutler Media Production.", "transcript": ["Due to the graphic nature of this murder case listener discretion is advised this episode includes dramatisations and discussions of murder and assault that some people may find offensive. We advise Extreme Caution for children under 13 now enjoy the show.", " Mario sit", " How is Miriam she's worried about me. And how is the little one she's growing too fast. Sometimes I pray for time to stop and then I realized that if it does I will never be rid of the monster. What is troubling you today? I had a nightmare last night. It wasn't the first I keep seeing their faces the blood the mutilations. He's a become the things of my dreams.", " No, if I can escape them, but you can they have become so familiar without them the world as a dull shade. Hi. I hate them yet. Crave them stacked make any sense some yes. I can't help but think what is it Mario? It's it's terrible. But but I know it to be true. What do you know this monster? Whoever he is. I am not so different you are not so different.", " Current none of us are or can be every single one of us has the monster inside but the question is to what degree?", " The true nature of evil a question as old as time itself and in the early 1980s an Italian journalist by the name of Marios petzi was confronting this very subject. He was the star reporter on the crimes of a serial killer. He eventually deemed ill most Roadie Forenza the monster of Florence spezza became so consumed by reporting these slangs that he sought out psychological and spiritual counsel this led him to a monk named.", " Brother Galileo, but beanie, he ran therapy sessions out of his room in a dilapidated Monastery that was built in the 11th century brother. Beanie would service Betsy's Lifeline during the many years. He reported on the case. That's right, 25 years to be exact spets. He wrote about the monster of Florence from 1981 to 2006 spits. He's persistence was matched by the monsters relentlessness over the course of 11 years. He killed 14 people.", " People and he may have also been responsible for another double homicide several years earlier, which would make that number actually 16 on the monsters victims were all couples who win into the Tuscan Hills at night for a secret rendezvous. Who's the killer would watch as the couple's got intimate then each strike when they were the most vulnerable most likely right before climax all victims were killed in their cars shot at close range. The female bodies were mutilated their genitals removed Within.", " The number of victims attributed to one person may surprise you but the number of suspects that have been interrogated over several decades will shock you that number is over 100,000 unbelievable despite the plethora of suspects. The monster has never been caught the story still holds a fascinating Allure for many Italians journalists and writers alike. So we can understand why spatsy devoted so many years of his life writing about him the killer may still be", " a out there reveling in his old age at his criminal Masterpiece, or he may have already passed away regardless his brutal and disturbing Legacy lives on.", " This is unsolved murders. True crime stories. You're listening to our first episode on the monster of Florence. If you want to hear our investigation into other cold cases, you can listen subscribe and write reviews on your favorite podcast directory. You can also listen through our website Park ask.com spelled Parc a st.com. I'm your host Carter Roy, and I'm Wendy McKenzie now.", " Now back to the terrifying tale of the monster of Florence.", " Spits he's reporting on the case began on June 7th 1981 when he was covering the crime desk at La nacion Florence's top newspaper.", " Mario what are you doing here as mass been canceled. I went Roberto asked me to cover his desk some appointment. He couldn't miss well shouldn't be a long day. Nothing ever happens on a Sunday, but something did Mario's Betsy crime desk? Yes. A murder has been committed a young couple. He must come see Mario left at the news. He drove to a quiet Lane in the hills of Southern Tuscany. Not too far from where he himself lived.", " You spit see I am from LA nacion right? Come come you'll see.", " The boy is in the driver's seat. He looks like he's sleeping the big sleep. Yes. The boy was shot in his Temple. I see and the girl she's behind the car but it's much worse. The female victim was found shot in the back lying naked on a bed of grasses and wildflowers. There was a single gold chain placed in between her lips. Her genitals are missing my God. I can see that do you need a moment?", " To take some notes. Yes spatsy would later recall that the entire scene looked like a museum diorama. So staged cold and immobile and when investigators took a crack at it, they came to a few quick conclusions. The sexual nature of this crime can only be the work of a man. The mutilation of the female victim is so precise. We may be looking for a surgeon or doctor of some kind. What about a butcher we", " Cannot rule out out either according to the examiner the perforations on the skin suggests that a scuba knife was used scuba for cutting fishing lines. So we're looking for a diver. I did not say that only that a scuba knife was probably used the police had their theories but speci had his own he wrote an article in La nacion about the slang and in a sidebar revealed something that caused an uproar. He noted that the killing was quite similar to a double homicide from", " 74 also committed in the hills of Florence the victims and Amorous couple in the back seat of a car sped see went on to implore the police to compare the bullet shells from both crime scenes angered. That's Betsy called them out in the Press, but also feeling the pressure to deliver the investigators reluctantly obliged they compared the bullets and discovered that they had both come from a 22 caliber Beretta along firing Winchester to be precise and that's not all the gun had a defect.", " That when fired caused a mark on the shell of each bullet and identifiable scar if you will. So the gun used in the 1981 crime was the same used in 1974, right? So now the cops had a murder weapon to search for but they were also starting their arduous Manhunt the first general theory that emerged that the killer was some sex-obsessed local voir in Italy illicit sex in the Hills was pretty common at the time considering Italian men and women often lived with their parents until", " Married and because so many people Venture into the hills for such activity others go up there to watch these peeping Toms were known as Indiana or Indians because they snuck around in the dark. Some of these voyeurs were so committed that they even had high tech gadgets like night vision cameras. Well, that sounds pretty professional. Well after a hasty investigation authorities arrested a frequent voyeur by the name of enso spalletti. He was held in police custody.", " And then on October 3rd 1981 four months after the first killing another couple turned up dead twenty-six-year-old Stefano baldy and 24 year-old Susanna Combi. They were killed on a Saturday night in the Northern Hills of Florence both were shot and just like the other female victim calm bees genitals were missing. This was his second murder believed to be at the hands of the monster of Florence because the crime was committed when spalletti was in police custody authorities.", " Included he couldn't have done it. So he was released over the course of a month spitzy wrote around 57 articles about the serial killings is a ton. How is that even possible sheer determination? Some might say it started to become an obsession for him. No kidding in these articles. He proposed different suspects that had come up during the investigation one was a priest who got his kicks by shaving the pubic hair of prostitutes. Another was a psychic who went to the cemetery.", " To contact the dead spets he's had was a mess of crime scene photos deranged suspects and existential ponderings. That's when he started his therapy sessions with brother Bobby knee then things quieted down for a while eight months to be exact The Manhunt continued of course, but it was proving to be fruitless then in June of 1982 Paulo main Rd and Antonello me Leah Remini both in the early 20s were found dead.", " Tuscan region of Montes Bertolli on the monster of Florence had struck again for the third time as the investigation continued nearly two weeks later authorities received an anonymous letter once opened it revealed an old newspaper clipping from 1968. It was an article featuring a double homicide a man and a woman had been killed while having a tryst in a parked car scribbled on the article was a single statement take another look at this crime who had sent us and why", " Why was the monster himself playing a mischievous game with his investigators? Well, authorities took the order quite seriously and went through old boxes of evidence from the 1968 crime and what they found was quite interesting bullet shells that had been fired by a 22 Beretta. These shells also contained the mark from the defective firing pin. Well, this could mean that the monster had actually begun his Killing Spree back in 1968. This was a major monkey wrenches.", " Actually because a man had already been convicted in that case. He was Stefano melee the husband of the female victim are Balochi who had gone to the hills with her lover melee had confessed that he had killed Barbara and her lover out of Revenge. He was sentenced to 14 years in prison. So as melee the monster of Florence, well, it seems that he couldn't be considering his locked up at the time of the murders in 1974 in 1981. But now in 1982 he was living in a halfway house in Verona Italy when news of moles", " Fred spets he jumped at the opportunity to interview him but getting access to marry would be tough. So what did spezza do he hired a filmmaker and visited the halfway house pretending to do a documentary on the houses Goodwill spets. He was granted access inside. We appreciate you opening your doors to us. It would be great to get the house sun exposure. We're always needing donations on volunteers. I'd like to interview some of the residents. They are all ex-convicts. Correct? Oh, that's right.", " Are they benefiting from the program? Absolutely, I see the work of God every day. Now after interviewing several residents spatsy finally met. Melee. The only person he came there to see during the interview. He transitioned to the question of the 1968 murder. The one melee was convicted of I don't I don't want to talk about that. Are you guilty of the crime? Mr. Mell a and what's it matter? I I'm here aren't I what do you mean by that is that", " Why you've come here to ask me if I'm a guilty man. That is one of the reasons the police are looking at more crimes. That's right more murders like the one you were convicted of they need to figure out where that pistol is. Yes, I agree with you. Otherwise there will be more murders. They will continue to kill they will continue day. Mr. Millie. What do you mean by they but that was the most spatsy could get out of him melee seem Disturbed and distant and began to ramble incoherently.", " But his Revelation about the possibility of multiple Killers was huge.", " Our story will continue in a moment after the break and now back to our story malaise Revelation about multiple Killers coincided with the police's investigation as well authorities discovered that Stefano melee was not the only killer the night of the murder in 1968. There were others a group of Sardinian clan members for those of you unfamiliar with this term. Let us explain back in the 1960s.", " From the island of Sardinia immigrated to the region of Tuscany. Well, they did this to escape the baron and poverty-stricken island of Sardinia searching for opportunity in the growing region of Tuscany criminal factions arose and those belonging to the Sardinian Clan had a specific brand of violence and an extreme loyalty to each other. Well the theory was that the murder of melee his wife was a Revenge killing, but it was carried out by melee and his loyal clan members one police theory was that after the", " Ling one of the members developed an even greater taste for blood so he continued to kill choosing the same gun that was used in the 1968 murder of melee his wife Barbara this Theory became known as the Sardinian Trail and it opened up a fairly direct investigation into the lives of powerful Sardinian clan members known as the Vinci Brothers the cops started with the youngest brother Francesca. They arrested him in 1983 and brought him in for questioning while he was in police custody.", " The monster killed again, but this murder was quite different from the others. Mr. Speight. See we meet again under similar circumstances another young couple. Yes, but not what you would expect they are not Italian. No, they are German tourists, but that is not what I mean. Look closer. They are men both of them and I can tell you since I've already seen their", " tiles are intact. The killer only takes from the female victim huh, but there is none to take from I think this angered him. Look at the man right there. He has long blond hair. No. Hmm. I see it looks like a woman from here. Yes. Yes, I could see that. I think the killer thought he was murdering a young couple a man and a woman. You see maybe he pulled the trigger on both of them and when he went to do what he does to the", " And he discovered. Well, he discovered he was wrong, but look here.", " What is that a homosexual magazine very graphic. It's been torn up. The killer could not mutilate his victim and in his frustration. He tore up the magazine instead. That is just a guess but I'm fairly confident. This is so strange when you write your article. Mr. Spade see I hope that you will paint us in a better light this time. I'm sorry, you've been given access to no other Florentine journalist has that's something worthwhile.", " Isn't it I see despite this new development in the case officers continued to detain Francesco and they also arrested his nephew Antonio your uncle is being held at the prison. There have been attacks on his life. There are many enemies of the clan where he is men whose wives are daughters. You have raped men whose families you have killed.", " You are smaller. You are younger when you go there. You will surely be torn apart.", " Not once not twice but daily, but there is a way to avoid that anguish that physical pain that he'll you tell us where the gun is. You tell us anything about this monster Florence. There is hope for you.", " You can't keep me here in a stupid gun charge. I'm no fool. And I'm not a coward. I know nothing. So I say nothing both Antonio and Francesco were continually grilled by investigators. Nothing came of it, but they were still detained in the hopes that something would and then it happened another murder in July of 1984 on this would be the sixth double murder link to the monster the", " teams were 21 year old Claudio Stephanie Chi and his girlfriend. Pierrot 19e only 18 years old the crime followed a similar pattern of the monster except for one new detail a second mutilation of the woman in addition to the removal of her genitals. Her left breast had been amputated and was also missing the particular location of this crime was the town of vitro famous for being the birthplace of the Italian artist Giotto the shock of the sixth crime in jail.", " Some Town overwhelmed the Italian people. They wanted and demanded closure and justice.", " So local law enforcement and the military police force known as the carabinieri teamed up and formed a special task force. It was called the squad that int mostro that when translated is team anti-monster sounds more like a children's superhero fantasy than a police force and the less the creation of this task force was a sign that authorities meant business the Italian government even offered a reward equivalent of two hundred and ninety thousand dollars for any information that could lead them to the monster.", " No, that's not all tourists coming into the country were warned with posters and flyers telling them not to venture into the hills at night during this time. Spezza was still furiously typing away at La nacion and just like the monster. He had also been given a nickname his colleagues at the paper started calling him monster Olinger a clever play on the astrology section of a newspaper spits. He was now inextricably tied to the monster even by name. It was sped see who gave the public access to the", " ER of the monster, he was in a way the monsters liaison to the world. The monster would enact a vicious crime spitzy would provide details to the monsters audience the citizens of Italy in a manner of speaking. They had become two parts of the same puzzle and it was taking a toll on speci. He visited his therapist mom brother a beanie more and more in an attempt to come to terms with the horrendous crimes and the unexplainable evil that had caused them. I don't blame him I can imagine that being", " A crime reporter would be a difficult job, but the level of horror that's Betsy has the witness is almost unimaginable and sadly it would only get worse in 1985 a year after the last murder the monster re-emerged. But this murder was not as simple for the monster or his two victims French tourist Zhang crevice viele and Nadine Mario. I'm cold.", " Well get closer to me.", " 900 make you even warmer. All right. Let's go to bed. I'm getting tired. Anyway, don't say that.", " You didn't before the Bears get us there. No bears here. I know what do they have here? I don't know besides wine and pasta. That's all you need. Well that and", " What was that? What something's out there like a bear? No, Jean. I heard it. It's something else. You're paranoid get the flashlight. It's too dark. All right, you make me beg for it every time don't you hurry?", " Can't find it. What is that? What is that? I don't know. Something's out there calm down. Will you know John? I don't my hand John Nadine.", " The bodies were discovered the next day when a mushroom picker stumbled on the campsite the woman Nadine had been shot in the face her genitals and left breast had been removed. Just like the previous victim the man John had been shot in the", " List, but he managed to escape the tent being a trained Sprinter. Jean was able to run into the woods, but the killer chased him and eventually caught up with him when the monster overpowered him. He stabs on several times and then slit his throat. It was noted later that Shawn might have been able to escape the monster if he had only gone in the opposite direction being a tourist. Jean was unfamiliar with the area had he known better. He could have run towards the road which led into town instead he", " ran Straight Into the Woods", " The following day the prosecutor on the monster of Florence case a woman named Sylvia Della Monica received an anonymous letter come in.", " Here's the mail from today. You want it now or later? Oh now I guess I might as well take a break. Are you going out for lunch or do you want me to order is this from I don't know looks like a child made it. These are letters cut out from a magazine. Is this a joke? I honestly don't know I swear the lack of decorum in this place. What is it?", " Sophia oh, oh my God, what inside an envelope addressed to Sylvia was an amputated nipple the absolute horror of that experience took its toll on Sylvia she soon quit the case and eventually ended her career in law enforcement as we can see the murdered lovers were not the only victims of the monsters depraved Antics. He was reaching many of those involved in his elusiveness would", " in you to stump investigators as well as cause a number of different prosecutors and detectives to take the reins the turnover of those working the case would be frequent and Swift. Apparently. This was not a case to be solved by one man, or woman alone will return to our story in just a moment from the park cast network. Now the story continues following Sylvia's withdrawal from the case Chief criminal prosecutor pierluigi vigna took her place.", " Now this man was a rare breed, even though he prosecuted high-level criminals. He refused to have any bodyguards and kept himself listed in the telephone book. He basically welcomed and he ticked off criminal to try him. Not only that he wore perfectly tailored suits sharp ties and was more handsome than the average Italian lawyer at the time for the monster Florence investigation. He was paired with judge Mario Rotella rarely. Did they see eye-to-eye. Rotella was convinced that the", " monster was a Sardinian Clan member and decided that the next man to pursue was the eldest of the Vinci Brothers. His name was Salvatore. There's a little back story on Salvatore. First of all, he had apparently participated in a threesome with Barbara low Chi and Stefano melee. You may recall that mainly became a suspect in 1981 after he was convicted of killing his wife Barbara in 1968 MLA was tied to the Sardinian Clan which led to the Sardinian Trail in the first", " Lice, we know there are a lot of intricacies to this case and it seems to be getting more complex as we go. So you may want to pay close attention back to Salvatore in 1961. He was forced to flee his homeland of Sardinia after his 19 year old wife was found dead. It was deemed a suicide but others had another theory that Salvatore had actually killed her and made it look like a suicide not a great track record for this man, and now he", " I'd be in the Limelight. Once again Rotella ordered his arrest in 1985 and brought him to trial but this may have been a hasty and foolish move. No one would really testify against Salvatore probably because of his role in the clan and the evidence didn't line up convincingly prosecutor vignan has attempt to convict Salvatore was a total failure. So once again, this seemingly impossible case was at a pathetic standstill, but the tide was about to change.", " Enter in the new man who would lead the investigation Chief Inspector ruggerio progeny. He was ready to bring a fresh perspective to unlocking the true identity of the monster of Florence often seen in formal attire and toting a pipe Peto. Jeanne was like a mix between Sherlock Holmes and Robert De Niro. His manner was British his accent and intensity were a hundred percent Italian out of all the investigators. He became the most famous and he took", " Advantage of his 15 minutes when he went on a popular Italian news show here. He dramatically addressed the monster on live television. I have a message for The Man Behind the killings of the lovers of Toscana.", " Listen here.", " People call you a monster or Maniac or even a beast but in my study of your handiwork, I have come to know you I have come to understand you your actions are indicative of wanting the world to know you. Well, here's your chance give yourself up to authorities and let the world see you. We are here to help you during the case when pero Genie addressed his subordinates. He had a totally new angle for the investigation.", " Settle down playtime is over.", " The fate of many Italians are many tourists rest in our hands. These former investigators have been chewing on the same cut for years and it's gotten them know where this business about the gun and its Soul connection to the clan is no good. It is my belief that the monster is not from the clan. He's not some cheap mafioso. He's much more than that. He's a psychopath maybe yes, but that is a vague term.", " We need specificity. We on the cusp of a New Age Technology is booming and when technology booms what must we do we must boom with it instead of running around like chickens with their head cut off. We will turn to another source of information the computer we will input information and use the computer to make sense of it to find a pattern to provide us with a viable suspect you want us to work at computers all day.", " I want you to approach this case with a new mindset a mindset of a profiler. We analyzed the detail of the crime scene the mo of our killer we search the database for criminals looking at sex crimes convictions prison sentences History of Violence to distill our suspect down to a single person and that's just what they did after a meticulous search one man Rose to the top of the suspect.", " I'll his name was Pietro. Pukani 69 years old Stout, but forceful a farmer and a fervent alcoholic who had served 13 years in prison, when he was 26 at this point. We'd like to issue a warning to those listening the details of the sexually violent crime Puccini was convicted of are disturbing proceed with caution in 1951. But Johnny cut his girlfriend sneaking off to the countryside with her lover. So he followed them into the woods.", " When he witnessed them start to undress he was so enraged that he ambushed them and bashed in the head of the man until he died. Then he raped his girlfriend beside the body of her dead lover later. He was also convicted of sexually assaulting his two daughters sounds like a wonderful guy, but Johnny may have been one of the worst criminals in Italy considering his priors, but was HE capable of a string of Serial murders. We shall see patter Jeanne thoughts. So first of", " All the evidence against him was pretty damning. That's right. But Johnny was in prison from 1974 to 1981 a span of time when the monster didn't kill as far as we know just a coincidence or could this point to put Johnny as the killer? Well, there's more when pero Genie reviewed pochon. He's history. He came across an interrogation by police.", " How do you a jealous man? Mr. Pagani? I don't know. Have you ever gotten jealous? Because of a woman I have gotten angry women know how to make a man Angry how so they flirt they parade around they pretend they are more beautiful than they are. Have you ever been angry with one of your girlfriends? They have all given me help was there one in particular that made you the most angry my fiancé she was the worst she had a man who wanted her and she loved it. She showed him her.", " It for his pleasure.", " This bit of the interview struck Peta Genie. He felt this statement was a strong piece of evidence the fact that pukani became so angered when his fiancee showed her left breast was an interesting link to the monsters act of removing the left breast of his female victims because of this, but Johnny was looking good as the prime suspect so better Genie got a warrant to search his house and he and his team found something interesting.", " Nothing in here, sir. Keep looking this old GE is hiding something. What about the back room? They're still in there.", " Anything hmm Just Junk. Well Trinkets and things Chuck you call Art junk but the painting is a cheap copy. The painting that they were referring to was a reproduction of Botticelli's Primavera, which can be found in the uffizi. Gallery. Florence's most famed Museum, the image depicts nymphs gathered in the woods.", " Look at this image. What do you see goddesses in the forest and the man on the left what else cherub at the top?", " Is there something else sir? Look at this nymph. She is different from the others the way she stares at Hermès as if she knows she will be taken to the underworld at look at her mouth sir. There are flowers pouring out from it. Take this the painting this is something better Jeanne believed he had found a piece of striking evidence, but he would have to convince those higher up on the food chain.", " common", " Ruggiero have a seat", " your men today have been chattering on about your obsession with Botticelli. I have no obsession with a man. He's a profound artist, but it is not him. I'm interested take a look at this photograph from the 1981 crime scene. Look at the girl. I see her the gold chain. It's spilling out of her mouth. I see that also does it not remind you of the nymph in this painting? How do you say?", " The monster model is killing on Botticelli's nymph. We are dealing with a man who places great importance on his crimes the details. I know like you I've been studying in all just because I said it a desk doesn't mean I've lost the power of deduction. I know that but the bullets for example, he leaves the shells for us to find and everyone has the same Mark the removal of the body parts from the women the gold chain and this Photograph he is not merely", " Really he is performing his staging his crimes almost like it were the theater I can agree with that. But Johnny had this painting at his home. I'm beginning to believe he is more than a country brute. He appreciates art. Did you know he's a self-taught painter that hardly means Johnny is sexually violent. He is obsessed with women the women the monster kills our his prized victims. He could care less about the men there are side note.", " Mentally, I think he and the monster they are one in the same. But Johnny is our man, very close to it. Okay, Ruggiero. What do you want us to do next? I want to search his entire property leave. No stone unturned. We will find what we need. Okay authorities conducted a 12-day search tearing apart.", " But Johnny's house and property grounds on the 11th day things were looking Grim. They hadn't really uncovered anything of value to the case.", " Espresso. Yes with the little something extra if you don't mind. What is your preference surprised me and I will be asking for a refill I could get you an actual drink. No, I must Pace myself Ruggiero. The search does not bode. Well for us we need more sit have an espresso with me. My wife is expecting me and the kids have school work and we have a case.", " You know what your problem is you get an idea in your head and there is no stopping you isn't that my job to never stop to find the answer? Yes the answer but not a vague possibility get some rest tonight. Tomorrow is most likely our last chance.", " The next day authorities continued their exhaustive search and then something happened.", " Men of Toscana we have found it. We have found it. What did you find that which I hold between my fingers Ruggiero. Don't be coy with us a 22 caliber bullet. It was in the garden my Lord. You may have done it wrap it up and let's alert ballistics.", " On January 16th, 1993 Puccini was arrested and charged with the seven double homicides associated with the monster of Florence. Para. Genie was confident that he had found the man who had eluded capture for nearly two decades. But Mario sped see who had devoted years of his journalistic career to covering stories about the monster was not he didn't believe a man like Puccini was capable of such criminal Mastery spets. He would later comment.", " The police were always searching for a sexually violent man a rapist who took women by force, but he didn't believe that was the profile of the monster first Betsy the fact that the killer never physically raped his female victims meant that the monster Florence was actually impotent and the cops couldn't have found the killer because they were looking for the wrong kind but Peta Jeannie had built an entire case around pukani who is now headed for trial will cover this momentous trial in next week's episode Patti, Jean.", " She had taken the investigation as far as he could and now it was time for a jury to decide whether or not they had found Italy's famed serial killer don't think for a second that this would be an easy task as you should know by now. Nothing involving the monster ever is", " Don't forget to subscribe to unsolved murders on iTunes Google play SoundCloud Stitcher or any other podcast directory if you like what you hear leave a five star review or tell us what you think on Facebook or Twitter at Park as Network a new episode comes out every Tuesday and next Tuesday. We'll continue our investigation into the monster of Florence. Thanks for listening. We'll see you next time if it will live till next time.", " Unsolved murders true crime stories was created by Max color and developed by Ron Cutler. It is a production of Cutler media and is part of the park as Network. It is produced by Max and Ron Cutler sound design by Ron Shapiro and Kenny Hobbs with production assistants by Maggie admire unsolved murders is written by Jessica Marlowe and stars Carter Roy and windy Mackenzie the amazing cast of voice actors includes by alphabetical order Janine Gibbons nicolás massú.", " Malou Narayan Steve Pinto Greg Paulson and Vanessa Richardson", " Malou Narayan Steve Pinto Greg Paulson and Vanessa Richardson"]}