{"showID": "0A1bZfQ1C2FOUMfVJ7ugpa", "show_name": "Chompers", "show_description": "Make tooth time easy with this morning and night tooth brushing show for kids. Kids will hear jokes, riddles, stories, fun facts, silly songs and more, that’ll keep them giggling - and brushing - for the full two minutes that dentists recommend. Chompers will have kids reminding parents that it's time to brush, not the other way around! Recommended for tooth brushers ages 3 - 7.", "episode_name": "Chompers", "episode_description": "Make tooth time easy with this morning and night tooth brushing show for kids. Kids will hear jokes, riddles, stories, fun facts, silly songs and more, that’ll keep them giggling - and brushing - for the full two minutes that dentists recommend. Chompers will have kids reminding parents that it's time to brush, not the other way around! Recommended for tooth brushers ages 3 - 7.", "transcript": ["Jumpers is produced by gimlet and sponsored by Crest and Oral-B.", " Either. Do you know what time it is lunch time? No, it's time for Chompers your morning and night toothbrushing show get your toothbrush going and three two one.", " It's jokes week on Choppers and tonight. We've got more jokes to get you giggling. Why do pilots love garbage why because of all the Flies?", " One of the most famous pilots and Airline history is Wiley Post Wiley was the first person to fly a plane all by himself all the way around the world switcher brushing to the other side of the top of your mouth and make sure to brush the inside outside and chewing side of each tooth.", " Here's another joke, how do firefighters decide on dinner how they take a poll?", " Firefighters slide down a pole when it's time to go out and fight a fire. It's because it's faster than taking the stairs switch your brushing to the bottom of your mouth and make little circles with your brush around each tooth, but there's another type of pole. That's when you vote on something. So let's take a poll raise your hand if you want to hear more jokes looks like the answer to", " Pole is yes, here we go. Why was the dog walker sad? Why because he had a rough day.", " Woof. Did you like that joke, let's take another poll raise your hand if you liked it.", " Okay now switch your brushing to the other side of the bottom of your mouth, but don't brush too hard. Here's one last joke to send you off knock knock who's there, but but who but doctor that jokes not funny a but doctors called a proctologist great job brushing come back tomorrow for another daily.", " the dental hygiene and until then make sure to rinse before you 3 2 1", " Chompers is a production of gimlet media.", " Hey Champions, do you like funny jokes, do you like giving your grown-up that giggles? Well, we want to laugh to tell your grown-up of funny joke one that you think I'll crack us up and have your grown-up used their phone to record you saying your first name and your joke if you send us a recording we might use it on an upcoming episode of chompers grown-ups send a recording to Chompers at gimlet media.com. That's Chompers at gimlet media.com"]}