{"showID": "0a1edJv75fmg5bnYDgeZ0v", "show_name": "Light and Love", "show_description": "We want to encourage others to find their authentic self while going through the journey of self awareness and evolution of consciousness. The journey is sometimes dark and full of fear, but with Light & Love you can get through anything.", "episode_name": "Light and Love", "episode_description": "We want to encourage others to find their authentic self while going through the journey of self awareness and evolution of consciousness. The journey is sometimes dark and full of fear, but with Light & Love you can get through anything.", "transcript": ["Hey guys, we want to take a quick second to talk about anchor. Have you ever thought about starting your own podcast? Anchor is what we use to host our podcasts and it was so easy to start if you're interested in making one we recommend anchor because it's free and they distribute your podcast for you. So it could be heard on Spotify Apple podcast and many more. It's everything you need to make a podcast in one place. You can even record and edit download the free anchor app or go to Anchor dot f m-- to get started.", " Hey and welcome to light and love where we help you. Find the essence of you. Hey guys, Welcome to our first episode of light and Love featuring me Sarah and me Jalen. Okay. So tell us a little about yourself really quick. Hold on possible.", " You can really say.", " Just like are they kind of just like our name? I don't what more do you want to say about yourself true? Because we don't really have any like accolades or anything. So nothing really took off with connecting us to the stock, right? Okay, just my name. Is this and your name is - okay, sir. So briefly a little bit info about us is we've been friends for how many years I think the 2016 so only three", " Is it feels like three years a lifetime already or both in our 20s? So we're both in like a limbo a turning point finding ourselves. Definitely definitely both of us were in different places in our 20s. But I feel like we still like really relate a lot being in this space and let's see you want it you got it. Okay. So I just want to briefly go over our horoscopes. That's the note I wrote down because I", " I like that kind of opened up me and her to being really close and this whole journey, so I'm going to go first with my", " Horoscope is so I'm a Virgo Libra Libra.", " Cute. Okay. I am a Scorpio Taurus Virgo. That's why we get along very well, but I just wanted to introduce that because that was a topic that I feel like we talked about like a lot a lot before we came to like that little that's how we really turning point. Yes. I've never liked talk to anyone in depth about it like about that stuff or dug deeper because I just knew like oh my sun sign is this I didn't know.", " Everything else? Yeah, we started learning together. And that's what's like put us on this whole journey, I feel like of digging deeper and see. Yeah for sure. So our this podcast I think is about helping people become more self-aware and tune with themselves.", " Literally a journey because I feel like a lot of people we listen to their journey is not halfway over. Obviously. I'm not saying they're old but they have a lot of experience under their belts and a lot of success under their belts, but me and Jalen are just beginning. So this is literally a ride for all of us to go on together. So a little more relatable. I feel like I hope", " This is you're gonna have to bear with me here Sarah.", " Okay.", " So I'm going to tell a little story of what like changed my life into the spiritual journey want me to go first? Yeah. Okay. So I remember me and Jalen went to brunch just us two. I don't even know what we just wanted to get cute go to brunch, you know how girls do and we should tell me about a book she was reading. So I was like, ooh, I'm gonna get that book. We're right next to the Amazon bookstore. So I went and got it and that's when I started realizing a lot of", " Looks so should I go into like my okay. I'm going to just tell my little thing and then Jalen's gonna tell her it's because Downs more deep than me. Okay. So once I started reading it that day after we were done being drunk obviously because it was brunch. I started reading it and something clicked and looking back at it now, I'd probably call it fate or Divine timing. I've always loved self-help books quotes, you know, like success stories, but for some reason I never felt", " Like I could categorize myself as that type of person that it would happen to keyword happened to I was thinking all along this thing that happens to everyone is just literally happening to other people like, you know, you just going about your life and like oh something great happens like oh my God, you got such a good job you graduated from high school. Like I just thought they just happen but after reading the book, I started to realize that anyone including myself could do it.", " Or anything that they want so I feel like that book is when I woke up to my potential. I'm still not there yet. I don't think we ever get to like our greatest potential In Our Lifetime, but that's what like opened my eyes up to this ongoing Journey that will forever be on and the potential that each and every one of us has inside of us like no one is different than each other. Some people just are a little more awake and open too.", " Anything happening different areas in their life.", " Do you know where to start?", " Okay, I think you have to ask me the question that I have to go off of. Okay. Okay. So I we are trying to figure out when Jalen's Journey started and it started in the stars for Jaylyn so she's gonna be it's a good way to put it I like that it never really liked clicked like", " Oh God, I'm getting stuck on getting stuck on that. I'm getting stuck. But Evie, it's okay. It's okay. Okay.", " Okay.", " So, let's see how it really started. I feel like", " I don't even know how to start this era. It's okay. So part of Jalen's journey is being a vulnerable and that's what she's doing right now. It's a huge leap for her. So she's she's gonna get there. She can tell us.", " Yeah, sorry, I'm getting nervous Megan gotta go. Okay. Let's see when my journey began for me. I feel like", " can we pause it and I'll think about it. Can we or hadn't had how should I do this? Just do it just talk freely and then we'll just edit it later. Okay, where's my water?", " I don't even know how to get started.", " Okay, I feel like for me I've gone through a lot of stuff in my life that", " really put me down and hurt me. And for the longest time. I played the victim as if", " I don't know just everything was crashing. Everything was falling but I feel like once I decided to like take control of everything and control how my thoughts were and what was happening to me. I feel like that's how it all started. And when did that start? When did that happen for you? I feel like it's always been happening. It's been happening since I was like maybe like 15.", " When you took yourself out of the victim actually know that happened like last year when I was like slowly healing myself. Yeah and like dealing with my fears and facing them instead of like running away from them. But what made you what made that happen to you? Like what made you wake up to that?", " It just hurt. It just hurt every single day. So when was that moment where you're like, I need to change my thinking.", " I think it didn't really like click. I just did more things. I guess the quotes quotes and I reading yeah reading a lot of quotes and then", " that kind of help let go of a lot of that stuff. So does it happen when we when we kind of like I feel like after that book. Well, she was ordering that books. Yeah other click in that book. What was the line?", " Something clicked for me and the way I was thinking about things so the book were referring to is you are a badass by Jen's sincero. I think it's the first one of like the triple series she has but sometimes I feel like it's something that happens is not necessarily that book that changed us, but I feel like something just happened after reading that like, maybe we were ready for it and then we started reading it and it just opened our eyes like even more that was like that little push from", " the universe", " so the quote that I think that got me was our conscious mind thinks. It's in control, but it isn't our subconscious mind doesn't think about anything but it isn't control and I think", " How long was the color?", " maybe go with your quote and what made you", " Okay, open your eyes. Um, so like I mentioned before I kind of like woke up to the potential of being whoever you want it to be. I feel like a lot of times Well, at least in my life, nothing was ever wrong. I had an easy childhood. Nothing bad happened to me but I felt like things were supposed to be given to me. I think that was my mindset for like a really long time until last year. I was like, oh my God, something great is just going to happen for me because I deserve it and I feel like that's what's going to happen. But", " I think about like the work that had to be done and the work that all those other successful people in self help people like the stuff they're talking about is really really true like me and Jalen are seeing it now like it's not just going to manifest itself tomorrow. We have to go through so many things before the good can happen.", " I feel like the good isn't all of the journey and you don't see it until you go through it. Yes, you know for sure because people think like poof I'm all better now. Yes. So for some of you guys listening I'm thinking maybe you guys have never thought about these type of things see Jalen's so deep. She's so deep. You know, what Sarah the only one that got me to like openly talk about it more. Yeah, you know because why don't talk about it with anyone else either.", " Now once we start talking about it, we felt like it was normal to talk to everyone like this and it's not us all crazy yet still understand eventually. Yeah. So a quote from you are a badass that I kind of thought of and from this other book I have this is how I felt most people are living in an illusion based on someone else's beliefs. So we're just like kind of walking through life. Like what's next what's next but not really doing anything about you changing. What's next?", " You know, you're just whatever is going to happen to you is next. This book will call me up to I get to choose what's next. And so that's what I'm hoping to share with people that like we can choose because I was living my life without even I was just waiting for something to happen to me something great.", " We need to get to the deeper issues for Jalen to really we do we do I need to talk about some deep stuff.", " So what else should we I'm trying to find what clicked for me. Yeah, I want to get too deep into things because some people I'm assuming don't even know about these things because almost a year ago today. I didn't like I've heard of these things I've read these quotes but I just never resonated with anything. So I'm guessing like", " People listening like my friends. I feel like we don't talk about these things. So do they do them or you know what? I mean? Like yeah, are they just living their life just going about what their parents expected like going to school graduating college and then you're like, what's next a regular 9 to 5 and then you just caught up with the same old stuff over and over and yes, especially that's what Society teaches you though. And that's what's all over social media. Yeah, and it's totally fine. But I feel like", " If you're aware of it and you're okay with it, then it's fine. You know what I mean? But for me and you we were searching for something more we felt like a potential was much more than that and we wouldn't get to our potential staying there. Like I was waking I was at the point where I was waking up every day, like I hate waking up one because I just hate waking up but to it's like it's literally the same thing every day and I was like, it's every day of my life gonna be like this. You know, what woke me up too. Yeah why you do this every day? Yeah now that I'm thinking about it.", " Go to work and I would sit there and I would think like I don't belong here. Like I'm doing all these other things and everyone's okay doing the same thing over and over again. Like I need to leave you did. You were like that yet. You were in a hurry. That's what that's what clicked for me. Yeah. Yeah. So about almost a year ago we both will she's quit her job for almost a year now or nine to five job so we both like kind of contemplated that because we felt like the only way to like dig deep and like go", " Go full force was to just literally quit Comfort which is our down time that it was because you need time to do this. So for you guys who do have nine to five jobs. There's nothing wrong with it. But like just dig deep you have to set aside a lot of like personal time to think. Yeah and to do the work to really know where feel it and it's really draining to yeah. It's not easy, but it's so worth it you feel", " So much lighter in the end. Yes. This is a good segue to kind of what we want to help you guys do is like things that you may not know how to do or I have never heard of or no one that you're close to talks about these type of things. So some topics that we're going to eventually go over and get deeper into our things like", " What is spirituality mean to you? Oh Shadow work angel numbers more into your horoscopes. Yes would be a good topic finds meditating information. So a lot of things you see like or you hear successful people talk about I feel like we're going to be talking about it from the point of view of we're still at the bottom. Yeah still doing these things trying to like work our way up. So we want", " Elevate your Consciousness you can join us on office. Yes. Thanks for listening. See you guys next week for another episode of light and love."]}