{"showID": "0A1ejb0nplbJ7Z3qDF31D9", "show_name": "The Language Learning Show", "show_description": "A podcast to share my love of learning languages with the world. Hosted by Azren the Language Nerd (@PolyglotAzren) Enjoy the show! :)", "episode_name": "The Language Learning Show", "episode_description": "A podcast to share my love of learning languages with the world. Hosted by Azren the Language Nerd (@PolyglotAzren) Enjoy the show! :)", "transcript": ["Hey podcast people. How's it going? As or in the language nerd here. This is going to be an abbreviated podcast. Probably five six seven minutes. Literally just to answer a specific question that came through on YouTube. Somebody left a comment asking something and I wanted to make a podcast because a it's going to be easier for me to answer this person's question in podcast form and actually voice format and second of all, I think that their question is super relevant for lots of different language Learners. So first of all, let me just read this question.", " An out for all of you. The question goes is so high as Aaron. Do you think that learning French first would makes would make learning Spanish easier or does it make a difference at all on which one to learn I say this because I think maybe French is a little bit harder considering the pronunciation the person then continues and says I planned on signing up for Spanish classes offered in my neighborhood, but they also offer French. I've always wanted to learn French. So I was thinking maybe learning both simultaneously.", " Taneous Lee would be a good idea cannot work, then they continue and say my long-term goal is to learn four languages Spanish French Arabic and German in the next five years and who knows I might throw in another one or two might throw in another one or two once I've accomplished this goal. And so basically, let me just address a few different elements and respond to a couple of different elements of this individuals question. So first of all, does learning French first,", " To make learning Spanish easier, I think yeah, I probably would I think when you learn a language when you learn one language and you try to learn another language that is in the same language family language number two is going to be easier like for example, I learned French first personally and then when I learned Spanish, there is a lot of overlap masculine and feminine masculine and feminine things are generally the same conjugations, although are different the concept of conjugating.", " Is similar in both languages some words kind of look the same like this. Definitely a lot of crossover. Absolutely. However, I will say this. I don't think it's necessarily a good idea to learn one language just so that another language as easier because it's going to take you so much effort to learn language number one and then you're gonna have to put in all this effort to learn language. Number two, just go learn the language that interests you most you don't need to go learn one language in order to make one way.", " Way easier like that's not I wouldn't recommend that per se commenting a little bit further here. I do think that this particular person asking the question makes a good point, which is that French and my perspective for most people tends to be a little bit more difficult considering the pronunciation. I mean grammatically, they're probably equally difficult those a reasonable. I mean a comparable difficulty level in terms of grammar in my experience and seeing different people trying to learn each language.", " And working with different people. So I do think that simp grammatically things like that. They're pretty similar but pronunciation wise I generally find a lease for the native English speakers that I've worked with. Usually the native English speakers French pronunciation really does tend to cause them a little bit more print little bit more difficulty because it's not quite as straightforward. So that is an interesting point that this individual makes moving down moving down into their question. They asked a little bit more they said they planned on signing.", " Upper Spanish classes offered in their neighborhood and they also offered French. So they're considering learning both at the same time. I think. Yeah, you can absolutely learn both at the same time. There's nothing necessarily wrong with that. I would just keep in mind that if you're doing two things at the same time your progress might potentially be slower in each language because you're splitting your attention. The reality is that if you were to put all of your attention on one language, you would probably progress faster in the one language then if you split your attention,", " That's just a general statement. I know some people don't necessarily feel that I think here. It's up to you. If you want to do if you want to do two at the same time fantastic, if you don't want to do two at the same time, and you just want to do one, that's also just fine. I don't think there's necessarily A Better or Worse in this particular scenario. If you're unsure, I would say try learning both at the same time see how it feels see if you like it. And if you're like man, I'm too busy or oh man, this is really stressful or I'm really nice.", " I'm really not liking French but I'm loving Spanish or whatever it is. You can make some adjustments along the way so I think this is goes for anybody if you're considering learning multiple languages at the same time. I encourage you to do it see how it feels and then make any adjustments along the way if you don't like it only pick one if you love it keep going Etc and then commenting on the last part of this comment here. They said that their long-term goal is to learn four languages in the next five years and who knows I might throw in another", " Sir, one or two once I've accomplished this goal. Now, this is the the number one thing I really want to comment on here. Five years is not a long time. We must start with this. We must start there five years is not a long term goal because we live until we're 80 79 T hundred years old 60 years old 70 80. We live a long time. So five years is not a long term goal. Let's start there. So and when we look at language learning, I actually find a lot of language Learners make this mistake. They think four five six years.", " Long time but it's not and so if you're trying to learn five languages, I'm sorry for languages in the next five years. That's very ambitious. And I don't know if you're going to get there now. I don't know what your definition of learning a language has perhaps you just want to learn the basics of four languages and five years. Perhaps you want to like, I don't know what that means for you. But if you're thinking in five years, you're going to achieve a native-like fluency or even even like a superfluid like an", " Advanced level in those languages. I just don't think that's going to happen in four years, especially when you look at Arabic and German being completely different language families from French and Spanish now again, I don't know your specific situation, but if you really wanted to go achieved a high level in four languages in five years. You better dedicate the next five years to only doing that. I hope you are like living abroad. I hope you're traveling abroad. I hope you're spending hours hours a day studying. I hope you're doing language exchanges like I hope", " Doing what basically no other language learner is doing in that in that case. Maybe you have a prayer but generally speaking. I don't know how pause I don't know how realistic that is. Try see how it goes. I mean, I think everyone should just listen to what I say and then take it with a grain of salt. I think you should do what you want to do. My perspective is it's unlikely, but try it. I mean who cares in my opinion is this go do it and then prove me wrong five years later. Send me a message be like yo eyes when you made this podcast saying I don't I don't think you can do it on.", " Prove me wrong. Like I don't know I could be super wrong here. But my gut says that it's going to be really difficult to achieve an advanced level in those languages in five years. It's just I just don't see how you'd get it done for most for most people a more practical thing. I would I would throw in for you here is I would probably recommend if you want to achieve some kind of level in those four languages in the next five years, you know, maybe you want to achieve like some kind of", " Conversational level in those four in those in those four languages. You can hold you can make some small talk in each language. That's super practical. That's super doable challenging but very doable and lastly what I'll say here and this is the big thing to everyone and it's something that none of you very few of you are going to listen to me. It's such a difficult concept to wrap your head around but I'm going to keep pounding it because I believe it like so much I need I mean myself too.", " All of us we need to detach ourselves from arbitrary goals. We need to detach ourselves from arbitrary numbers and what we want to accomplish an arbitrary points of time. Why do you need to learn four languages and five years who the heck cares? Why there's no practical reason for it. Absolutely not those no world where you would need to absolutely need to do that like because what happens to many of us as we set these goals and then we start falling behind on them and then we start beating ourselves up we get to", " As makes absolutely no sense. Like I again it's okay to set the goals. It's fine if you want to but you don't want to I mean don't get so caught up. Don't get so caught up that you get bothered when it doesn't happen or if it doesn't happen or if it's frustrating or you're not you're you're you're you're you're not as far along as you'd like actually set it in a recent podcast. I said that I actually think a very good framework for being happy and being a good State of Mind is to never have expectations.", " Do as much as you possibly can to work as much as you possibly can and do as much as you can while still being healthy making sure you're spending time with family and friends and sleeping and eating right but do add get as much as you do as much as you can done in a way that makes you happy but I have no expectations of what the results will be and how long it will take for you to achieve things just do your best and see what the results end up being you can have a general idea of I think it'll be like this. I am I", " All is to get it done by this time, but you know, I don't want you to have a I don't I don't want you to I don't want you to be super attached to it to the point where it disappoints you and crushes your soul if you don't get there like I've got an arbitrary goal of speaking. What did I say? I don't even ever was any more eight languages by the age of 45. I don't really care if I get there. I mean if I don't get there then that's fine. It's not a big deal. But like that's kind of how I want you to approach it in many ways. So have a goal.", " Work your freaking face off to get there in a healthy way where you're still happy, but don't beat yourself up have no don't judge yourself. If you don't get there don't judge yourself. Your progress is slower. Don't don't judge yourself. So anyway, as I said shorter podcast episode is literally just to answer that person's question. Thank you for listening. I appreciate your attention. We'll talk later. Bye for now. See you."]}