{"showID": "0A1GTvNCft6B1bVD2Guioo", "show_name": "Nobody Asked You, Kevin! Podcast", "show_description": "Nobody Asked You, Kevin! is a podcast about music and movies and often about the intersection of the two. ", "episode_name": "Nobody Asked You, Kevin! Podcast", "episode_description": "Nobody Asked You, Kevin! is a podcast about music and movies and often about the intersection of the two. ", "transcript": ["Nobody asked you Kevin.", "Welcome to episode 14 of nobody asked you Kevin. I'm Kevin and I will be joined by.", "Special guest here today shortly, we'll get to him in a moment. But if you couldn't tell this is an Avengers endgame Centric episodes going to be very brief because there are many episodes that discuss spoilers about this movie. We will be spoiling the movie a little bit. No doubt. So here's a spoiler warning right now. We are going to spoil this movie in certain spots.", " Before we get started.", " Does anyone want to get out?", " Over the last couple of days I've listened to over 20 hours of Avengers endgame spoiler podcasts. These include pop culture leftovers the super cast blurred Czar Scenic cast real zodiac bacon and eggs Fatman beyond the leftover every podcast and heroes of noise. So all the mean there are so many spoiler podcasts for this movie, but", " I would just like to say that just start off with it and game is just a special movie. I mean, it's in my opinion. It's the perfect comic book movie. It made me laugh. It made me cry, and yes, I bawled like a baby.", " More on that in a bit as if you heard that laughter in the background it gave me chills. It made me cheer it's amazing film. So I've seen this movie several times in the theater so far. And in my opinion this sort of movie needs to be seen at least two to three times to get the full effect. So with that again spoiler warning, but it's time to bring on my special guest.", " This is a guy who's pretty special to me. I've invested a lot of time into this person's development and well-being. So it means a lot to me. I've referred to him on this podcast before and on social media is the kid so welcome kid. How are you doing tonight? Doing good? Yeah, okay.", " Okay, so I call you the kids sometimes on these podcasts or whatever. What do you like to be called? Hayden Shanks? Okay, Jack's. Okay. We'll just call you. Hey, we don't need you need your full name. So we're going to talk about the Avengers and Game movie, right? Yeah, okay, but before we before we get into that, we need to know a little bit about you. Everybody knows all that my crap about me. Yeah, and people you're going to probably hear him laugh luckily laughs all the time. So", " We're going to know a little bit about you. Okay, so I'm going to ask you just a few questions to get to look the audience understand who you are. So what are your favorite things to do play basketball play football. Hmm basically do math. Oh you like so you yeah, you do like to do math. That's that that you do that all the time. You're really good at math. So I'm glad for that but", " nothing else you like to do watch movies. Watch TV. Any TV shows you like any other movies you like other than this movie?", " Infinity War oh you like the video where a lot? Okay. So what are your favorite things to eat? I love I love food as you can tell I love food. I love food a little too much. But what do you like to eat hamburgers? Hot dogs? French fries Pizza just about everything then spaghetti. Yeah chocolate. All right, so so, um,", " Discussion if you had since you like to play basketball and football and also you have a favorite sports team Lakers like the Lakers. Why do you like the Lakers because they have LeBron James? Okay, but you like you you like Cleveland when LeBron was on Cleveland, right? So okay you till you're more of a LeBron fan, you're not just necessarily a Lakers fan. You're a LeBron if you were to pick again since this is an Avengers episode superhero episode.", " If you were to pick a favorite superhero, who would it be? Who would you pick before you say anything?", " I would say my two favorite superheroes Captain America.", " and Hulk", " So who are your two favorite superheroes? You can pick two can be anybody I don't care who they are. You pick through your choices. They enter and Tony Stark first cousin. Yeah, cuz you're way smarter than all of the other people that's that's a good way to look at it. You like anything else about anybody else or just Tony Stark Iron Man and which this had a lot to do with Tony Stark in this movie. So so we'll talk about", " That but like I said, this is the first time you are on this podcast. Hopefully you'll come on again after we're done here, but we listened in the car the other day right to 2 episode 13 the other day when I did episode 13 that I talked about my theories about what before we watched any game and my theories of what was going to happen in endgame some of them really dumb. Yeah.", " Basically, everything was stupid. Okay. Thanks for that. But some of them did some of them were true though. Yeah, so we're going to go through them like one or two. So you actually were laughing a lot through that. Why are you laughing all the time? Because I we watch we were going somewhere in the Caribou. Are we even going I don't even know where we were going and I think we were going to eat it Portillo's or whatever and we", " Listen to it on the way and you were like laughing your head off for some reason and I don't know why you I think it was because you didn't because you edit your voice. Well, that was my voice. No, it was not I was nope. I didn't edit my voice. It was a stupid too. Okay, so so yeah, you did sound you say you did say it didn't sound like me but this entire", " urgh when I twist talking about end game and how it's an 11-year Adventure over the last 11 years these movies started in 2008. So before you were born, yeah, because when were you born 2009? Yes, so Iron Man and Incredible Hulk movie came out before you were born. So the entire Embassy was born before you it's older than you. Yeah, so if you include endgame 22 total movies in the series if you include Spider-Man far", " Home coming up here in a few months because that's the end of phase 3 of this MCU series. That's 23 total movies and they're all interconnected. So it means that this is huge. I mean, you're young kid. You don't really understand how big this really is, but you'll never see something like this again. So do you have a favorite MCU movie of Marvel Cinematic?", " Automatic Universe movie or two. I mean I can tell you mine first and then if you want to think about it, no, I already have okay Finn. Do you want Civil War Infinity war and Civil War or your favorite? Well, why are those two your favorite mean? It's because they have like Iron Man and Captain America fighting and Civil War and all of the Avengers and infinity War fighting Thanos the big grape the big grape.", " So I think my favorite my favorite MCU movie Captain America the Winter Soldier. I don't I think that's my favorite movie. But after seeing this movie, oh man died. It's going to be hard to not put this at number two, if not number one. So I'm going to say my two favorite MCU movies now all time. Yeah tie between Captain America Winter Soldier and Avenger.", " And game because I really think this was the perfect comic book movie. So like I said, we took I talked about this in episode 13, and we're just going to go back through these theories because like I said, some of them are extremely dumb. Yeah, and some of them did come true though. So, so the first thing I said was that Tony Stark will make it back to Earth and Forge some other type of Infinity Gauntlet thing or whatever to wield the", " See stones that happened. Yep. I was correct that was going to happen. I think that that was kind of for told before I mean they were going to have to get the whole of the stone somehow and we'll talk about that again about some of that stuff what happened, but number two I said this movie will involve time travel travel through the quantum realm and obviously Ant-Man Scott Lang is very crucial to that role. Yep, the storyline that was correct so ding ding ding", " We're going to skip Thanos Farm name because that was just something stupid. I put in I still like decimation Acres.", " That one was the most stupidest one. You didn't order Snappy Valley that one a little funnier. I can't yeah, they are kind of stupid but I sound like a kindergarteners makeup when if you listen, if you listen to me a lot of times I say a lot of dumb things. Yeah. Yeah. So okay number four Hulk. It's going to come out in full force, but take traits on is Professor Hulk. And what did we see in this movie?", " Professor Holt we saw a professor Hulk type character where we saw Hulk and full-fledged green-skinned hulking big old Hulk, but he had banners intellect speaking ability brain perfect. So that was good. Now. This is the one that always I know you're going to laugh at already be can you laughed at it a lot the other day, but I only put this in here because it was all over social media being people being stupid about me.", " Man going up fan houses, but and killing them that way. Yeah, of course that didn't happen and it would never happen. It was a stupid Theory to begin with so", " The next thing was Captain Marvel Thor and Hulk are going to kill Thanos early on in the movie. Like first act kind of stuff is what I said.", " It's kind of true. Yeah, Captain Marvel Thor Hulk all had all had to do with it not Captain America. He was there he was there at the First Act. He didn't do anything but who who killed Hulk Earth who killed Danny knows who killed the big grape in that first vaccine?", " Thor yes or biker door with Stormbreaker lopped off his head, right? So yeah, that was that was First Act stuff. So in Thor will go for the head this time, what'd he do? Go ahead and he even said that I went for the head. So I said Immigrant Song would play I love that song so much. I'm kind of glad they did put in there because it would not have fit so so luckily.", " Wasn't in there. This is where I really got something really wrong.", " I thought in this movie and end game. I thought Captain America was going to die.", " I really did and that's when most almost did yes. And when when I was talking to you before the movie, right? And what did I tell you what's going to happen? And what was I going to do Qui up like a baby and it's like stop crying that's going to bawl like a baby because Steve Rogers Captain America is my favorite character of all time. And if he dies, I'm just gonna I'm gonna lose it.", " Luckily that didn't happen. He definitely did not die in the original fight with Thanos because he didn't do anything really he was just there. I thought maybe he would wield the Stark Infinity Gauntlet that was created, but he never got a chance to do that. He didn't need to I also thought since cap was going to die. He was going to come back via time travel that didn't happen because Captain died.", " In the I did get this right though, and I said past Captain America her Captain America goes back to the past and I also said that Bucky takes over for Captain America and I was wrong on that. I really thought Bucky take yeah Sam took over at the end. I really thought it was going to be Bucky but if you watch that scene again, and we've seen it a few times now you can", " See that when he goes back and Bucky tells him goodbye. Like he's never gonna see him again. He's going to miss him. He said he tells him I'm going to miss you and you get a sense that they had some sort of conversation beforehand Steve and Bucky that he knew that Steve was going to go back and stay back in time with Peggy and they had a must have had a conversation that", " He would give Sam the Captain America duties as well kind of give handed over to him. So I wasn't really right on that. Loki remains dead. Current Loki is dead past Loki though. What we see we saw past 2012 New York Loki what happened to him? He took the space Stone in just like disappeared. Yeah. He he stole the he stole back the Tesseract and", " Escaped somewhere. I don't know where he went but he disappeared. Hmm. So that's 2012 Loki still alive somewhere in that timeline making his own timeline his own reality versus 2018 Loki who died in Infinity War dead. Heimdall wasn't mentioned. He's dead. Good Maura mean it was an interesting thing because of course Kimura was sacrificed. Yeah, that's", " As an 18 Gomorrah was sacrificed in Infinity War for the Soul Stone, but 2014 Gomorrah came back to present day, but she wasn't killed but she disappeared she disappeared. So we don't know what's going to happen there. It'll be interesting to see cord. I said Korg lives we saw cork didn't we that was one of my favorite parts of this movie and I'm sure you probably", " really liked it as well because when we go to new Asgard and we see the words little place, but who's in there Korg and meek the other guy Meek plan but night together for pizza and drinking beer. Yep. It's one of my favorite Parts though is when that guy called them a I think he called him a dick Allure dick head or something and he names the new Master the new Master.", " And then he gets thrown there and Thor threatens them and takes care of him and he leaves the game. But that was one of my favorite parts. I mean funny or parts of the movie Sherry came back. I was right on that. We saw her at the end. She was after everybody came through those portals. I do kind of want her to take over for Tony though. That would I think that would be neat kind of having Sheree be the technology person could be", " Pretty neat nothing was mentioned for hella from Thor Ragnarok. Definitely. I mean she that was taken care of there. But I really thought maybe that would be pretty cool to at least see her somewhere or see Ultron somewhere as well Quicksilver not mentioned at all in this movie. He died during Ultron Age of Ultron movie. He's dead kind of worthless character and in these movies so didn't see him.", " in", " what else there were no, I thought there might be a mid-credits or after credit scene like a legitimate after credit scene kind of maybe foreshadowing fantastic for something but we didn't get any of that which I think is I think is okay. I mean, I think I mean not everything needs a post-credits scene, but hey, we'll see because we still got another movie coming here in a couple minutes with", " Spider-Man far from home which takes place directly affect. Well, no, I don't go to Japan. Where do they go to France or something? Don't they are damned vacay go on vacations school vacation in France or someplace. So I think it's France. Hmm, but either way but it takes place after infinity war or after infinity war and then after end game so we'll see how that plays out because as we saw when", " These people were snapped. They were gone for five years. Then when they came back they were that same age that they were snapped. Everybody else that lived is not 5 years older. So say Peter Parker was 15 when it happened. Well, he's he was 15 when the snap happened when boom snap happened. He was 15 he died.", " Everybody else turn the next five years then continues to age and in their 20 after five years. Well, then Peter Parker and everybody else is brought back after that five years in the snap again, and he still 15 all of his friends that were that lived that didn't get snapped are now 20. Hmm. So you mean there's a little bit of an age difference now between so it'll be interesting to see how they handle that in.", " Far from home, right? Yep, it'll be interesting. So those were just my theories of the movie.", " Overall and game. What did you think about endgame? Did you like it? Did you not like it? What were some of your favorite scenes? I liked it. One of my favorite scenes was like when Thor just chopped off then I was just the break hate the big grape trapped of his head of Stonebreaker that was on your favorite scenes. That was pretty good scene. I mean, I didn't know it was happening. I didn't know it was going to happen to me all of a sudden just out of nowhere.", " And when Captain Captain Marvel came in and like destroyed then after ship from 2014 that was pretty cool where she she just come out of nowhere and heard the atmosphere and just flew in and then their ship started pointing and shooting at her and then all of a sudden she just flew in and just obliterated that ship that was pretty neat. So it's overall you liked it a lot. I mean, we've seen it three for with our three or four times whatever it's been", " So we'll briefly just run through these different things away. What happened? Yeah in the movie because this is like I said spoiler episodes, so", " Get out now again, if you don't want to hear any of this stuff, but we open the movie with Hawkeyes family being dusted. Yeah, and I was glad to see Hawkeye again, but kind of a sad sad situation because how would you react in that situation all of a sudden your family shooting bow and arrow and Everything Archery with your kid and they're going to make you a hot dog, and it's that kind of bothered me what I want.", " At that one bothered me in that.", " Okay his wife. Yeah, I can never remember her name in the movie. But I know the actress's name but not her name and the movie but she asked if mayo or mustard on the hot dog. Yeah, who puts Mayo on a hot dog? Yeah. I love Mayo a hamburger. I'm sandwiches whatever I'm French fries. I am a french fries all the time chicken sandwich. Whatever might be. Yeah, but", " Who puts Mayo at hot dog? Do you have your hair? You ever had met Oneida? Nope, no mustard. Yes, we had that one kid asked for ketchup. So that's the one that really bothered me that most there next we see Tony and nebula in space and all that stuff. I'm going to just briefly run through the stuff. They were rescued by Captain Marvel. They come back to earth Tony throws a fit because he's angry he's been", " Space for 20 through 22 23 days, he's kind of they've been living off of crumbs and probably don't have any very little water to drink. He's pretty pretty sick. I mean, he's pretty in a bad mood. He's angry. He's upset doesn't know what to think. He's suffering PTSD whatever it might be he is not physically well, so they get together Captain Marvel and all that stuff comes out which", " which the group then eventually goes and finds Thanos. He's on his farm and he used the stones to destroy the stones.", " So like we said the word then cut off his head. It's still break goes for the head with Stormbreaker kills Thanos.", " Anna flashes forward five years five years later", " Ant-Man come a man comes back at that point in time as well via the quantum realm where five hours was five years five hours to him was five years to everybody else. They go to Adventures headquarter. He talks to Steve Rogers and Tasha. They then go to Tony who has a kid named Morgan. He doesn't", " A part of the plan and I don't blame him Danny found out time travel is well, I don't blame him. He's got a nice life. Leave it out on a lake. He's he's got a kid wife. He doesn't want to have anything to do with you got a nice life now and yeah, but Steve Natasha and Scott. Amen, they even seek out Bruce Banner who then we see the first part of Professor hook right, which I thought was pretty cool. Laughs. I thought it was going to happen, but my favorite part of that.", " Conversation was what do you think? I don't know the whole kid taking a picture of the kids come up to him and he take his picture and he has Scott takes a picture. But no no what? No, we don't know. I don't want you swearing or anything. I'm here. So but but he but he even dabs. It's tells them to stop laughing. Well, it was funny, but he", " He tells he's like listen to your mom. Your mom knows better. Whatever. I just thought it was funny. But I love that entire scene. They do time travel tests. They go back with Scott and Bruce and they figure out the time travel stuff get the quantum realm and then he comes back and he's as baby baby. Well first it's teenage like a teenage kid. It's like then it's old man Scott. It's baby, then it's baby. They cut the power and then he he", " His regular self. Yeah, then his regular C comes back his regular self. So they kind of mess it up a little bit Yeah, and Tony's runs to the headquarters. He's figured it out. He gives cat past his shield, which is pretty cool. So now because cap has been using the wakandan arm Shields and all that stuff. So that's really the only time we see kind of a truce between. Yeah between Tony and", " And Steve because they've been at it since Civil War. Hmm. So after that, what is Hawkeyes track down, that's a whole other story. They're pretty neat where Hawkeyes kind of turned into Ronan and he's killing the Yakuza and and people in Japan he's gone. He's in Tokyo. So they track him down. They track Thor down at that point in time five years later.", " And yeah, you can be played for it now. Yeah, I wish Thor now has his dad bod. He's kind of he's kind of fat. Yeah, he's got a big cut on them kind of kind of reminds me of me. It's about the only time I've ever looked like Thor", " But then the so they were get them back and he comes back and and they explain the time travel process and they break up in the group's Black Widow and Hawkeye go Devore mere 2014 the Soul Stone. It's soulstone nebula and War Machine go to Morag and 14 to get the power Stone Power Stone cap and Hulk and Iron Man Ant-Man go to New York in 2012 to", " you get all three stuff well to get the Tesseract the which is which Stone, you know, what pow no, you're said power. Oh Tesseract space stones and then they to get Loki's scepter, which is the Mind Stone and then they are that Hulk kind of goes off on his own to get the time Stone from the ancient when he encounters the ancient one from Doctor Strange.", " But that's where we said earlier that hope low-key kind of escapes the may have to go back to 1972 get through Tesseract back. Then the word rocket go to as Garden 13 for which Stone the reality reality Stone and then and one of my favorite parts from that won the war gets", " what's Milner about mjolnir back? Yes, exactly.", " And then while in for Mirror, unfortunately.", " Natasha dies. Yeah, Natasha dies. She has sacrificed for the Soul Stone. That's quite sad. I didn't see it coming. I really thought Haka Hawkeye was going to die. Yeah, I really did. So when she died at that very much surprised me, but they retrieve all the stones. Yeah, they get all the stones back. Tony builds his start gauntlets. They assemble the stones. Yeah Hulk attempts to use the stones because he's the strongest Avenger.", " - Thor thinks he's the strongest Adventure. But but he's in the best shape. And like he said it was kind of built for him since it was they give off some sort of gamma radiation and that's how he was made. So but he hurts them back. He hurt himself pretty good in the process and his arm burned his arm all up and everything and but he snapped them it works.", " But in the meantime nebula from 2014 it come back in place of the nebula from present day and she had been let in Vanos from 2014 and so they came down and they blew up the entire Avengers headquarters, which was I'm surprised any of them survived. I almost didn't I don't know how they didn't survive. I don't know how they survived all that all that fire down from Below.", " From above Daniel system tells nebula to get the gauntlet and the stove. Well it hard to get this songs. Yeah, Hawkeye gets the gauntlet cap and Iron Man at Thanos.", " Confront the an Ozark cap Iron Man Thor confront Thanos and start to fight him. And then one of my favorite things ever happened in this scene Captain America picked up Milner. Yep, Captain America wielded mjolnir. He is worthy. Yeah, and you saw that in Age of Ultron in that one scene where he kind of picked.", " But he was trying to struggle to pick up any kind of wiggled it. Where is nobody else even came close other than Vision Vision it up because she's just a robot. But but he wiggled it me wiggle just a little bit Ultron and he is definitely worthy in that that moment right there that that was amazing where he picked up mjolnir and flung it at Thor front fucking had a nose. Yep, not dormant.", " And even chat it off a shield a couple of times and summon the lightning struck him down lightning a couple of times and then what I thought was pretty amazing and I don't know how this happened but they nose took his little double-edged blade sword thing and he just like sort of chopping away at that cap shield, and I don't know how that happened. What is that sword made out of", " Because it's a vibranium Shield. So what I don't know how taken 20 shots though yo-yo who's taking a bunch of shots, but nothing is ever really torn up that shit like that mean that was just eating away at that shield and mean it's not like they knows had like the power stone or something and he was like more power means obviously very strong. Yeah, but he's from 2014. He doesn't have yeah, so I don't but that was pretty cool see", " even though I mean overall", " What else happens coming off? This thing knows calls in reinforcements that should tari the outriders all sorts of crazy stuff happens Captain stands alone against if Thanos and I never buddy and there's that one. It's a really a really cool scene because I actually have a picture. I'm going to show you a picture on my phone right now. Hmm and of this this is that that scene.", " The landscape of the of Captain America standing alone against all of the other people the Army in this is Army and that's pure comic book stuff right there. I mean that if I could somehow get ahold of that picture as a poster.", " That would be amazing. And so he calls in reinforcements and then you hear something coming through caps earpiece saying this yes am says on your left, right and", " It just blew me away that scene. I love that. I mean that's pure comic book stuff right there. He says on your left, which was a nice callback from The Winter Soldier movie where they're jogging. They're running around the Washington Monument pool and for exercise and cap keeps passing him. He keep saying on your left on your left.", " So we see that and then", " I say it's an oh shit moment. You don't say it's in oh shit moment. But I say it is I can no you can´t so portal opens and then out walks Black Panther and a coil and Sheree and then Falcon flies in and the more portals opening easy Drax and mantas Star-Lord Spider-Man Scarlet Witch the WASP who grows in the frame with the ravagers behind her actually?", " If you actually look very closely and I don't think you saw this nice card game. No, not me. Yeah, it's guard but if you look closely behind wasp, yeah, you can see Howard the Duck back. There is a character each. You don't think you really know who Howard the Duck is but Howard the Duck made an appearance in end game, which was amazing pepper plot spots flies into the scene is with her rescue armor on Bucky and group Papa Valkyrie rides into a Pegasus.", " Giant man emerges Hulk rocket war machine or all there? Yep. Everybody's there the sorcerer's everybody Condon armies and then we get a complete fight complete battle, which is pure comic book brought to life for like the last hour. I mean that's that that last hours just pure fanservice pure. Joy The Gauntlet is thrown around from person to person.", " If you actually pay attention to who gets thrown to me Hawkeye loses it to Cha a black panther picks it up Spider-Man get by term and gets it and who's the last person to get it Captain Marvel Captain Marvel. So then you get the all we'll need superhero seen kind of like the old 8D the a force. I mean, you don't know the forces, but it's an all-woman Avengers team you get that seam, which is pretty cool Captain Marvel flies the", " Tones to the quantum device tunnel or tries to for Thanos destroys it with his sword which I am calling crap on that scene because how fast can Thanos really throw that blade because that was flying he threw that faster than what Captain Marvel was flying. Yeah, which I don't I don't get it happens, but I'm Carol and Janice. Yeah, it's really long Carol and Thanos fight danis eventually head.", " Sir, I think and he does she don't even Flinch just it reminds me of that scene. If you remember Batman Superman Batman v Superman where they're fighting and the Kryptonite wears off. Oh, yeah, and in Batman just kicking Superman's but for a while hmm, and then all of a sudden the Kryptonite wears off and Superman gains all the strength again and then all of a sudden Batman punches Superman, he's punching and punching punching him and then all of a sudden", " it just clink. It doesn't even feel it. Just like he hit metal and it was like kind of like that scene. They knows headbutts or punches or whatever and it's Clank. She doesn't even Flinch tell you to feel it. So that was pretty neat Thanos gets the gauntlet and tries to use it. I mean Captain Marvel takes the gauntlet down tried to take it away eventually, Tony.", " Gets in gets into it with him as well. Grab some stones and snaps yet. He grabs the stones and then before he snaps it what's he say? I might I am Iron Man just like how he started the entire thing in 2008 with the ending of that movie. I am Iron Man. I know that it's confusing. It is one thing to question the official story and another thing entirely to make wild accusations or insinuate that I'm a superhero. I never said you were a superhero didn't", " Well good because that would be outlandish and fantastic.", " I'm just not the hero type clearly with this laundry list of Character defects all the mistakes. I've made largely public.", " Yeah.", " truth is", " I am Iron Man.", " All of daniels's army starts to dust and then else does as well.", " And then the scene that has made me cry multiple times Tony Stark that Tony Stark Dice and that scene first few times. We just got back from seeing it earlier this evening. I didn't cry this time the last few times. I've seen it I cried. Yep. That was pretty emotional. I mean, I wasn't expecting Stark to die anyways in this.", " Aries but he did and we see him at the funeral in all the superheroes are at the funeral of the Avengers are there it's a nice one. Nice nice seam and then cap returns going to go back in time to return the stones to their rightful times and he doesn't return. Yeah.", " Until he what you see him on the bench he returns and he's old man. Yeah, which I'm glad they did it this way. I am glad they did not kill him off.", " Because what would happen if he would have died you ever cried more? I would have cried more. Yes, I and so he went back in time to return the stones and he stayed behind hmm and and went back to the 40s and where he was able to get the last dance with Peggy. Yep. Yep, get his dance that she was saving for him and lived his life until he turned old with Peggy and and then he returned to", " Day and he gives his shield. Yeah to who Sam to Sam. He gives us Shield the same and it's basically turning over Captain America to him and at that point in time the movie than ends with Steve and Peggy dancing can Flash the back to the 40s and that reality and them dancing which was beautiful and", " Did make me cry as well the first couple of times again, I didn't cry this time. I'm very surprised. I didn't cry in this viewing but I'm a big baby. So what can you say it's those sort of things get to me. But so overall I mean again, do you like it a lot? I mean you liked it and anything else you want to say about this movie.", " Because I again I think it's now in the tied with Winter Soldier as my favor MCU movie in the series of 22 movies. It's it's an amazing movie people if you haven't seen it yet go see it if you've seen it once go see it twice if you seen it twice go see it three times. If you've seen it three times go see it four times. It is an amazing movie so high", " Highly highly highly recommend it. I mean it's its comic book come to life. It is a perfect comic book movie it there's nothing much more than I could say about it. Other than that. The only other thing I will add to that is the music that's played during the movie The Score Alan Silvestri did the score and it's amazing. I've listened to the entire score if you haven't", " To and its entirety highly recommend it overall that main Avengers theme it's kind of a pretty generic piece of music. I mean, it's not like iconic at least it never really was iconic but it is now I think kind of like Batman 89 or John Williams Superman theme or those are really iconic pieces of music, but I think this Avengers fanfares Avengers theme has now become very very iconic it stands out.", " Its own in its own right? So again, just listen to the music from end game. I'm going to play this entire song. It's about 3 minutes and 15 seconds in length. So just bear with me while plays but it's fantastic piece of music because it's called main on end by Alan Silvestri and it's the actual song that plays during the end credits of and game.", " That piece of music was like I said played over the end credits of endgame and that transition at around 1 minute 56 into the Avengers theme gives me chills. I mean, it's so good. So so good just chills. It evokes quite a bit of emotion and it might just be me, but hey that that piece of music is perfect.", " So again, check out the score if you can.", " Is there anything else you'd like to say before we sign off here? No, no when you want to come back on another time and talk about other stuff. There's nothing else you want to say to anybody out there. Other than you want to say. You probably should go see this movie people. Yeah, you should probably go see it probably should go see and gay people. Listen to Hayden here. He knows his stuff."]}