{"showID": "0A1iNmwn0VjegiQ8kBXc4u", "show_name": "Cephalon Squared: A Warframe Podcast", "show_description": "Cephalon Squared is a regular podcast about Warframe. Join your Cephalons Greg & Lucas every week as they discuss recent news and announcements, and provide tips and tricks for new and old players alike.", "episode_name": "Cephalon Squared: A Warframe Podcast", "episode_description": "Cephalon Squared is a regular podcast about Warframe. Join your Cephalons Greg & Lucas every week as they discuss recent news and announcements, and provide tips and tricks for new and old players alike.", "transcript": ["Curious he would make an excellent cephalon 1000 welcome to cephalon squared a Warframe community in podcast find out how to join the collective by heading over to our website at cephalon squared.com. Now here are yoursefl ons Greg and Lucas", " Can I flunk elective and welcome to episode 61 of f 1 squared again? I'm your host Seth long Greg joined by other host settle on Lucas. How you doing? Good. I'm doing good. It's good. Things are good. That's great, except for the fact that we are recording this for a second time because one of us is an idiot. I'll leave that up to the list as to figure out which one we only recorded about 10 minutes.", " So 13 14 minutes, so it wasn't too bad. But still it's annoying. Anyway, that sounds just being frustrated with me being an idiot. How's the weather up in his twitch the weather up in Ipswich? It's currently 18 degrees Celsius with a 63 percent humidity. This is very true. And that is everything degrees 64 degrees Fahrenheit down here in Melbourne Town 50 degrees Celsius 59 degrees Fahrenheit and 89% humidity in fact it", " It is actually raining. And again, like I said to you earlier, I am jealous. Hmm indeed actually, it's been welcomed because it hasn't rained terribly much recently for memory. I can't even remember to be honest. My brain is just no good when I think back on the days has it been raining? I don't know. The good thing is I was supposed to mow the lawn this weekend and now I don't have to and my wife's giving me a nasty side I but me on the inside. I'm like, yes.", " Jumping up and down with Joy and they don't backflips what you get up to in one frame or gaming in general. We it in Warframe. We did our usual Friday night and Saturday nights dreaming we did that was a lot of fun actually did a little bit more streaming today for think just over three hours nice and earlier on the week. I played the demo for code vain. Damn. I want I need you should get", " Yet I think I will I just don't know if it's going to be PlayStation or PC dilemmas dilemmas. Mmm. Either way you will have a wonderful time. Yes. Yes much Wonder to be had it is very good. Actually I played the demo as well and really enjoyed it. In fact, I'm thinking maybe I enjoyed it more than lemon. Yeah. I'm kind of feeling that it's hard to say because at the demo is a lot shorter, but yeah, I mean, it's just the", " Tile yeah, and the content matter so it's about vampires this time. It's a bit anime. So it's right up. Our nerdy Ellie's is basically anime Dark Souls. Yeah, nothing wrong with that. No, and it's well done as well. So yeah looking forward to that. We didn't do Smite night on Monday because I had a review to do so. I was playing greed fall over the last couple of weeks breed fall is a really good game, but the review", " Was due Tuesday Morning last week and I was feverishly writing out my article and editing and doing all that stuff. So apologies to anyone who wanted to tune in for this might not but we will be doing it briefly tomorrow. I do have to take a Interstate trip this week. So but I do want to get into some Smite tomorrow because otherwise I'll miss it. It's fun. Yeah, I'm not intruding. Yeah plus of course Borderlands three, I'm really enjoying it. If you like Borderlands, you'll probably enjoy it too. If you don't like Borderlands, then it's up to you. I didn't like bottle.", " One or two, but I'm really loving three so go figure it's the same thing as all the others do fair enough. Uh-huh. It's a busy one today. We've got a fairly long interview with Raven from our Discord. We've all had a go at the early game again. So we decided to have a bit of a chat about what's that's like it's an interesting discussion. We're going to hold Myriad of topics. So I recommend you listen for that one. Of course, we've got our beginner and advanced topics. We'll get to those later.", " So I guess we should just crack on into the news. What do you think weakest? Let's do it. Let's Okay. I'm going to start this time the renowned pack 17 is out on PS4. This comes with an obsidian sign down at and an obsidian ephemera. Plus it comes with a three-day Affinity booster free day credit booster and platinum sounds cool to me no ice while on the switch. We have the esteem Pack 3, which comes with the mag opal skin the current opal skin plus Corinth", " Three-day affinity and a 3D credit booster with Platinum now free Corinth. Holy damn lucky. Wow, well free and inverted commas because you do have to pay for these things. Yeah. Yeah. Yeah, but they're pretty cheap. Those those booster packs. Yeah, and there really aren't good good good content in them the great especially with Curtin. Oh, yes we yes. Alrighty and also on Console news the site of ultra update has finally been served a", " into certification for all console platforms. So I would expect it within the next couple of days depending on when you're listening. So get excited for gas gas gas gas and next up. There was a topic thrown out onto the Warframe forums for new changes coming to arbitrations patricians are expected to get their duration that price duration is dropped down. So instead of having to do 10 waves or 10.", " Minutes, they're going to be dropped down to the normal five minutes five waves the end o rewards for these will be dropped by 25% So in the long run it's worth more and oh there's going to be ten new items added to the drop table five of which are going to be all reformers and the other five will be new Warframe arcane's lots of interesting goodies to be seen in addition the", " Alba tration drones will now have a chance at dropping vytas Essence and because of this the vitis essence requirements in the arbitration store will jump up in price. So yeah changes should changes but they do sound like some interesting changes the new or is actually really different. You've got some different ideas. They do. Yeah. So looking forward to seeing how that goes. Now, of course, this is a work in", " Progress it may or may not change. I don't change much but as I was saying to Lucas when we were discussing this the other day on stream. I'm not a hundred percent sure how for how long this will bring people back to the trations. We'll see I guess. Yeah, this is true. Was it Tech potato was saying that he thinks most of the rewards that they're adding in our kind of gimmicky and won't really really be worth getting in his", " So we will only can only wait and see. Yeah, I mean there's plenty of people out there who completionists you want to collect everything, but I think they're in the vast minority. Plus there's no way of kicking off which much you doing don't have manners to say. Yeah. Yeah check out the mods in your codex of course is actually a checklist. So it shows how many times I've looked at that.", " I think it was once when I first started the game and I've never looked back since fair enough. Okay completionist, maybe other people maybe not. We'll see. We'll see once we've got more concrete details. Anyway, the the team went to the whole team, but some people from the team went to Tokyo for Tokyo game show and also to celebrate 1000 VIP with their Japanese fans. And now this is just a bit of a excuse to get together have a few drinks talk to the Dead.", " Was but this time around I also showed off marketing real and this video that they showed was essentially an advertisement for Imperium very very heavily on the marketing front which suggests to me that maybe things are starting to get long in the tooth for Imperium. Maybe we'll see it sooner or later rather than later who knows it was a very well polished video, but at the end of that video they also", " shared some stuff that hasn't been shared anywhere else and that is the upcoming Prime access. So they showed off Atlas Prime with what looks like TECO Prime which are the just blades I guess and death Cube Prime, which is really interesting. We've been asking for another Prime Sentinel for quite a while and death cube is one that people like because he has a cool name. So I'm looking forward to that. What do you think we guess I'm interested in death Q Prime and that's pretty much it. Yeah.", " Yeah, even though I used to really like Atlas none of these as interested in him as I used to be sadly because I do know that he's just okay and not really useful in any way. I just want to like him want to lock in want to love him. But still I'm not looking forward to it. We'll see how it comes up. We really need more information because the only video you can see at the moment is very blurry. Yeah Prime bacon is on its way it is it is very soon to because when I saw that I decided", " Take a look up when we can prime was released and he came out on July 6th. I think it was which is the day of 1000 conso.", " Three months from there is October 6th. So that's soon yeah, not not long away at all did not realize it. Anyway, did you want to read out our Prime volt winner? I'll let you do that one because I want to do the other one. Okay. Yeah, no worries. So you may have noticed if you've been looking at our socials over the last few weeks. We've had a few competitions and one of them has been for the prime volt and we do have a winner so drum roll, please.", " That was quite the drum roll Wade Mills where you have one the prime Vault, so I will get in contact with you via email to gather the information. So, of course, I'll need your platform and your in-game name so that I can pass that on to D, and they will assign it to your account. So thank you to everyone that entered the competition. We did have quite a few entries. So thank you to all sorry if you were not the winner, but congratulations.", " Relations to Wade. Yay. Congratulations next one. Now you can do it and then the last piece of news is our capture calendar contest we've so far. I had a lot of great entries but there's still one week left. So if you have not given us your capture to be a have a running as a an entry for our upcoming 2020 calendar, then you're too weak for this contest the contest.", " Shit the kind of brain it's the contest is for capture an image of motion. So all you have to do is get Moshe something that is moving and send it to us in any way you can get in contact with us. Remember the easiest way if you don't know any other way is cephalon squared at gmail.com. Otherwise, that's Facebook Discord Twitter all of those wonderful places. Send us your image one image per person if you send us more than one we will only accept", " at the first", " Were there any other rules now? There's pretty much it. Yeah, September 22nd is that you date Australian time? So keep that in mind that might be September 21st 21st for Americans seconds on September 22nd in the early morning. Yeah, because we want to make the announcement on that next episode. So I do want to say though. We do have a lot of really really good entries. That's not to say that you shouldn't enter But enter give us more. Yeah.", " Definitely enter, please enter. It's just going to make be tough to decide. It's really high quality. So get them in get them in do the thing. And did you win 300 Platinum that's probably important. There'll be three winners to so there's a good chance of winning and those three winners will be the first to get put on the list for our calendar. Exactly. We will be creating a calendar towards the end of the year and those images will be going in and of course entry in the competition implies that you're happy for us to do so we will", " Be crediting you in the calendar, of course. Yeah. All right now like I said at the start we do have an interview this week or discussion. It's more of a discussion and we invited one of our disc orders in and that is Raven x99 and we have a good old chat. So rather than discussing it again, let's just play it but I did want to say one thing that I forgot to say to Raven when we had him.", " Raven has been a very strong supporter of us since the beginning really and I just want to say thank you to Raven and of course I will say this to him privately as well. But hopefully this is a little bit of a surprise for him when he listens to the podcast, but I did want to say thank you and Buddy slipped my mind when we were recording because it was midnight apologies. But thank you too Raymond for all your support over the last however many months. Thanks Raven on to the interview.", " You alrighty today. We have Raven from our Discord or Raven x99. I should say from a Discord who has joined us to talk about the early game. So Lucas and I as you may well know have started replaying the game. Well God, I started playing on switch. I started playing on PSC. I started playing again on Xbox. All of that was a long time ago, but since we both got new PCS Lucas and I have both", " Smash through a PC accounts fairly recently and Raven recently decided that he wanted to look at the early game himself just to see what it's like for a new player joining the game. So we thought it might be a good discussion around.", " What the game is like for new players and whether or not you know, what we think is good. What we think is bad etcetera. So say hello Raven. Hello. Thank you for having me. Thank you for joining us. Thank you. Welcome to the show. So how long now have you since you started your little experiment a little over a week? It feels like longer. It does it does I actually have a spreadsheet and and if if you know me on", " The Discord, you know, I'm famous for my spreadsheets. I start I started on the 5th and today is the 14th so nine days. So that's what we love about you if there's anyone in outfit and I'll describe who's absolutely regimented and absolutely has everything recorded, right? That's a good or bad thing. Hmm. It's definitely Raven so nine days in and how far are you now? I just finished the Natasha.", " Quest so I'm a mark for and I've cleared most of the early planets, but I kind of blew through the last two, you know, Jupiter Saturn to get to where I could start in the Tha so now you're in a so Neptune Uranus. Okay? Yeah because you've got to do the scans and the scans boy. You got tough at that stage. I found it. I found the gang gets really tough around something actually, you know, that's that's part of what we're here to talk about. So", " We took really different approaches. I on Xbox and PC started playing the game and just sort of played it here and they're very casually Lucas when he started his PC account wanted to get through it as fast as possible and you've taken a different approach. So I'll let Lucas sort of briefly go over how he approached the beginner and then we'll pass over to yourself again. So Lucas go for it. Very brief. I went in a straight line straight through every", " Will Planet I could as quick as I could didn't stop to pick up new weapons new frames or anything just went in a straight line. So how many weapons do you have now Lucas? I think I've got like three secondaries, maybe five primaries and", " for mellie's that's funny. It's actually pretty similar on my account. I've got maybe five secondaries five or six primaries, but I've got a shitload of MLA probably 10 to 15. Don't know why just do all right. So you smash the right? How much carrying did did you utilize very little actually yeah. Yeah. Most of it was just solo play. There was a couple of times I think I needed.", " The kuva or something for something along the line. So I got one of the guys to give me a lift to a coup viable. And that was something that was pretty much the only carrying I took everything else was just solo straight through surprising because you smashed yeah really quickly. I did it was 36 hours to get to the end of this Archer Dan. Well, I guess it's good knowing what you're doing. Yeah. Yeah. So what's your approach Raymond so-so", " Part of what I was doing here was trying to play through the game the way a new player would approach it except knowing how to do everything and so, you know, I cleared all of Earth and and then I cleared gosh. I've already forgotten what the next planet is Venus Venus and Mercury so I've taken a slightly slower approach to it. One of my goals is I don't want to get taxied. I don't want to get carried but", " But oh that that early grind is so hard it is it takes so long to rank up those mark one weapons. And so it's been it's been an interesting experience because yo, my first thought is what's the first weapons that the players run into, you know, because you get a free bolt or after clearing one of the early Junctions and I played with the bolt or a lot on my early account.", " And I went straight for the Carrick this time because the Carrick I really like the the assault rifle Style style of play and the Carrick is an mr1 weapon and it cost sixty thousand credits to craft that kind of thing. So and that's what I've been playing with since I only have I think I only own for weapons not counting the ones in my Foundry. I've got a dance till 6:00 or 7:00 in the", " Boundary that I just you know, I haven't haven't had time to rank up. So yeah, it's been yeah, definitely a little slower. I didn't do it in 36 hours. That's for sure. He said I'm trying to figure out how you did that. Well, I haven't haven't completed every single node. So it's just been straight through just doing all the story missions. All the quest lines are the story main quest lines. And yeah, just getting up to date with the story content essentially. Right? Right, and that's", " That's a lot of why I wanted to do this. I have lots of little reasons. I did this and one of them is I just want to play through all the quests again. Yeah. Yeah as if it were a beginning player but one of the things that really triggered it was somebody on Reddit was saying that their son rage quit the game on Earth because he got out of Wars prize and and he said it pushed him into the planes and everybody on Reddit saying oh you don't go to the planes when your", " One, you know where Mr. To or whatever. It's like that's that's later game content your they're way too early and I thought well, but what does the game do at that stage? And I realized that so I went back and I played it and when you get out of ORS prize you have two nodes available to you one is lith and the other is cetus and lith is a let me think a nine to eleven level.", " Mission at that stage and it's like your mr1 your you know, you've got unranked weapons. You're not going to go to a level 9 Mission. You can't do that. So it really pushes you to go into cetus. You get a starter Bounty that's level one, two, three, and and that starter Bounty is easy, but I found when you come back out of there lift has dropped back to a lower level. It's not nine to eleven anymore. Huh? Interesting.", " So they clearly set that up as a barrier to push you into cetus, which all the old timers are saying. No, you're not pushing to see this go do something else, but that's exactly what the game did I was going to say. The other thing is you are really pushed into say this because that's the only way to open the next node to progress through earth, right? That's the gateway to half of Earth is going through the plains, but I think they really expect you to go do that starter Bounty. Maybe dou PSI is Vigil and", " Then move on because then they get the missions get a lot tougher on the planes after that first starter Bounty. Yeah. Yeah. Hmm shit. Yeah, they absolutely do and that's the thing and the other problem with when you end up on the plains of eidolon and this is something I noticed in my plight replays through my several replays through is once you've done that initial Bounty that takes no effort and doesn't take very long at all it puts you back in.", " Cetus I think if you did that initial Bounty and it puts you back into navigation. It might be clearer that hmm. You don't have to keep going back in to see this and now you've unlocked the Nets the next node in the star Chopper because it pops you back into seed us. I think people like, okay, so what do I do and they don't realize we're not finished here. Yeah, right and there's to just leave and go back to the navigation, you know, they end up walking around and maybe they do.", " Do sighs vigil do people need to do so as visual that early don't necessarily think so because to get gaara's blueprints. You've really got to be doing some of those higher level bounties. So I just don't Ray. Yeah. I really think the game it's okay to go to The Plains of idle on and do that Bounty early, but it would be nice if the game explained that you don't have to stay there. Right? Right, and that's", " Of the other thing I've been exploring is where where does the game really leave? You hanging? What what does it not tell you how to do and some of the gaps are kind of surprising. What if and when I when I when I get tuna Tha it introduces teshan and you could go talk to tension way early in the game, you know, go to conclave but if you never notice conclave if you just ignore that console, you never meet him.", " Him and then all of a sudden he's this character in a quest that acts like you've know you've met him before you haven't I think to be fair though conclave was probably expected to have been more successful than it was. Oh, I'm sure I'm sure but there's a lot of those little things like like the game never introduces Squad restores. You just have to find those in the either somebody tells you about them or you find them in the market. There are lots of little things like that that things I wish I", " Known earlier that make playing the game a lot easier the second time through, you know, knowing that there's there's an mr1 assault rifle that I can that I can build with materials that I can get from the first two planets, you know, that kind of thing. So you may also have noticed as well is you mentioned it already and that's how long it takes to level things. That's really because you're fighting against really low-level enemies. And for those that don't know XP", " Does what's the word I'm looking for scale scale. Thank you with enemy level so because you're fighting low-level dudes with a shitty weapon. It just takes absolutely forever. And and if you're doing it solo. Yeah, really do I think it's too long to be honest because I really think that some of that early game experience is a little bit dull for new players. Well, that's something I was really thinking about.", " Was you start out with these mark-1 weapons which are just crap and and they take a really taunt long time to level up.", " And then the other thing is that energy is really rare in the early early nodes. I went through four levels of Defense without a single enemy dropping energy Jesus and and I'm thinking okay, they sold us this this power fantasy with Ninja magical ninjas in space, but you don't get to use your magic very much and and that feels like I really feel like that whole early player experience, especially those first couple.", " Planets could be a lot more Dynamic a lot more fun if they just sped things up a little bit. Yeah, I agree. I think I need to speed it up and then slow it down once people start to figure out things. I don't think they need to slow it down to the PACE that it is at the start of the game. I think that's too slow. But you know, I was saying on the podcast the other day that I saw disco box was playing Warframe. Well, the truth is I didn't just see him there I went in and", " Talk to him and tried to help him out a bit and played a mission with him and he was still using Excalibur his Excalibur was only ranked 8, but he didn't even know you had abilities. Uh, okay, and that made me think and at first I had a laugh because I thought haha, what a noob but then I thought hang on the game doesn't do a really good job of teaching you about using your abilities and exactly like you said raven you hardly get any", " Because even said to me one of those blue things that's what made me understand that you didn't even know what his energy was. He said what are those blue things are said are they give you energy for your abilities? And he said, ah abilities. He said that's when I press R1 isn't it? And so when you're using a controller you have to actually toggle your abilities. So you press R1 to toggle the for abilities that you can choose from and then you press a button to choose which ability and it will always automatically choose the last ability you used if", " You just hit our one so he thought he only had one ability. He didn't realize you could hold it down to press other abilities. And this is something that I thought the game really doesn't teach well because the most fun about Excalibur for example is the fact that he can he's got his radial Javelin. He's got radial blind is got / - and you can use all of those abilities and he never was oh, yeah. Yeah I X I'm playing X Cal because in my previous one I played volts. I wanted to do something.", " For him and and he's been kind of my least favorite character. So I figured I needed to learn how to play that frame and and both radial blind. Radial Javelin. Those are my get-out-of-jail-free cards when things get tight those those save my butt and so not having energy early on makes it really hard and and then it sucks when you if you're playing solo you go down you lose Affinity. So you're leveling up even slower and", " Yeah, and so I was kind of trying to figure out you know, what's an optimal strategy, you know, are we giving the right advice to new players when we tell them how to play and and definitely, you know clearing the star chart doing the quest is a good idea but leveling up those weapons is just so important and and getting them to where you can you can fill them full of mods and then getting the Endo in the credits to rank up. The mods is is it's really such a struggle and", " The big thing for me is knowing I can go to a Dark Sector dark sectors or worth fifteen to twenty some thousand credits every for a five-minute Mission. Absolutely and and so I haven't had a credit problem. But Endo has been Endo has still been a real crunch. Yeah, and it was a problem for everyone all done. Yeah. Oh, yeah. What do you think about the like some I think one of those couple of big problems, but one of the things I was thinking when I was playing through the", " Early game is the early weapons in the game. Boring all of them every single one even the Carrick as an or as an auto rifle is just a straight auto-rifle. That's all it is is nothing special about it. Personally. I think they need to rework some of those low-level weapons to make them more fun and more interesting and give you the more often. I think that's why the ball tour was so attractive when I got it.", " It's different. It looks cool. It fires bolts instead of bullets upin people to walls with it. It's just a lot of fun to play. Even if you can't hit anything with it like me. I think I put to form into my early into my bolt or before I gave it up. But yeah, it's I think I agree on on one level. I mean I like I like the Carrick. I love to the Soma I played with the Soma", " ever because but it's a pretty boring generic assault rifle. But yeah, so I think that magical ninjas in space thing would work better if you had more interesting weapons early on hmm. Sorry. What about what about Mellie weapons hot Woody your thoughts on the melee weapons because I mean even early game they're not great, but we did just recently get the emphasis which is one of the earlier Mellie weapons got a bit of a rework and that our has electrifying", " And slam. Yeah, I just got that blueprint and I have it crafted it yet. I'm not a big male a guy. I really like to stand back and shoot things which is why I like the assault rifles the sniper rifles, but I've played with only two swords so far because X Cal gets a 10% bonus with swords and gotta get every, you know, every bonus I can get and yeah, but the early boat the early weapons are a little dull the the", " Melee weapons are hmm and at night. The one thing I will complain about just as a little aside the the two weapons. You have to choose from or a sword or a staff and those are some of the hardest stance mods to get in the early game. They rely had stances for six different weapon types before I finally got a sword and then the sword doesn't the the polarity doesn't match the weapon I'm using and I'm like, please", " That but I did get voor dropped the Cronus for me and I don't have the Cronus on my main account yet and I got it on my my all. Well, I changed it. They changed it probably since you played at the first time that is guaranteed to drop it the first time you kill him now, is that a guarantee? See I didn't see that's one of the things I'm not really aware of is what", " I don't always remember the early game. Well, so I don't remember what's changed since I started, you know, since I played it last and it's but it's just the Cronus is really no better than the scanner. It's thus Ghana with a couple numbers shifted around it does like the same amount of damage but it does less / it does more something else and it's just slightly faster. I mean marginally faster and that's all the difference between the two so", " So it wasn't a big upgrade. Yeah, I just did it for him are really but yeah, that's funny because I know what she was chasing it for a long time. But yeah it now it's a hundred percent chance of dropping the first time to kill him and then like a 5% chance or something every other time. Hmm. Wow looking at my notes the the something else that drives me crazy and people talk about this but we really need an eight vacuum that being a beginning layer and needing", " in all of those materials and having to go run over all of them until you get tax on and the vacuum mod that is such a pain and that it encourages you to switch to your kubrow and you're not going to have the fetch mod because you know, you have to go to Venus and kill jackals to get the fetch mod. And so you switch to your kubrow and now you're running over stuff to pick it up again. Yeah, it absolutely does not make sense that it's not in a to the character. That's right. It doesn't hurt the economy to do it.", " Place my mind and it just makes the early game more tedious because that's the thing I'm running into is opening. All the crates is tedious, you know having to pick everything up by hand is tedious and and my next goal is to get carrier because I need that I need carrier to open stuff for me. Of course. I think the mod I need for that is Samara sand a probably I forget how much it's going to cost me to get that mod from Samaras, but they", " usually about 50,000 or grinding. Oh, yeah, I mean the game is about grinding, you know, I get that so that but I have to say I'm having a lot of fun and it's a really different kind of fun than playing my primary account. I mean I enjoy both but there's just this sense of their so much progression happening. That's not just ranking up weapons trying to get to Mr. 25, you know, it's it's I'm unlocking nodes. I'm", " Yeah, there's really a big sense of progress. Even though the progress is slow. It's a very different sense of progress in the early game and I'm really enjoying it. Yeah, exactly. And just for those that don't know you Raven, of course who aren't you now Discord Raven is mi-24 on PC. So he is an experienced player. So yeah, this is a very different account for him. He knows what it's like at the end game. So it's an interesting idea and it was it.", " At first I had a bit of a chuckle when you said you were going to do it because I didn't think you're going to keep going for it for very long. My goal is to at least get through the war within. I'm not sure how much farther I'll go past that fair enough the Danny who I play with almost every day can't believe that I'm doing this. You know, it's like, how can you subject yourself to this again? And it's just fun. It's it's I'm the kind of guy that like when I play", " Minecraft I like to start new worlds and start over more than I do play, you know through the tail end of Minecraft interesting. I don't have the patience for that. So we are different people. I'm kind of addicted to it. Oh, but the other thing the other thing that I decided to do with this is I'm not spending any money on it. Hmm, and I'm trying to figure out you know, how does the beginning player earn Platt when they can't", " If Farm much of anything, so what are your thoughts on that so far? It's really hard. It's it's I mean, I'm farman generic Relic parts and selling quote junk route junk Prime parts for pennies on the dollar. Basically. Just trying to get enough to make a single, you know potato purchase and and so", " When my kid played it without putting money into it. She sold her Ayah Tans and I'm like, you're selling your eye at ants, where are you getting in tow? Because my to I attends that I've gotten so far have been incredibly precious because I need that in though - still precious. Yeah. It's I mean at least in the early game, you're not wanting to really put a lot of ranks into your tin rank.", " Odds because you can't fit it all in if you put if you get them all too high. Yeah, exactly. Yeah, so I guess I guess that kind of leads into night wave which we haven't discussed it. All is I wondered how does how does the early player deal with night wave and my first week I could do like to not counting the dailies I could only do like two of the of the things the ax this last week. I was able to do all but one of them which was really cool.", " I didn't do the nightmare mission 1 and I probably could do nightmare missions, but that was just I didn't want to go there then that 10-10-10 nightmare missions is annoying when your Mr. 24. Yeah, but the thing that I really liked was that front-loaded cred that that you get one night wave Rank and you get a hundred and fifty cred which is two potatoes or I've bought one potato and I'm holding onto the rest.", " bought an are a mod because that's something the game doesn't really tell you about is that when you get an R Hamad it increases your capacity and you just have to learn that the first time you get an are Ahmad and and when I played before when we had alerts are is just popped up you farmed them whenever they showed up and that's they were easy to get and now you have to make this choice between I know what a reactor a catalyst does and I can buy", " either that or I can buy one of these are mods that I don't I don't know if those are useful or not until I go ask somebody that's a good point actually. Hmm. It used to just be that you do the do the alert and you'd get it and then you'd find out that it was worthwhile doing right now. You've got to make a choice and you don't know didn't think of it that way and and that I think is the hardest part about night wave is your they've taken all these things that were just catch as can enter.", " Them into a choice and that choice can be kind of difficult, you know, do you buy a potato Dia by nitain this early in the game? I don't need nitain. I mean, I really haven't run into anything that wants nitain yet. So I really don't want to waste my cred on that. But but then after that it starts giving me cosmetic type Awards and I'm like I don't care about these These are frustrating. Yeah. Why am I grinding so hard for these cuz the", " he's boring Cosmetics. When what I want is more cred that it's been interesting. But I also find that night wave when you're in that early game and you're trying to clear the star chart and you're trying to get through the quests night wave can be a real distraction because it's saying go hunt down all these caches in sabotage missions and it's like hmm, you know, I need the materials. So running around the whole map and looking for all of them is good.", " There's some decent rewards when you're that level from the cache has the dual stack Modz if you're lucky. Yeah, I've got I've got at least one of those but but even even you know 50 and oh who ever thought I would be thrilled about getting 50 Endo again, and that's one thing where I feel like the the the rewards don't scale real well later in the game that you're still getting these 50 Endo rewards sometimes and it's like", " Okay. Well Endo is in though, but I need 5,000 Endo not 50, you know, so that's been an interesting contrast. Yeah, just just going back to the things that you can buy in the night wife still have you at all been tempted to get yourself some coover yet? No, I don't have I don't have a use for coover yet. Yeah, because I'm still I can't I can't do sorties. Yeah, so I can't get ribbons and there's nothing I need to craft that use.", " Kuba so I haven't been tempted by it at all. The only things I'm really looking at is potatoes and the arra mods. That's really the only thing I'm interested in because I don't I don't need weapons yet. I don't you know, that'll those weapons I can get later. I don't need helmets which I kind of miss because in my mind when I started previously helmets were just alerts I grabbed every helmet that came along because free Cosmetics, you know, and now those cosmetics", " Our part of that choice we were just talking about it's do I do I buy something that helps me play the game or do I buy a cosmetic and it's like well fashion is endgame. It's not it's not early game. Not anymore. What about more frames? Because I mean you get involved in you can buy move up and from the my wife store, but then what about like your other frames that you can Farm have you really put an effort to farm any let's see that that's", " A big difference between my previous account because when I first started playing Warframe, I had never played a looter shooter. I didn't know how it worked. And so by the time I hit the second dream I had a rhino part and I had a MAG part and I had an ex cal part, but I had one of each because I didn't know you had to go back and and Farm These bosses to get this stuff. So I played all the way through the war within with just my starter frame and that was it crap and as much", " As I enjoy that experience. I'm like, I feel like I missed out on something. So here I have it Mr. For I've got four frames in my Foundry right now. I have Rhino mag Nick's because I wouldn't farmed for it. You know, it's like I knew I knew how to do it. I knew what I what you get out of it and for it wasn't that hard I wouldn't so load for it.", " So at MR3 I did not choose to go on the derelict the the infested derelict thing that was a little much but I could have and I've got one more who is it. I'm trying to remember who you who you can get that early. I'm terrible at remembering who drops who Frost drops on stairs. I don't have Frost yet. If I haven't farmed Frost mag from Phobos. Maybe I only have", " Rear, I know Mac and Nick's. Yeah, looks like I only have three. Okay valkia from Jupiter Nova from Europa MBA from satin. Yeah. I haven't formed those yet. And oh gosh that that fight with Saugus Ruck. I was Nightmare. I made it through the first time but if I had if I did not know how to fight him and I remember that from the first time around fighting fighting likes Argus Ruck is so", " Hard when you can't figure out how it works. Yeah, I went down several times, but I managed to get through it and I'm not ready to farm that one yet. But no by the time I by the time I decided to farm like Rhino, it wasn't hard and I was kind of surprised but some of that's because I know how to mod, you know, and with what limited mods I have. I know how to build a reasonable build on the Carrick that I can I can Farm.", " Call fairly easily. Yeah, so I was kind of thrilled with that. But here's the interesting thing though. I was really frustrated that the first frame I got was Nick's and I found out that of those three frames. Nick's mag and Rhino the to between the two other than Rhino require neural sensors, which you can't get in till Jupiter. Ah, yeah, and so I'm sitting I'm sitting on this completes the complete set of a frame. I like to play.", " And I can't build it yet because I'm far far from Jupiter. Yeah, so I got through Jupiter couple days ago yesterday somewhere around there and it's like yeah, I can start building these things and then it's the three day wait three and a half days a week. And I remember that really frustrated me my my last time through but knowing how it works. I've become very Zen about you put it in The Foundry and you just go play the game and some", " It will surprise you with this finished free. But but when you're nine days in three days is a long time. Yes. Yes, and there's no way I'm spending plat to speed that up. So but so that's kind of been a little frustrating that I've got X Cal completely ranked up. I would like to start on another frame but I'm still two days away to day and a half something like that from having another one and and the next the", " next difficult question is my second frame in my my primary account was Rhino and Rhino just carried me through the star chart and it's like on one hand. I would like a different experience try something new but on the other hand Rhino is my safety blanket. I know I can get through the star chart with Rhino. He's effective. He is he's I'm I'm getting hammered my first time on Jupiter.", " The the Corpus go down about as easily as the grineer did but they're hitting harder. They do hit a lot huh? And and I'm going down so fast on Jupiter and I'm like, uh, now what do what do I do? I don't know how to fix this. It's like, oh well, I've got eight spare capacity on X Cal. Maybe I should think about my bill to get a little extra shield look little extra Health that helped but I'm still I'm doing a lot of hiding behind stuff because my Shields are down. Yeah.", " Especially because I plowed through the planets to get to Uranus and I'm kind of ahead of the curve. Yes. So I'm definitely dealing with a lot of the stuff that I see other early players dealing with it's a balancing act of how much do you go back and farm previous content?", " Trying to get mods. You don't have trying to rank stuff up. Do I put a 4 million my weapon and go back and rank it up again or you know, do I I've got a derelict key. That was one of the requirements for the last Junction I had to clear is craft a derelict key doesn't say you have to go to the derelict. You just have to craft a key. Okay? Yeah, but but that introduces you to the idea of the derelict and that's one of those things that Wharf", " Miss very hit or miss with is telling you something exists so that you can go check it out. Sometimes it forces you into stuff. You know, it says go, you know go Crack A Relic in order to clear this Junction. So you have to learn how Fisher Mission works, but other times it just says, oh craft a key and you can go there if you want to.", " And sometimes it doesn't tell you about it at all and it's just very inconsistent. But at the same time I can see from the developers point of view. There are a lot a lot of things they have to teach a new player and it's easy to miss it I guess and I'm sure it you don't want to overwhelm the player with new stuff. But at the same time I keep looking at some of this stuff and thinking they could work a little harder at it, you know, there's but I have noticed there are places where the load", " Tells you there's an email you get and and we had a discussion on the Discord at one point about whether this email is new or whether it existed back a year and a half ago. When I started playing that she tells you a whole long list of things to do including clear the star chart and pursue the quests, which is kind of the common wisdom that other experienced players give new players is those are the two things you want to focus on and so you get this email that tells you do.", " This says there are there are weapons in the market that you can buy blueprints for it tells you that which is one of the things that I was not clear on when I played and I think some of it is I if that email existed, I probably just I read it and it didn't stick and later because it's got so much information in it. It's like a whole page, you know. Yeah, and and there's there's so much of that that's happening that you're getting this info but you forget about it because you're being inundated.", " So many different kinds of info and and I really feel like the ones the quests or the requirements that say go do this thing. In order to progress are way more likely to stick than something you saw in an email from the Lotus. Yeah was I thinking about it? I can't even remember this email at all. I think it may have popped up for me. I was gone and asked close. Yeah. I don't remember it either. Yeah, and maybe it's new and I just I really kind of", " Wish I had a recording of all of the stuff I did before so that I could compare it. But but see that's that's one of the things that I find really interesting is is listening to the veterans, especially the veterans who have been around for five or six years and you know, they're beginning experience is not the same. Oh definitely not and they're recommending things are there telling people how things are and it's like is that really how it is, you know, because is are you miss me do you miss remember how", " Went did you never experienced it and and we get a lot of help from from especially long-term veterans, you know, they've got a lot of great wisdom but clearly like in this this conversation on Reddit about being forced into seed us some of them were clearly wrong about that that you know, they said the game doesn't Force you there. It's like yeah, it really does. You know, it doesn't tell you to stay but it does tell you to go there. You know, that's really where I've been with this whole thing is trying to review", " You what it is new players experience when I've got that mindset of keeping track of what you need to know what people are likely to miss what the game doesn't actually tell you because there are quite a few things. That doesn't tell you that it really should. Yeah. Yeah, so I'm kind of looking forward to this. We've got our new cinematic intro and I'm hoping they revamp some of the early game and and fix some of this stuff. That's what I'm really hoping they do.", " Considering putting together a little checklist of things and handing it to D and saying, you know, I replayed I replayed the beginning here's all the things. I feel like you didn't cover properly figure fix your shit day and maybe they'll pay attention. Maybe they won't you know D, he's kind of random about that and but they've got so much to keep track of you. Think about how complex the game is. They have to think about how do we introduce all this stuff? And how do we not overwhelm the player and it's a big job than you know, I recognize", " that I'm a software developer. I know what it's like to develop software and how hard it is to teach users how to use a new piece of software that has a lot of complicated features, especially with the changes. I've it's been six years. Now, they've added so many different things and you know, the the introduction to the game has not been able to keep up and I think that's really the main the main issue so", " I agree. I agree because that it's yeah, it's evolved and and the early game. It's like that piece of software. I build that we keep adding features to it, but nobody but it really needs someone to go back and redesign it and integrate all those features properly and and so going to do that's the I'm hoping it's more than just the Cinematic intro and we kind of massage it a little I'd like to see a", " A really good rework of the early game, but that also touches a lot of things. They can't afford change everything exactly. I'm I'm looking forward to it and I'm what's really kind of scary as I'm afraid that when the new player experience gets released. I'm going to do this again. Yeah. I know I am I'm probably gonna go go back and try something and check it out probably won't do as deep as you've done it but nice definitely need to replay and see what they did.", " So I guess that's a good point to sort of because we've come around in a big circle back to where we started now. So I guess it's a good point to close out the discussion at this this stage. But if you've got anything you'd like to say from your experiment as a final sign-off new players should go see Samaras right away. He is available at mr1. And he rewards you with Endo go see some Morris. There's a good tip right there. Tada.", " Damn and dough is friggin so important. So I guess I don't get a suggest that that's probably one people should be listening to I think it's from the from your experience with playing their this town of the game. Again. Again, you have a final thing to say do what Raven did and get rid of them mark one weapons and buy some decent ones. Oh, yeah. Yeah, I agree and all I can say is I really like like Raven has said I really hope they reworked.", " Start of the game because I think it's turning people off that the start of the game is more painful than the rest of the game actually is and the start of the game should really reflect the hold the game as a whole. I'm not sure absolutely does at the moment. So I'm hoping that when that new game experience comes out, it does a little bit better reflect the rest of the game. So that's that's where I'm at. Alrighty, so I guess we'll say thank you to Raven for joining us and we will be of course continuing this discussion.", " Russian and many more on the the Discord. So thank you for stopping by. Hey, thanks for having me. Guess it's been an absolute pleasure indeed.", " Alrighty, so thank you so much to Raven. We very really had a very lengthy conversation as you can see, but it was really in depth. We explored a lot of different things. Raven has obviously thought about this in great detail. And we really appreciate his analytical mind I guess is the way of looking at it because yeah, there was a few things he brought up in that discussion that haven't even come across my mind. So that was really good. It was an absolute pleasure to talk with Raven. There was a there was a lot to consider.", " Night, he even surprised me with a few things. So that was good. Yeah, there were a few things that was like one interesting about to begin again. Hopefully will be getting a rework in however many months. It really needs one desperately needs one in my opinion me clearly people are still playing the game and they love the game and they're getting into the game. But it takes people more than one try. I've found took me three. Anyway. Yeah. Yeah. All right, so onto our beginner and", " Vance topics I decided to do things a little bit different this week because last week the episode we did was very very community-based. So I wanted to do it again. This week was really well received. So I kind of misled Discord. So I told Discord that I was going to be doing at top 5 beginners tips discussion as a beginner topic and I gave them a list of what I thought was a potential top five. But really what I wanted to do was to get people to", " With what they think is the most damned important thing for beginners to learn and that's what they did. So I'm calling this in capital letters top 5 beginner tips according to Discord and there's seven of them. There's seven of them. Yes, because you know, it's it's all about that clickbait. It made me laugh when I wrote it anyway, so the first is from The Man Raven himself, and this one isn't", " Actually a tip but it's it made me laugh. So I put it in there and he said man five most important a difficult and complex game involves a lot of tips and I do agree with that. I didn't disagree in tried. I kind of did I went back to him and said, yeah, we've done a lot of tips. Let's consult and consolidate that was just me laughing. So on the actual tips, we had one from Jay hundred who said the number one thing I would recommend to a new player is to learn how affinity and Mastery Rank works.", " And this is really important because you need to learn how to level up your weapons. And that was part of that the of what we were discussing with Raven as well about how hard it is to level early weapons. What you need to do in order to do that. So, of course new players, you've got Affinity per weapon and / Warframe and of course, you've got Mastery Rank, which is account-wide and in order to grow your Mastery, you need to fully rank your weapons and warframes up to rank 30. So keep that", " That in mind we have had a whole episode or a whole beginner topic about that early in the series. If you'd like to see what that is Type in affinity and podcast on saflan squared.com and you should be able to track it down. The next one was from Doug old your master 145 himself and also one of our mods he said a couple of things but the one thing that I thought I would share from there is that there are a few weapons that you can by using only credits and that is the", " Clatter clatter The Lex and thus Icarus so you can find these that you can buy it outright just using credits. The next was from Trent who is often asking us questions and very helpful. What tremendous said is. It's probably too simple, but without getting into the minutiae of damage simply impact for Corpus puncture for Grenier changed my game play experience and made Venus a breeze. I was using Breton and thought", " This were yucky bullet sponges. So this is an interesting tip and that is to say something. We haven't really focused terribly on yet. We've talked about damage plus we haven't talked about what damage types apply to what enemies so is Right impact works best against Corpus puncture works best against Rania and / works best against the infested and this is important for early game. It's less important in the late game when you've got Elemental damage and that's where things change and", " And because then you're looking at radiation for Corpus corrosive for grineer and don't deserve viral Vibe and fire. Yes for for the infested. So then it all down. Yeah early in the game. If you've got a puncture weapon like Bratton and you're shooting the corpus with it, you might think why is it doing so well against these grenade guys, but not so well against Corpus and that's why because of the", " the damage type that is most used on that weapon. Great tip. Thanks tremendous stoic has a very similar tip and that is a depends how basic each tip needs to be but I think the basics of modding would be really helpful. So for example, put plus damage plus multi-shot and plus Elemental on everything. That's a great tip a really basic tip damage. Multi-shot. Elemental should be important for virtually every single weapon in the game if it's got a crit chance of more than 20%", " Then add last crit chance and crept a crit damage months if it's going to stab The Stance of over 20% then add status chance. I would much rather have that tip than weapons. You can get from the market which is one of the one the top five that I had another really great tip and really simply put as well damage multiple shot an elemental and everything fitscript weapon crit chance crit damage for the status weapon status chance.", " We had awful next is from wishy-washy says keep in mind while playing that you'll be able to farm for platinum in the future. You don't need to spend money. So don't get scared of the prices of cosmetics in the market. When you do look at stuff in the market you go. Wow, 300 Platinum. Yeah, it's not that bad later on in the game when you confirm for Stuff fairly easily and sell them to other players for platinum and tip number 5.", " Is from Creek who got in just at the last second and said I think you need to put in do I need to spend real money in the game or maybe having fun before farming or why are you here? That is what brought you to our frame in the first place and that's an interesting thing to say and I think he's got a good point because what brought you to Warframe in the first place is you just wanted to have fun. So", " Enjoy yourself before you start getting too confused and don't stress out over not knowing certain things. And I think that's something that we don't want to call myself a veteran because some people really love that title. But we longer-term players in the game should keep in mind when we're bringing up our new friends. Don't rush them through things. Let them have fun just because you think those early missions in the game of boring.", " Does not mean that your friend who's just started playing the game thinks it's boring. I mean that's important too and their first question. Do you need to spend real money in the game now, you don't it helps but no you don't absolutely not. So thank you to the Discord for sharing your top five seven beginner tips that you think are most important. There were a couple of really really good ones in there. So thank you to everyone for joining in and I'll do something like this every couple of weeks to", " Has like a community beginner tip. But yeah, sorry for being stealthy we get so that's topic Advanced topic. All right Xmas introduced in update 12 .00. The Xmas were first referred to as leader units. These leader units are of an elite category of enemies and as such possess special benefits one such benefit is that an Xmas will spawn 10 to 15 levels higher than the level expectations of the node average in addition to receiving", " having one of several abilities and stats resistance boosts for all the added survivability Now While most units can appear in an SMS variation certain unit types may only spawn as specific Xmas a good example is that infested charges may only spawn as parasitic Xmas. So today we will explore the several ability types so that you know what to expect when next you come face-to-face with a litre unit starting off with blitz Blitz.", " A specifically of Corpus design and as such you will only ever see them in this faction. The attack of the blitz Xmas is a seismic shock wave which is used to knock down their enemies. This unit type has an innate 50 percent resistance increased to all damage types. Yay actually should just throw this in now all Xmas have a in eight fifty percent resistance to all damage types. Yay. Next we have the", " Energy, leech and parasitic parasitic extremist is a unit of annoyance with the ability to siphon energy from a player within 15 meters at a five energy per second rate units of the infestation that possesses traitor referred to as parasitic whilst grineer and Corpus are called Energy leech. If you thought we were done with this unit type. Then you are sorely mistaken as these units receive a plus three hundred percent boost to their base health and shield along", " Either 50% damage resistance. So that is fan-freaking-tastic. Next. We have the arson and caustic enemies the Arsenic caustic Xmas units give off a fire resistant Torah to their allies within close proximity this completely nullifies any and all fire damage and even goes as far to nullify. The fire damage aspect of combined damage types. For example, if you're hitting them with blast it will nullify the", " fire in the blast turning it specifically to cold damage units of this nature have access to a concussive fire blast that deals damage and knock down but cannot cause heat proc strangely enough this wall of fire can greatly damaged symptoms. So be aweary of close combat as that is the time in which these units will let loose a well-timed role or Mellie guard can protect you from the concussive effect. Again, 50% increase to damage resistance is to be expected and the for the", " You will only encounter these units from the infested and Grenier with the exception of a single Corpus. Enemy. That's only encountered during our Queen missions Guardians are the next one and they are exclusive to Corpus with Shield increases and the ability to recover the shield of their allies. Simply buffed much like the others these proxies gain a 50% damage resistance. The Arctic Xmas is one of the more advanced enemy types with a significant amount of benefits.", " Starting with their cold resistant or out that nullifies all cold damage muck light much like their fiery counterpart last becomes heat, but this Aura has more to it in addition to the cold nullifier effect this Aura lets off a continuous cold proc reducing movement and attack speed that ignores status immunity abilities and this Aura is stackable. So there's multiple you're screwed next. These cold-hearted foes have the ability to conjure their own snow globe that acts very much the same as the one from", " Fuses with the biggest difference being that there's follows them. If you are patient enough though, this snow globe also runs on a duration. So you may avoid ammo consumption where the few additional cold based attacks the Arctic else a has a fifty percent resistance increase and mainly of grinia and Corpus faction special side note a Napalm Arctic Xmas will proc cold on enemies or on 1000 and once combined with the heat from their", " I'm throwers it will turn into a blast rocks. So be very very careful of Arctic napalms. Next. We have the leech and sanguine leech to the grineer sanguine to the infested. This Xmas type restores its Health by damaging his enemies simply lifesteal and again has a 50% damage resistance but also comes with a 300 percent boost to health and shield. Yay. Then we have the shock Xmas these units give off an electricity or that nullifies shop.", " Image of all types including that which is combined with another type again same as what we had before the electricity stat status proc will also be in effect up to 5 meters around the unit. And if a 1000 is within 2 meters, they will take damage over time till the unit is either dead or out of range built to last yet again in eight fifty percent damage resistance. And finally we have the venomous unit which gives off a toxic aura that nullifies all forms of tux and damage in the same sense of the other Elemental or has", " Most commonly found as an infested enemy The Venomous Xmas can attack with toxin damage alongside having a continuous 10 meter radius of toxin proc that lasts for eight seconds and deal substantial damage over time dependent on enemy level and you guessed it 50% damage resistance boost for most Parts. These are the biggest hitting units you'll have to deal with however, there are also a number of missions specific Xmas and they are synthesis targets for Samaras prosecutors of saris.", " Wardens of rescue missions sensor Regulators in sorties and Arkin Spectators in Louis spy, the bonus damage resistance on Xmas units caps out at 90% of damaged of a damage type and all eczema's also possess a 40% true damage resistance for that added bit of fun. Now while they can be a pain they are not unkillable. So start by knowing your enemy very good. That was a good topic because yeah good choice. I'm surprised we hadn't thought of it.", " For yeah, I was actually quite surprised to learn about the elemental damage nullifiers. It makes sense though. Now that you think about yes, yeah, very good. Very good. And of course that will eventually be going up on the website. I say eventually because her my God the backlog is backlogged. It's getting longer, but that's good. It's it's all good content looking forward to putting it up there when I can. All right moving right along now, we're heading", " two", " Love Letters to displace go Parks. All right. So this one was sent to describe Box by a gentleman called Zen and the Art of disco box. Your voice is smoother than the Jell-O pudding and my childhood. I'm guessing that's a good thing. Wow.", " History history. So I think I've now read out all of the Love Letters to disco box that were in my backlog which means we've got none which is a bit sad because I don't want to have no love letters to disco box next week. So please get on out there get onto Twitter send a message to at disco underscore box and tell him how much you love his voice absolutely and copy on 7 1 squared or just use hashtags f 1 squared so that we know about it.", " It had because this is really important. It's important that he knows how we feel about his voice. I'm just tearing up a little bit here. All right onto the community call out bit a little bit of a reviews update. There was another us review. So thank you to the person over in the u.s. Who gave us additional review their plus. There was a couple on cast box which brings our total now up to 89, which is exciting. We only need 11 more before we need to do our next.", " I've cast which is a lot of fun. I'm really looking forward to it. If you'd missed out on the last one. It was episode 50. I didn't record it actually, so it didn't end up going up on YouTube surd Panda Sad Panda. But anyway, that's life episode 50 listen to it. We had a lot of fun. Would you like to read out the iTunes review? I shall iTunes us bike ryuk. Nice work Lads 5 Stars having only just discovered the joy. That is Warframe after a long time in the", " Darkness I must say you guys are amazing also helps that you were both Aziz smiley face you convert and I am looking forward to going back through your mini EPS to get the info on various warframes. Thanks Creek crack. However, you want to say your name. Yeah, we appreciate it. And you only joined the discard yourself a week or two ago and you've also been pretty active there as well. So thank you for your support right back at you. Yeah, and yeah the darkness", " I'm looking forward to Shadow keep on Destiny to control how much I'll play it but I'm looking forward to it was a massive Destiny fan. I feel you. I feel you brother. All right, quick question several. Ankh. We're all right. Do we have a song for that we doing today? Yes. How does it go cephalo question time Ziploc with something like a camera changes every week. I think this one is from cannibal K way.", " Would you like to see more retro minigames tucked away in the Warframe Universe? Hell, yes. I don't play them a lot. But I enjoy them. They make me laugh. Actually. I'd like to I just discovered. This is something I didn't know. Like I said, I don't know if you knew you can actually finish. Were me as and happy Zephyr or whatever. It's called is called Happy's over. Yeah it is. Yeah, you can actually finish them. And if you finish them you get a poster to put up in your ship. What? Yeah, tell me that I know death.", " Will you get that for me? Yes because Pablo said it on Twitter. I do have done it know that for happy Zephyr, so I haven't confirmed it, but I'm pretty sure if you get it for me as you must get it for that. Goddamn it. Okay. I'm going to have to go play it and get it so quickly. What kind of retro minigame would you like to see in the Warframe Universe? Hmm? Okay. So this one I'm actually like literally just thought of on the spot. All right, but basically a Donkey Kong rework like the old-school Donkey Kong.", " Mm-hmm with the other yellow plumber Mario and basically your little plumber is I don't know Warframe some variety. Hmm screw it. Let's actually just say Clem and the donkey and the Donkey Kong at the top is Saugus rocking his giant turkey form. Yep, like it sounds no, no. Sorry, sir - yeah, they had can use ground turkey for I like it because of it. That's the one I was thinking of is Rampage.", " I'd like to see Rampage in there. So you can have chroma got a can't think of any others to put in there in the gas giant robot. Yeah. So chromophore Lizzy gasps for the robot. What about George The Wolf Man move man, that'd be a bit tricky eval kitty. Yeah, that'll do and I'm follows one more money we come. Yeah, we can't be nice. Yeah and just get them climbing through towers and eating people be great.", " Alex well, actually, but seriously any old retro minigames that D wants to think of and throw into the game. I will definitely play a love them. I just think they're silly and dumb and I've played them for like five minutes in total, but I still love them. All right, but I need to get those posters down net-net now. I need a happy zeff reports on hate and happy bird. I hate Flappy Bird. I am not a massive fan of Flappy Bird either, but hey, happy zeff.", " / happy happy happy joy joy. All right, I want to were me as opposed to this one. I want I love myself for it. Anyway that brings us to the end of episode 61. We hope you enjoyed it this week little bit of a retrospective kind of hence the Retro minigames topical if you'd like to get in contact with us for any reason if you'd like to make any suggestions, if you'd like us to ask us to cover anything on the show, whatever you like head on over to settle on square.com. There's a contact us page. Otherwise, you can send an email to cephalon squared at gmail.com.", " Or if you just like to join the collective so fun square.com has the links to our Discord and our Facebook pages follow us on Twitter Instagram YouTube all of that fun stuff and twitch. If you'd like to support us go to step 1 squared.com forward slash support where you can see the ways that you can help us keep the show going and on that note. I guess we should thank our patrons. Let's do it. All right. Thank you to RAF Iraq. Thank you wolfsbane. Thanks Jelly Bean 1799.", " Fine. Thank you a tour of underscore 88 thank science of thousand thank you Lord for his on. Thanks Logan meal. Thank you. Donna fan. Thank you. Silurian. And thank you obsolete ninja 13 indeed. Thank you to all of you for helping support the podcast and all of the other content that we made so that we can make it better. We can improve if you'd like to support as I said reach out to Circle and square.com forward slash support. Otherwise simply sharing us.", " Giving us a rating on your podcast platform joining in on our community. All of that stuff helps us grow and helps us be a better community. So thank you to you as well. And thank you to Ian at this guy - call box on Twitter for the intro and outro as always. Who am I? I didn't do that bit. Did I look at nine? I didn't my name is Greg newbegin. I am mad capsules all over the place Hui Lucas. I am Lukas Silvestri and I am Silverlight all over the place silv are", " RL G HT love the community, you know, it just is just keeps getting better and better and I can't really say any more about you guys because you just amazing. So massive massive. Thank you to our lovely glorious Community. Absolutely. I second his wonderful sentiments and we're cephalon squared. Thank you for listening to another episode. We'll be back in a few more days with who's next gasps. Oh, yeah. We're doing gasps Galaxy night.", " It may not be gasps. Unless you want to write the article if I find time. Yeah, I can do it down. We're saying gas, so it's probably going to be gas, but we'll see. Anyway, thanks for listening. We'll see you soon. Thanks for listening to cephalon squared. If you'd like to contact us reach out there our website at several on Square.com. We can find us via email Facebook Twitter or Discord, but don't fret that we more several on squared in a few short days.", " So don't forget to subscribe so you don't miss an episode."]}