{"showID": "0a1jXZ8LRPJRYWA9mHLW7w", "show_name": "Medscool Podcast", "show_description": "Hey! This is a podcast created by two medical students, Hafsa and Rita. They reveal everything about their journeys through medical school, their experiences and also fun topics. So whether you're a med student or not, tune in for a good time.  Also find them on instagram let them know what you wanna hear and if you want to be featured on their episodes.", "episode_name": "Medscool Podcast", "episode_description": "Hey! This is a podcast created by two medical students, Hafsa and Rita. They reveal everything about their journeys through medical school, their experiences and also fun topics. So whether you're a med student or not, tune in for a good time.  Also find them on instagram let them know what you wanna hear and if you want to be featured on their episodes.", "transcript": ["School", "Welcome to med school. All right, so we're gonna reveal everything. So everything from behind the scene. Yep, two classes. I surgeries are placements are breakdown the people in our classes how to deal with them and conditions. We're just going to talk about everything. We want it to be as interactive as possible, of course, and we're going to keep it fun and we're going to keep you guys up to date with everything.", "Thing so since it's our first episode we want to tell you a little bit about ourselves. So basically my name is half. So I'm a second-year medical student and my name is Rita and I'm a first year medical student. So we're gonna have 30 second timers to get you a bit of a flavor of our personality. Oh, what do you reckon? I like it. We're gonna do 30 second timers. Okay. Oh my God, my second director. Okay, I hate rockmelon. It reminds me of dermatitis. It is absolutely disgusting. Okay.", " I just the smell cannot stand it. I want to have it bounce. Okay, the swag guys how they have a bounce when they walk. Yeah. Okay. Okay. I want to be a poop. I am cool. Okay. You're cool. I'm cool. Okay, but I want to swag walk. And worst thing ever is when you open up an avocado and it's not ripe. Okay, you're loving it again. I think you did. Well, I've learned I've learned more things about you than I have.", " And the past few days, so I think we're pretty good. Okay. Now, it's your turn. Yeah, my name is Rita. I really like music. I hate strawberries. I think they're disgusting cool. I think they fart. Nobody agrees with me. If you leave them in a closed space. I'm pretty sure they release gas. I really like drawing. I like photography. I love to swim. I like warm weather. I like when do I see your CV? I feel like I'm seeing you soon.", " Oh, no, man. Listen, what else that's it. I've revealed more than I would care to reveal. So you're welcome. Amazing stopped eating look at me. Okay? Okay. Alright. So basically we have a challenge on this show where we each have to read a prescription from a doctor a doctor's note basically and kind of guess.", " What it means and hafsa is just here cheating and reading the answer going to reveal more light. I think this is Grill. We're going to reveal more later. And because today is Halloween. Yeah, we have a bunch of Halloween topics lined up amazing in the spirit of Halloween. You mentioned you were going to tell me something spooky. Yes. I think I hundred percent agreed to this just saying because I'm scared you didn't give me your full consent.", " But I'm going to go ahead anyway, I'm gonna do it anyway, because it's Halloween is what people like you. Do, you know, not a bully", " Anyway, continue. I'm still gonna do it. Okay. Alright, so did you or did you not know that vampires actually have existed in the past you mean I would probably in the past and real Edward Cullen is like I'd work. Okay. Okay. Okay. Okay, so no I did not. Okay, so there.", " A woman okay in the 1500s called Elizabeth Bathory and she was nicknamed The Blood Countess and she was said to have killed over 650 girls and to have bathed in their blood.", " For youth basically just to keep herself young and beautiful. I don't hear anything anything. I don't hear anything. Okay, let's go.", " Okay. Do you hear it? For real? Do you hear anything? Okay. Anyways, anyway, okay, so", " According to the story, right Elizabeth Bathory got married around the age of 15 and she and her husband would participate in torture as crimes. But at the time they were both Aristocrats and it was not considered to be a crime to torture your servants. Okay? Okay, when you say when you say torch up right on a scale of like is it it's not ticking.", " I wish it was tickling. Okay. So what do you mean? I'm Gonna Keep It PG on this podcast, but I I will link the article that I found online and I will try and paint you the most PG picture ever. Okay, so she would bite off her victims flesh.", " She would beat them so much that she would need a change of clothes we could because she would be bathed in their blood once she was too sick to get out of bed, and she actually had one of her servants bring her another servant so she could torture.", " Just you know how old would so they were very young girls because at the time families would send so as I mentioned she was in a rustic rat, right? So at the time families would send their daughters to work in her castle to maybe gain more reputation to be closer to an aristocrat that would give them more of an advantage. And so these girls they would be very young.", " Go to work for Elizabeth Bathory. So and so she would torture them for the little Littlest mistake ever. So if somebody made the smallest mistake, she would beat them to the death. She would I see them to death and then the myth was she would bathe in their blood because the way that she was found when police found her was soaked in her victim's blood with", " with corpses rotting all over her castle all over her castle walls. Yeah, but you have to think like it's fit the 1500s, right? So how how much worse does it actually smell to have no offense to the fifteen hundreds people.", " And you will look basically because she came from an aristocratic family. We would have never heard of the of her story ever because her family kept her arrest Under Wraps. Nobody ever heard of her story, except of peda Yes, except any searching the dark web for things to scare hafsa with like internet history after the show, please. Yeah, definitely. You'll find a lot of Elizabeth Bathory.", " Stories. Yes. So the truth is she wouldn't actually bathe in her victim's blood but she was so brutal and tortures and she was so brutal in the murders that she would actually need a change of clothes because she would be soaked in their blood every time she would kill a girl and the year that she was arrested arrested I think was about 20 years later 20 years after her marriage so 20 years.", " After she started torturing women and she would have tortured and killed 650 women. Oh and the fun fact about this like I told you so at the time being an aristocrat and wanting to torture servants wasn't actually a crime, right? So it was just considered impolite. So when she would go visit other Aristocrats for vacations, she would ask them to reserve a room for her so she could have a torture chamber.", " Where she wouldn't disturb her hosts?", " As to not be too impolite. What do you think? It isn't? This is my Halloween story to okay, not very Edward Cullen but close enough. I would have preferred Edward Cullen, but hey, it's okay. Oh good anything for you hafsa? Okay. Thanks. Thanks, bro.", " All right. Now it's time for the challenge. So we're going to tell you a little bit more about this challenge doctors for whatever reason do not have good handwriting's actually correction. Let me tell you in our lectures we have to write at crazy speeds like in humans breeds. So if anyone looks at us we look we have did I say spreads? Yes. Okay. I'm just gonna ignore you right now. Get out of my sight in the lecture theater, whether you have an iPad whether you have a pen or a pencil you're basically like", " Superman in terms of writing you don't have the superpowers you just you can write like a crazy person and you can type like a crazy person. So that's possibly why doctors have really bad handwriting. He's probably so this is what we're going to do. We're going to start reading prescriptions to try to get better at reading bad. You know, you weren't though. I read that doctors have bad handwriting because their specific letters that they use as a abbreviations for things. That's interesting. Yeah, so we're going to find out we should so", " For the rest of the year Reid and I are going to challenge each other to read prescriptions and challenge you we're gonna go on Instagram and then we're going to be posting prescriptions and we're going to be asking you what you think the prescription actually means Rita got me a prescription today, which I apparently I couldn't cheat. She made me a new one. So like guys, I'm a nice person. I do not cheat, right? So we're going to start at 30 second timer and I'm going to try to read this prescription 30 seconds.", " You have seven seconds seven seven seconds seven seconds. Yes do decided that you have seven seconds. It's one word. This is a gyp. I think Jeb watermelon Brooklyn. That's not a that's that is not a medication. This is what it looks like done watermelon. Brooklyn is not a medication. I will tell you that this is not okay. We're gonna post this on Instagram and you will understand.", " You could have done a little bit better a little bit. You could have tried harder. It looked like watermelon. No, okay period okay, you know what? That's it. Alright, whatever. I'm just gonna get our hard-won next on for the prescription check out at med school. That's any DSC oo. Oh no. Aah. No. Aah send us your prescriptions. If you want us to read some of your convoluted writings. Hopefully, it won't look like watermelon. It's not watermelon tag is at you right now.", " Whatever. Okay, it's not going to look like watermelon supplements look like what am I sup limits? What amounts you still get 0 points, so I don't know what you're arguing about it.", " Rita apparently in Halloween, you know how we've got like these mythical creatures vampires werewolves zombies apparently these things exist in terms of medical conditions. Okay, ask me something. Okay. Um, how do you become a zombie in real life? It's called The Walking Corpse Syndrome in medical terms. It's called caught red syndrome. And basically it's a medical condition.", " People think they're dead. Oh, so it's not actually happening. They act they think they're dead or they've got missing body parts. And what's really interesting. Is that one lady actually thought she didn't have arms so she died from starvation because she oh because she couldn't feed herself. Exactly exactly. Like how crazy is that? Wow, next one vampire disease people who have porphyria. Sorry guys, but just an advance my pronunciations absolutely terrible. So basically these guys", " Guys have a natural build-up of this chemical called porphyrin Mmm. And this chemical is in our red blood cells, right the thing that's interesting is their symptoms are basically the sensitive to light their urine is reddish purplish like Craig blood and because they have their gums shrink the teeth look like really big and shot. I see so they look like vampires. Yeah. Exactly. The one thing I couldn't find though is if they're sensitive to garlic.", " Be interesting if anyone knows even the even on the myth that's questionable. Even in the myth. I don't think vampires are sensitive to garlic to be honest. I'm glad they can't they can't eat Shawarma, you know, you can't even a lot of stuff. Okay tomb is very important to Ms. Garlic garlic in Arabic and it's look ask for Tomb wherever you go if it's in an Arabic restaurant and so they kinda Arabic food guys or Mediterranean food. Thank me later. I mean I see.", " Suppose they don't need that for anyway, there's also werewolf syndrome. So these are people with this syndrome called congenital hypertrichosis. Okay, and that sounds like a very scary word, but that's basically caused by excessive growth of here. So they've got hair sprouting from everywhere. Hmm face their arms their legs and they think it's because of an excess hormone. Okay, like or some drugs cause it as well, I see. Okay, so it could be primary or it could be due to a certain drug. Yeah, I've read and", " Article recently that mentioned that some drugs can cause it as well and then if it grows if there's excess hair that grows does it grow on the face where hair and usually doesn't grow? Yes. So basically you've got hair growth everywhere. So, you know how werewolves like Wolves? Yeah. I've got hair everywhere. Yeah. What happens to these guys? OK and my favorite lost one. Do you want to ask me what it is? Wait? No, let me guess. So you said sambi you said what vampire werewolf?", " Which no, damn it. That would be cool though. I should have looked at this. Okay. Wait.", " It's like is it super common? It's not really like a supernatural being so with this one. It's Lazarus Syndrome a person would be deemed clinically dead and then they suddenly wake up. So imagine. Oh, yeah, imagine you're in a morgue and you're like this guy is toast. All right p and then this guy just wakes up. Yeah. Hey, bro, what up white cover and everything? Yeah, like how pops open house here with that be terrifying. So that's it for me. I'm gonna send you guys some pictures on", " Med school that's immedi SC oo L. Check it out plug somebody did this weekend. What'd you do this weekend? I went to the Epic assist Halloween party. Hmm. Tell me about it. You probably do not need to know this but I'm going to tell you anyway, the decorations were incredibly cool everything glowed in the dark. It glowed in the dark Rita. Like I need a reaction from you right now. I can't I mean I've seen things that glow in the dark. Okay. So how did they glow in the dark?", " The person who organized this was Jennifer. She's like one of the chicks in up my my class. Yeah, and you Jennifer. I know her she had UV lights. Yeah, and she used glow in the dark stuff. She had drinks that glowed in the dark. She had a boy how like how she made them glow in the dark. Let me get to it. Okay. So basically she had some things that glowed in the dark. So the drinks she had tonic water out. She had Coke everything glowed in the dark. Oh, whoa the food glowed in the dark the decorations glowed in the dark. She even had a", " You okay? I thought you meant like, you know, those Halloween decorations that have like if it's a ghost it'll glow in the dark. You kind of buy them pre-made those little stickers. Oh, I know what you're talking about. Yeah. I mean she had some of those but she also had food that glowed in the dice. She's a good that you for us a menu that had like zombie the menu glow in the dark. Yes. No, it's okay. It's gonna die. I was waiting for something not to sort it was", " Like zombie brain, okay, and it was like a never did but like honestly, I enjoyed the creepy menu New Zealand translation of O is avocado actually, no Ivo is afternoon. I don't even know why I bother all right. Like I don't know why she's so butthurt about Avo and avo of our or two different story different. It's the same word so bad this light up. Okay, we know this is not cool. I first episode you were already having been calling you out. This is not a game doing the drinks. So tonic water apparently.", " Is in the dock because it's got a chemical in it queening. It's got quitting in it. Okay, that glows like blue white. Okay, and she also crushed up vitamin B, which is like a water soluble vitamins. I like it's not too terrible in excess. But basically she crushed up vitamin B and she put it in our drinks so that he grew it glows like a bright yellow. That's really cool. And you know, what's the coolest thing of all", " Tell me where do you pee it's highlighted yellow. No, I don't like that. Isn't it? Cool. I don't like that your P was highlighter yellow. Yes, all of you guys or just you all of you guys have a group chat where you said your P was highlighter yellow. Yes. This is that we yes, why was your P highlighter yellow because of excess vitamin B. There's nothing wrong with her.", " Halloween urine", " So hafsa yeah, I hear you started started surgery. Yes. Oh my God. So you've been watching my insist I have and since we're on the topic of Halloween anything scary happen anything cool happened. We've had people who've just got up and started walking towards now that never happened. Oh actually fun Story one of the women she wasn't under like she was just sedated. She wasn't under complaint Anastasia. By the way, guys. I mean if your surgeons out there, I really admire you for your", " Music okay, because they listen to good music like pop. You know, what's hot out there. So we had two surgeons jamming to send your reader to like, you know, we're Mendez and to Mallika Baio. I was so proud. Where are they dancing know they were singing along? Oh did I harmonizing to it? But then the lady started moaning afterwards. So I don't know if it's because she enjoyed and she wanted to join or if it was like, please guys. You don't dial great. Yeah, maybe it's not her type of music.", " Look, maybe I'm no I don't know apart from that. It's being such a good placement. I feel like I've learned so much I've gone in there. I've watched plastic surgeries. I've seen a guy basically like some people have like an extra fold. Yeah over this over the eyelid. Yeah, so he cut that up and to improve the aesthetic appearance. Yes, I and not only that right so the fat kind of impedes on the vision because it kind of like makes it heavier for the eyelids to go up exactly. Sorry it", " And completely aesthetic I suppose but the plastic surgeon did that I've seen some like prostate cancer removals, which was also very cool and I've seen some Orthopedic surgeries. You learn so much you learn so much Anatomy looking at the person's body. Once they like open it up and they show you on the screen what's going on? And it's definitely not like the books, right? So it's definitely not colored like the books or separated like the books but you still learn anatomy and you're still I mean like the books are amazing because it's all colored and you go like", " My God this body it's like so beautiful. There's this thing called the event in Bursa which is like this like it's kind of like an apron on top of your bells. Oh, so it's very fatty. Okay what I've seen and bowels just kind of like, I don't even know how to describe it like this little around everywhere slits. They flit around they Slither around everybody Slither. Okay, it's just that made it sound like a snake probably. Yes, you nailed it yet nailed it. But the best thing about the surgery placement was the surgical course that we've", " Doing so do you do surgical course before you actually go? So we've been on some surgeries and then at the end of the week, we had a surgical skills course. Oh, that's cool. Yeah. So so Random, right so he sent us an email going like hey guys, you've got a surgical skills course and basically they got a shoe laces like, you know your Converse shoe like yeah, they got a shoe laces. They got his blue Tack and they got two other strings and they were showing us how to not like how they do during surgery nice.", " We started off with the reef night and we're going to have some videos online for use to see on my Instagram page and on at med school and then it was the surgical night. And so he played a video of how he does it. He did it live and then they would go around seeing how we do it and we just do it with shoelaces that's amazing. And then at the end they gave us actual like surgical equipment and we had to do it with the I'm just going to call it tongs because I don't remember what you call it. Yeah, but they're basically this scissor thingies that you think he's", " The scissor things things that you just kind of hold the needle and you kind of wave it it nice that's kind of like when we went and we did the placement for put that meaty. So I Center yeah and we learned how to like, so what's it called? It was like an eyelid like we it was like yeah. Yeah like a suing course it when we it wasn't it was a sewing: course and we had basically a block of fake skin and we had to so nice and eyelid.", " And so same concept except with shoelaces. So guys advice to you. Do not throw out your shoelaces. Just check out our videos and try these different nights. They're actually super cool. Just throw your shoes away. Don't throw your shoe laces. You heard it here first. Yeah, that's cool. Exactly. And then on our next surgical course, it was with the like sorry, we started off with you laces. And then it was with the actual wires. So they gave us pigskin. Okay. So pigskin is quite different from normal human skin. It's a little bit thicker, okay.", " Are they made us do incisions on this on the pigskin and then we had to sew it. Nice you do like different types of sutures. Don't remember the names. I'll get back to you later. Yeah, but basically you sort of go in between and Under the Skin and it's beautiful because when you sew it and you like tighten it you can't see the lines nice and basically it depends on the depth of the word this this right science to it man. It's not it's not easy surgery's not easy, right? You're trying to make it look as beautiful as possible if it's a deep wound you have to suture.", " It really low and then you have to superficially suture as well as it heals beautifully. I see. Yeah, that's really interesting. And the final thing that I want to tell you is they had they they mate they put assist in it affects its we missed so we had to extract the sister of course with my luck it exploded in my face. So when it was gross that is awful. It's pretty gross. I'm glad it did. Wait. How did they insert assist no idea it was beautiful. Like I think they cut it up they uh,", " Some toothpaste in this little pouch. Okay, put it in the pigskin. Yeah, and and then they sutured it nice and then we just had to extract it out and you kind of like just cut through the cysts your cut through the cyst and then you sort of squeeze it out kind of like popping a pimple pop. I use your skills. I was so proud and yeah, you just like pop the cyst out and then you sew it sew it back. So like the pig skin was as good as you nice. Yeah, so that's it.", " It from surgery. That sounds awesome. That's so amazing. I can't wait till you go on your surgery, please. I can't wait either. There's one more thing that I kind of want to try later tell me so I found an app. You know how I like apps. Yeah. I love that. Yeah, it's cold interactive surgery and I kind of want to do some things like suture people.", " On the app. Okay. Yeah. Okay. I'm not serial. Killer. What are you looking at me like that? It's a Halloween episode. I'm not a psycho though. I'm hot. It's a Halloween episode and we're talking about serial killers and you're telling you you look like you have a big head. Do you see me commenting on that? You have horns on your head. I'm gonna talk about this later it up. We are settling the score you lost the challenge and that's okay. Hi cut cut cut Don. I don't want to talk about this.", " Alright, so that's the end of our first episode Rita. How do you feel I feel pretty good. Yeah. Okay. So I hope you guys enjoy let us know what you think. I'm for next episode. We're not done guys. Like seriously the ones that know me personally, you know, once I start talking it just doesn't stop we're going to be talking about Mo vember. Yes, so we have these tune in because we have a lot of great topics actually kind of kidnapped one of the guys from people.", " From her pbl. We're going to talk about that. Yes week. Yeah right. Bye miss school."]}