{"showID": "0a1OhqAgMKmW5JwKWG7LbF", "show_name": "Embodied Astrology with Renee Sills", "show_description": "Embodied Astrology and other tools for living in your body and from your heart  www.embodiedastrology.com or reneesills.com for more.", "episode_name": "Embodied Astrology with Renee Sills", "episode_description": "Embodied Astrology and other tools for living in your body and from your heart  www.embodiedastrology.com or reneesills.com for more.", "transcript": ["Hello. Thanks for listening to the embodied astrology month ahead. Audio horoscopes for Leo season. This is Renee Sills your astrologer and host of the embodied astrology podcast along with these horoscopes. Please make sure to listen to embodied astrology for Leo season this special episode called glow time focuses on Leo in the body in life and love and relationships and experiences everybody.", " He carries Leo in their bodies. Everybody has Leo in their charts. And in this episode, I'll offer some attunements and healing practices for working with Leo in yourself. And in your life. Also, please remember to check back in with me at the new moon and the full moon this month for some lunar Attunement practices on July 31st. We have a new moon in Leo and on August 15th. We have a full moon in Aquarius and both of those days. I'll be putting out meditations or embodiment rituals to", " You are tuned with these lunar cycles. I want to offer a huge. Thank you to subscribers subscribers. Thank you so much. You keep embodied astrology happening and your monthly donations are what sustains this work? If you enjoy embodied astrology, please consider becoming a subscriber you can subscribe at any amount per month really even just one dollar a month is so helpful your monthly subscriptions. Allow me to continue this work with", " Enos and reliability and if you get something out of embodied astrology, please help it to sustain help it to continue subscribers also get access to my extended monthly horoscopes and these extended forecasts include a PDF with planetary aspects and lunar cycles throughout the month my interpretations for the energy of those aspects and cycles and some embodied suggestions for how to work with this energy. You'll also get an extended audio horoscope that", " You can listen to that isn't signed specific but that goes through in detail a lot of planetary energy that I don't mention in your individual horoscopes. If giving a recurring donation isn't available to you at this time consider a one-time donation. And please always share it with friends. This is the number one way. You can support this project is by reposting it forwarding on the emails and telling your friends about it giving five star reviews on Apple iTunes podcast or wherever it is that you listen.", " Listen, finally. I want to give a brief plug for a special Retreat that I'm offering later this year from September 29th to October third. I'll be offering a three-day residential Retreat where we'll be working with embodied astrology in this Retreat. You'll learn a ton about astrology you will work with your own chart. You'll get to prepare for the exciting astrology of 2020 and use your astrology and use the tools that I offer for how you embody astrology and the astrological", " Potential to manifest your magic get more information at embodied astrology.com under Play and Learn and Live Events. Your horoscope is coming right up stick around.", " Hey friends. Do you have something you want to say or information that you want to share? Have you thought about making a podcast? If you haven't heard about anchor it's the easiest way to make a podcast. Let me explain first of all, it's free to use and you can use it on your phone or on your computer. There are built-in creation tools that allow you to record and edit your podcast right from your device. Anchor will distribute your podcast for you so it can be heard on.", " Modify Apple podcasts and many other platforms the best thing or one of the best things I think about it is that you can make money from your podcasts with no minimum listener ships. It's everything you need to make a podcast in one place learn more about it and download the free anchor app or go to Anchor dot f m-- to get started.", " All right, we're going to get into your horoscope. Now as always I just want to encourage you to listen with an open mind horoscopes are a general kind of art. There are a ton of people on the planet and there are not only twelve kinds of people. So as I offer your horoscope, I'm offering General suggestions and the energy that I'm receiving from the chart may or may not be applicable to you in exactly the way that I speak it. So, please listen for the sentiment or the", " Symbolism and what I'm saying apply it to yourself intuitively if you associate to something that I'm saying, that's the right thing. You can go down that road. Listen a couple of times ask questions to yourself kind of consider all the different ways that you could think about what I'm offering and always take what works leave the rest. Remember that these horoscopes are simply suggestions here for your best benefit and positive Evolution. I want to encourage you to listen to the horoscopes for at least", " Your son and your rising sign your sun sign is the season that you are born. It's what you answer when someone asks. Hey, what's your sign? Your rising sign is the time of day. You were born not everybody has this information, and so if you don't know your rising sign your sun sign is awesome to listen to some people really get into listening for their Moon signs for their Venus signs. There are all different signs for all the planets in your chart and really many of the horoscopes could speak to you. So I hope you", " oil, whichever ones you listen to", " Hello, Sagittarius, welcome to your month ahead forecast and audio for scope for Leo season Leo begins on July 22nd. It culminates on August 22nd. And for you Leo rules the part of your chart that actually has to do with Sagittarius as a theme. So let me explain this when I do horoscope. I'm looking at what are called whole sign houses and the houses are the way that an astrologer.", " I would divide the sky into areas of life so I can tell you what astrology is doing and where it's happening for you right now. And when I do you're Sagittarius horoscope Sagittarius takes the first house in this is the place of identity. This is you that I'm talking about or talking to and Leo then takes the Ninth Place in the chart as nine signs after yours and you might be aware that Sagittarius is the ninth sign in the wheel of the zodiac.", " Oh that starts with Aries. So this is kind of an interesting relationship that you have with Leo as an energy because the ninth house is the place in the Solar chart that talks about Sagittarian themes how you grow how you expand the meaning that you make out of your life movement towards opportunity and possibility. This is a big theme of this place in your chart. How you position yourself in accordance with", " You believe in and how you pursue some kind of path that has to do with your beliefs. Leo is a sign that is optimistic. It's enthusiastic and it functions from its own centrality. It really believes in itself. It has to emanate from itself. All the fire signs have quite a lot to do with the self with personality and they evolved through ongoing understanding and", " awareness of the self now such a tereus is a very spiritual sign and the place that it rules in the chart is somewhat spiritual house and for anybody whose spiritually inclined you might have heard what I just said and thought to yourself but on the path of spirituality, there is no self because really what we make out of our Lives if it only revolves around ourselves the meaning isn't very big.", " and Sagittarius in the ninth house teach us to expand our meaning to get out of ourselves to consider the big picture and the way that you do this interestingly enough is through yourself through a sign that wants to express itself that wants to know itself the more that you experience the richness and diversity that life has to offer the more, you know yourself the more, you know yourself the more, you know, all of the possibilities that you could be and this is the way that Leo functions in your", " Chart is as this kind of reminder. So over the course of the next 30 days in Leo season, there's a lot of activity in this sign Mars Venus Mercury and the sun will all be occupying Leo throughout the course of most of the Season. These are all what are called the personal planets they have to do with your personality how you express yourself your energy your magnetism Your Enthusiasm your awareness. There's also movement through the other fire signs.", " Of course is currently in your sign Sagittarius Chiron is in your fellow fire sign Aries and this brings what's called a grand fire Trine into your chart throughout the month. All three fire signs are lit up with planetary energy. They're all working with each other and this gives you a pretty awesome energy over the course of the next 30 days. You have a lot to offer your kind of self growth.", " Self development your creative projects your personality how you are working on yourself how your understanding yourself? You're hearing me say self quite a bit because this month really is in a lot of ways about you and how you're developing and how you're growing. And what is progressing forward in your life, especially when it comes to yourself Leo season continues from cancer season, and as all of the personal planets move into Leo, they are moving out of cancer cancer.", " Is your solar Eighth House? This is a place of intimacy these vulnerabilities insecurities and deep emotional entanglements. So you're in some kind of process of understanding something about your agreements with others how your functioning in more subliminal emotional complex ways. And the meaning that you're making out of these kinds of experiences you met over the course of the last month or so have had mmm relationships conversations interactions that have", " emulated you to look inside yourself in a new way to understand something about how you relate with other people the kinds of agreements in Arrangements you reach and how you've been set up for these relationships and as we get into Leo season, you're learning and you're growing and this feels at least energizing if not exciting over the course of Leo season, the planets in Leo will make several aspects to planets in earth and water. This is not always an easy.", " Feeling the dynamic between fire and earth and water is sometimes frustrating fire wants to move up and out. It's a really enthusiastic and hot and quick kind of energy earth and water move down and in they take their time, they penetrate they seep so this month is definitely also a month for you to continue to stay measured in your productivity in your output.", " You want to be disciplined you want to be consistent at the same time? You're working the change things up you again are growing or expanding a lot and you want your growth to be sustainable. You want it to actually carry you through into some new phase of development and your discipline your discernment in your study - are a big part of what's going to allow that to happen. So the sun moves into Leo on July 22nd, and wherever the sun is, it's bringing your Consciousness your awareness your energy.", " Again, Leo rules the part of your chart. That is the place where you grow where you're making meaning for many of you. This is also the place where you're traveling or where you're encountering new and different ideas. And your sense of possibility is getting expanded on July 27th Venus enters this part of your chart Venus. Will Transit Leo through August 21st, wherever Venus is it's bringing love magnetism Beauty and attractiveness. This is a", " Lee fun time for you to travel this is a really fun time for you to be engaging with some kind of learning efforts or getting involved with spiritual communities or other kinds of more practice growth-oriented spaces where you're involving your intellect your intelligence and your curiosity when you get to open your mind and stretch your mind you feel happy this month when you're encountering.", " Unis difference excitement and possibility. This is bringing a smile to your mouth and a sparkle to your eye and when you look like that people respond to you, they want to be near you. So Venus is bringing magnetism and kind of the attractive quality into this part of your chart as well. And that's a nice influence to use especially for anyone who is doing some traveling this month or if you're doing any kind of teaching this is also a really nice supportive aspect for that on", " July 31st, there's a new moon at 8 degrees of Leo a new moon is always a time when we can initiate a new beginning I think of the new beginnings at new Moon's to be the commencement of the next year long cycle in this part of the chart. So generally we have a new moon in a sign once per year and this is the time when we have the new moon in Leo so between now and next July or August of 2020 start", " You think forward in terms of what do you want to develop and cultivate in this area of your life some things that I didn't mention that have to do with this part in your chart also include publishing broadcasting any kind of dissemination of knowledge or information. And anyway that you're involved with teaching or learning. If you are giving and receiving knowledge and involving yourself in some kind of exchange of curiosity or ideas. Those are also pretty big themes for your soul.", " Solar ninth house. July 31st is also the day that mercury turns direct. It has been traveling retrograde through the sign Cancer for the last couple of weeks Mercury actually began its retrograde in early Leo and it traveled back into cancer and now it stationing Direct in the later degrees of cancer and will re-enter Leo in just a couple of days this Mercury retrograde highlights this theme that I mentioned earlier about the", " is that you relate to in more subconscious or subliminal or potentially even secretive ways and these are kinds of emotional entanglements or agreements that you have with your Intimate Relationships or anyone that you have a vulnerability dependency or trust with and there's some kind of negotiation a reflection process that you may have been in that has to do with", " these deeper layers of emotional complexity and relationship and these are places where we depend on each other. And so it may have something to do with sharing resources sharing money sharing information being kind of aware of another person's vulnerabilities or insecurities and what that does in terms of an emotional bond and mercury has moved back into this part of your chart that has to do with these kind of deeper emotional attachment.", " It has to do with our transformative capacity how we are in power dynamics with other people and now Mercury is going to come back into Leo into your solar 9th House of Adventure and opportunity and big learning. So this is part of what I'm talking about when I'm saying, I feel like you are shifting from some kind of inner work to something that feels more like meaning-making and as mercury stations direct you may get some clarity around situations that you've been in,", " In or have a new idea about how you want to continue to move forward with any situations that you Associated to what I was just saying on August 11th. There are a bunch of things going on astrologically to important planetary stations. So this is the day that Jupiter stations direct and you're honest stations retrograde. This is also the day that mercury will re-enter Leo Jupiter is traveling through your sign currently do", " Entering Sagittarius last fall in November of 2018 and it will stay in your sign through this fall or almost into the winter Jupiter moves into Capricorn in early. December Jupiter has been retrograde since April 10th and a retrograde is always bringing the planetary energy more internally, and this is a reflective time a reflective process as your ruling planet Jupiter.", " Where is the planet most associated with Sagittarius this brings a lot of energy into your personality into your appearance into your ideas about who you are and what you're up to here on planet Earth what you're doing and over these past four months. You may have been reconsidering some of these ideas. Who are you? What are you about anyone who's involved with teaching? There will have been probably a pretty profound process of questioning.", " And Discovery in terms of who you are as a teacher and what is it that you want to be teaching the movement of all the fire signs in the parts of your chart that have to do with your personality your creative expression your uniqueness. And also again how you make meaning and how you offer wisdom to the world is what's getting stimulated with Jupiter in your sign as Jupiter turns direct you seem to have a sense of clarity or more of a kind of go.", " Ed and movement forward for something that you've been developing that's about how you're expressing yourself and how you're putting yourself forward to the world August 11th. As I mentioned is also the day that you're honest stations retrograde your honest will be retrograde until January 12th. 2020. You're honest is currently transiting Taurus and Taurus rules your solar sixth house. This is the place in the chart that has to do with your jobs your day-to-day functions your practical.", " All kinds of applications of your energy. This is also the place in the chart where we find information about your health. So you're honest brings a kind of pioneering Innovative eccentric and also very energetic quality into this part of your chart this planetary Transit is going to last for about seven more years and over the course of these next seven years. You are really wanting to innovate your day-to-day something about how", " You're using your time and your schedule also how you're engaging with your health and all aspects of your health mental emotional Psychic Spiritual and physical and for many of you. This will also have to do with your jobs with your occupations. What are you doing every day? Literally, so you're honest wants you to experience Freedom Liberation excitement and new things New Horizons as you're honest stations retrograde you go into", " A period or a cycle of time when you're considering how to do this. How do you get to this kind of new exciting innovating liberated space in your day-to-day something about how you do this has to do with your finances potentially or maybe your self-esteem kind of feeling that you are worth it that you can do this that you're deserving of it if any of these things are clicking for you than I just want to say that from now until January of next.", " Next year, you're in a process of figuring something out your refining it and one thing that's really going to help you is letting go of what you do not need to be holding onto. So if you're holding on to jobs tasks that you could delegate somewhere else or that you could just let go entirely that will really help you out. Another little piece of advice is that rules are", " Not always made to be broken but a lot of times can be played with so if you think that you've hit a barrier or there's some kind of confinement around something that you're trying to do. Turn it upside down turn it on its side try and see it from different perspectives and different angles. I think you actually have a quite a lot of possibility in your work your professional life in any kinds of projects that you're trying to get off the ground.", " Round definitely and taking care of yourself and taking care of your health and a living in a way that feels aligned and authentic for your body's needs and for something that just seems like it has more Integrity. It feels more like you so you're kind of well supported in these efforts over the course of these next five months anywhere figuring out how to do it. And on August 11th Mercury is also moving into Leo and so it's bringing its mental.", " Unit of capacity into the part of your chart that has to do with teaching with Higher Learning with travel and with broadening your perspectives. This is a really good time to pick up a new book to learn a new skill to share knowledge that you have in any kind of way. You can share it on any kind of platform and to get curious and to get interested about all there is to learn out there on August 15th. We have a full moon in the sign of Aquarius.", " Aquarius is the sign that's opposite to Leo. The full moon is always an opposition and with the moon in Aquarius. The Moon is reflecting or opposing the light not just of the Sun and Leo, but also again of all the personal planets Venus Mars and Mercury are there as well. So this is going to be a really powerful full moon. There's a lot of energy around it and for you it lights up the Axis of learning what I call the axis of learning and wisdom.", " Your solar third house is associated to the sign Aquarius. And for you. This is the part of the chart that describes your learning style. Also your communication habits how you interact with other people from a conceptual space how you listen your curiosity how you interpret and perceive and how you articulate in return what is being illuminated for you? Are these themes your communication your curiosity how you're able to share information.", " Nation as a Sagittarius person Sagittarius identified person who's having a lot of stuff going on in the ninth house this full moon May call your attention to all of the things that you still have yet to learn and to the need to be humble in your offerings as well as confident. So your opinions your perspective they are very valuable, but they're valuable within the context of a community.", " It's important that you find yourself in spaces for conversation dialogue back and forth and relationship when your ideas and opinions get challenged. That's actually when they can grow strengthen and become more informed any kinds of conversations debates or feedback that you have at this time is valuable. You definitely are getting some kind of reflection and Illumination in this part of your chart that has to do with how you", " AKA how you listen and how you perceive and receive information August 15th is also the day that Mercury's Shadow completes. That means that the retrograde cycle has fully finished. You are Now supported to move forward with any new projects any contracts you need to sign or important decisions that you have either been intentionally delaying with Mercury retrograde or that have just been hung up installed. Now, there may be more space and availability to move forward at this point.", " point in Leo season energy begins to shift on August 17th Mars moves into Virgo on August 21st Venus moves into Virgo Mars will Transit Virgo through early October Venus through mid-september and then finally on August 23rd the sun moves into Virgo and a couple of days after that mercury follows suit, so we have this parade of the personal planets now moving from Leo into Virgo from your solar 9th house into your solar 10th house this", " Circe describes a Evolution from idea into form you are working on some kind of learning You've Got Big Ideas you are coming into a space of understanding through a lot of Leo season and then as we get into this later part of the month something starts to shift and you want to apply yourself in a different way. Now you are looking to get more practical more involved with manifesting something with building something.", " I had talked previously about something that I'm seeing in terms of your day-to-day efforts and your jobs and how your resourcing yourself and as we get into this later part of Leo season after August 17th or so, whatever it is that you're trying to build now really starts to take off and there's a lot of momentum to support it. So all in all this seems like a pretty exciting month for you the parts of the chart that describe your personality your inspiration your intuition and", " Our passion our really lit up with a lot of energy. The solar ninth house is a fun spot for you. It is really a place where you get to play in the kind of energy that you probably like the most and a lot of ways where you get to be expansive where you get to learn where you get to be challenged. But also where you get to grow, please make sure to check back in with me on the new moons and the full moons. July 31st is the new moon August 15th is the full moon. I'll be offering some kind of lunar a to", " It meant a meditation and embodiment ritual of some sort to help you tune in and work with this lunar cycle and energy and of course August 23rd. Keep an eye out for your month ahead horoscopes and forecasts for Virgo season. Thank you so much for listening. Happy Leo season. Bye for now."]}