{"showID": "0a1xawFR0oGJVP672q5ZuD", "show_name": "Life's amazing secrets", "show_description": "Gaur Gopal Das. A personal coach, monk, lifestyle & motivational strategist, sharing deeper spiritual insights with the world.", "episode_name": "Life's amazing secrets", "episode_description": "Gaur Gopal Das. A personal coach, monk, lifestyle & motivational strategist, sharing deeper spiritual insights with the world.", "transcript": ["A teacher teaching math to a class of six-year-olds asked a boy called earner in class Erna if I give you two mangoes and two mangoes, how many will you have her no said five.", " The teacher said Colonel if I give you one to two mangoes in one to two mangoes, how many will you have five replied I have now.", " The teacher was upset. But remember that our nose. Mom had said that I am not doesn't like mangoes. He likes strawberries. So she changed her example if I give you two strawberries and to strawberries. How many will you have for replied are now though? The teacher was pleased by the change of strategy just to confirm that are no had understood his math, right?", " She asked another again if I give you two mangoes and two mangoes, how many will you have are no replied five the teacher was now an annoyed how can two and two strawberries before and two and two mangoes b5r? No replied. I already have one mango in my bag Madam who was right was the teacher raw? No because 2 plus 2", " For was are never wrong. No, because 2 plus 2 is 4 and 1 mango in my bag makes it 5 isn't it a fact that all kinds of conflicts come because of the gap between Technical rightness and practical rightness. The teacher was technically right technical rightness means to see the obvious technical rightness means to see what", " is visible", " Colonel was practically right practical rightness means to see beyond the obvious practical rightness means to see beyond what is visibly seen practical rightness means to see the hidden mangle ladies and gentlemen, very often all our conflicts come because the gap between the technical and practical rightness whenever you find that your spouse.", " Is not loving you enough. Yes, you may be technically right he or she may not actually love you that much but I you practically right practical rightness means to see the Hidden Mango. Why is he or she not loving you your child may not be listening to you and technically you're right. The child is not listening to you, but I'm practically right practical rightness means to strive to see the Hidden Mango Beyond.", " And the obvious why is your child not behaving right the next time you see someone not fit into your definition of what is technically right? Please do not be judgmental. Go beyond the obvious go beyond the sea and try to look for the Hidden Mango which will truly help you understand the person and resolve the conflicting situation that you are in. Thank you."]}