{"showID": "0A2B0uRupGRFkIszMIoni5", "show_name": "Embodied Astrology with Renee Sills", "show_description": "Embodied Astrology and other tools for living in your body and from your heart  www.embodiedastrology.com or reneesills.com for more.", "episode_name": "Embodied Astrology with Renee Sills", "episode_description": "Embodied Astrology and other tools for living in your body and from your heart  www.embodiedastrology.com or reneesills.com for more.", "transcript": ["Hello and welcome. Thanks for listening to the embodied astrology horoscopes for Sagittarius season in 2019. My name is Renee. I'm a Consulting astrologer and somatic intuitive. These horoscopes are meant to Aid you in your healing and help connect you with your highest self as you listen, please listen with an open mind and appreciate the symbols and suggestions take what works for you and leave the rest. Remember that these horoscopes are describing General energy for each sign and it's up to you to get specific. Feel free to associate what I say to what is relevant for you.", "At their best horoscopes work as pieces of mystical advice and sacred symbolism. Let them spark your imagination and stimulate your intuition. I suggest that you listen to the horoscopes for your son and your rising signs. Your sun sign is what you tell people when they ask what's your sign it has to do with the time of year. You were born your rising sign has to do with the time of day. You were born in the place. You were born. If you know your birth information, you can find out what your rising sign is by getting a free natal chart on my website embodied astrology.com in the horoscopes.", " Section along with your horoscope. Make sure it'll take a listen to Heart of Sky a dark rift the embodied astrology episode for Sagittarius season where you can learn much more about the amazing sign Sagittarius as an energy in your chart and how to understand and work with it. You can find this episode links in the show notes from my website or as a separate track on your favorite listening Platforms in these horoscopes. You'll learn about how Sagittarius works for your son or your rising sign and I'll offer some suggestions for working with the new and full moons this month as well as a", " Other important planetary transits there is so much more going on with astrology and the next month though to learn about all of the planetary aspects and lunar phases this month. Please become a subscriber you can subscribe by donation at any amount per month and will receive access to my expanded month ahead interpretations as well as a principal calendar and Astro journal to help you work with astrology and your day-to-day life subscribers also receive big discounts on my year ahead birthday reports and online classes. All of my audio horoscopes guided meditations and podcasts are offered for", " Free if this work benefits you and your life, please consider making a one-time or recurring donation to help keep it going. Please share it with your family and friends and leave five star reviews on iTunes, SoundCloud and Spotify. Thank you so much for tuning in. Please wait for a brief message and I'll be right back with your horoscope.", " Hey friends. Do you have something you want to say or information that you want to share? Have you thought about making a podcast? If you haven't heard about anchor it's the easiest way to make a podcast. Let me explain first of all, it's free to use and you can use it on your phone or on your computer. There are built-in creation tools that allow you to record and edit your podcast right from your device. Anchor will distribute your podcast for you so it can be heard on.", " Modify Apple podcasts and many other platforms the best thing or one of the best things I think about it is that you can make money from your podcasts with no minimum listener ships. It's everything you need to make a podcast in one place learn more about it and download the free anchor app or go to Anchor dot. F m-- to get started. Hey everyone. Did you know that embodied astrology is on Spotify on Spotify? You can listen to all of your favorite artists and", " and podcasts in one place for free and you don't even need a premium account Spotify has a huge catalogue of podcasts on every topic including the one you're listening to right now on Spotify. You can follow your favorite podcasts like embodied astrology and never miss an episode. You can download all the episodes and listen offline, wherever you are. You can easily share what you're listening to with all your friends on social media if you haven't done so already be sure to download the Spotify app.", " For embodied astrology save it and browse podcasts in the your library tab. Also, make sure to follow me on social media on Instagram add embodied astrology. So you'll never miss an episode because you want to catch them all don't you?", " Hello Sagittarius. Thanks for listening. This is your audio horoscope and month ahead for Sagittarius season. Happy birthday. If it's your birthday if Sagittarius is your rising sign and welcome to the beginning of a new solar year as I'm looking at the chart for Sagittarius. It just seems like there are a lot of pretty profound shifts that are happening in it. And these shifts have been of course in development for a long time. They", " So our and it seems like there are some significant turning points coming up in the next month in your season these turning points begin when Mercury turns Direct on November 20th, just a couple of days before Sagittarius season commenced has mercury has been retrograde in Scorpio and Scorpio is the sign that precedes yours. So whenever a planet is in Scorpio, it is moving through the place in in the chart that describes", " kind of your unconscious as well as your greater Consciousness, but this is a space that is somewhat intangible. It's ineffable. It's beyond the Earthly realm and this placement chart can be quite challenging and that it is not of Earth. And so sometimes the things that we experience when there's significant planetary motion in the 12th house can be things like very vague Vibes that were picking up on anxieties that seemed to come out of", " Know where we might have really restless dreams or Restless sleep there may also be events that are happening that seem well out of our control and kind of inexplicable but the 12th house is also the place where you access your higher self where you access your Spirit guides or your ancestors. This is a place where you use your intuition. It's where you kind of travel in the astral.", " In the etheric planes and in higher Dimensions because you are not confined to a solid earth body. So Mercury retrograde in this part of your chart and also in the sign Scorpio, which is a sign that is known for being very deeply emotional and the emotions of Scorpio have to do with very long held emotions ways that we have been attached probably since we were babies, you know, really core.", " patterning and maybe even generational ancestral patterning Scorpio tends to deal with the emotions that are well below the surface and they kind of influence us in ways that can feel really hard to understand and also to change or to extract so when Mercury is retrograde in Scorpio, everybody's dealing with some kind of stirring up of these deeper emotional substances and memories and when Mercury is retrograde,", " Dan Scorpio in the 12th house, you're doing some pretty heavy lifting in the psychic plane or in this kind of ephemeral vague space that is actually so important and why is it important? It's important because there's so much going on all the time that's affecting us that we have no idea about, you know, our eyes can only pick up a tiny fraction of the available light same thing with our ears and sound we are tiny tiny tiny.", " Little beings on this huge vast planet in this kind of unknown infinite Cosmos and there's so much going on that. We can't really register in our conscious Minds. So Mercury retrograde in this part of your chart is doing some deep work and you may or may not have been conscious of it. But I'm wondering how your dreams have been over these past couple weeks how you have been feeling in your own energy and how you've been responding to", " to Vibes to feelings around you what's been going on and kind of the spaces in places where it is actually impossible. If not, you know, or if it's really challenging if not impossible to explain or to understand. So when Mercury turns Direct on November 20th, this cycle starts to shift and Mercury will start to pick up speed in the in the following days and then by December 9th, it will have moved.", " To your sign and to Sagittarius and those couple of weeks between the 20th and December 9th are a period of time when you may have some pretty important insights and if you keep a dream journal, this is the time to really be using it if you haven't used a dream journal before I'd suggest just going to bed with a pad of paper and a pen nearby and first thing upon waking up just write down any Impressions that you can retain from your dreams. This is a really great time for you to be meditating.", " You might check out some of the guided meditations that I have on my SoundCloud. There are a couple that could be really interesting to you like connecting with your Intuition or connecting with Source because that's the kind of those are the kinds of ideas that you can really connect with quite strongly at this point and your intuition is going to be really strong during this period And there's a lot that wants to get brought to your attention and then as mercury comes into your sign on December 9th at will", " And about 20 days in your sign and during that time again, this is a time to have a pad of paper and a pen with you at all times, you know have the notes app open on your phone use your voice record or something when you get a flash of Insight take note of it. So I wanted to begin with that now Sagittarius season begins on November 22nd, and this is when the sun enters your sign and the son of course has been in Scorpio for the last 30 days. So as the", " The consciousness of the sun enters Sagittarius. It's also bringing Consciousness from your 12th house. So this is part of the reason why I'm saying it feels like, you know, there have been important movements in your chart for a while but this month it's like a lot kind of becomes visible to you. It becomes apparent with this movement coming into your first house. You suddenly see things you kind of like, uh, oh that's the thing that I'm feeling you can have these kinds of Revelations and insights when the sun is in", " As to your sign your energy gets bolstered. Of course, the qualities of Sagittarius are so fabulous buoyancy optimism enthusiasm in this hunger for adventure and willingness to take risks. And one thing that I want to remind all of us about an especially anybody who strongly identifying with Sach is that of course, like all signs and anything in astrology. There is no simple answers. There's always a big spectrum of how these energies can work and the detriment of", " of Sagittarius is to get locked up in answers and in thinking that it has the truth. This is a sign that really wants truth with a capital T. And the wisdom of Sagittarius is that truth is a journey. It's not a fixed destination. There's not one truth. Right? We all have our own truths all truths are subjective and they evolved and so I just want to remind you of that. Of course, you already know it but remind yourself regularly all the time.", " Then especially this month to open your mind to be open minded to know that you cannot possibly know the answer to anything and especially to your life. And so you want to be open-minded open-hearted and enthusiastic and these are the exalted qualities of your sign. You really want to kind of bring those to the Forefront of your Consciousness because the other thing that Sagittarius does is it opens us to opportunity and you can't take an opportunity if you think you know what you're already doing not to say", " Say don't you know follow all your plans and think that you have a clear path if it feels clear, but always keep that bit of curiosity and open-mindedness. That's so important. And on November 26. There's going to be a new moon in your sign at three degrees of Sagittarius. So check your chart if this is where your son or rising or other important planets or points are then this new moon is especially a powerful one for you at the new moon. We're entering into a growing cycle growing phase. And so for the two weeks between the new moon and the full", " Moon, this is a time to meditate on what you are wanting to call into your life specifically around your identity and how you think about yourself your personality how you are experiencing your personality potentially, even your appearance and appearance. I don't know sometimes I think about it and I think oh that's trivial. It doesn't mean that much. It actually means a lot for many of us for different reasons and as you think about your appearance, maybe think also about the", " Weight that you put on your appearance and this is important for what I'm going to talk about next which has to do with with value and self-esteem. But just before I get into that use this new moon period of time to really think about how can you be presenting yourself to yourself and in the world in the most authentic way you possibly can because this is also the exaltation and the truth of Sagittarius is authenticity now at the full moon, which is December 11th. There's", " Full moon at 19 degrees of Gemini and that means that the sun is at 19 Sagittarius. So again, check your charts for planets or points around 19 sacher Gemini that opposition between the Sun and the Moon is Illuminating the axis. Not just between sajjan Gemini, but between your first and your 7th houses, so these are the this is the axis of self and other or you and then you and relationship Now relationships, of course include everybody.", " Else but specifically in the 7th house. There's information about relationships with people that you are not kidding with that. You didn't grow up with that aren't part of your kind of immediate sphere of early influences. So these are people who you're collaborating with your meeting as equals, even if there's a power hierarchy when you meet them, you have to negotiate terms. You have to weigh your desires and needs and", " Find some way to work together. So obviously this includes life Partners business partners other kinds of collaborators and even good friends, but this can also mean you know, the person that's like I don't know like your mechanic or something. Like, how are you meeting someone that might be a kind of more temporary engagement. But how are you coming into contact with them? How do you put yourself forward? What do you expect in? Return etcetera? How are you treating other people and how to", " You expect to be treated by them. So at this full moon. This is a great time to bring your attention to these questions to notice how they're working for you and then also with the full moon cycle as we move from Full Moon to New Moon. This is a disseminating or a releasing phase and this is a good time to be releasing old ways of being that are not serving you expectations that have been disempowering for you or destructive for other people ways of being in relationships that you are simply feeling done with and", " Want some support to let it go. So at the new moon and the full moon consider how you want to honor these markings of time and set your intentions. You can do rituals. You can meditate you can write in a journal you can simply just think about it, but make some point to Mark those passings of time. So what I had started to say a moment ago in terms of your value and self-esteem has to do with both Venus and Jupiter making their movements from your sign Sagittarius into the following sign Capricorn Venus will move.", " Into Capricorn on November 25th, and it will spend just a little under a month in that side. So until December 20th Jupiter will move into Capricorn on December 2nd of 2019 and it will stay there for just a little over a year until December 20th of 2020. So your solar second house has to do with value and values. This is the place of wealth in the chart. So it literally is referring to your assets to your bank accounts resources Etc. But this is also a deep.", " Our kind of sentiment of being taken care of and knowing that not only do you have what you need, but you also deserve what you have and self-esteem and self-worth of course are really big issues and a person that has a loads of money can also feel totally wretched inside the ways that we value ourselves often are related to money, but they're often related to so many other things.", " So as Venus and Jupiter come into this part of your chart, you have the to benefics the two planets that are the most associated with positive energy expansion Goodwill and opportunity Venus Springs magnetism charm. It's it's a planet that's naturally associated with the second house in that we can use venusian energy to attract what we want and need towards ourselves. So it's a really good time for you to be attracting what you value and", " Your life that might be money, but that also might mean good connections with other people. It might mean enough time for yourself. We're you're reading a book or taking a walk it might mean so many things and the way that you attract what you want is by exuding loveliness by visiting sweetness, and the way that you exude sweetness is not through facade, but it is through authenticity. So good practices for Venus in your second house cultivate. What you value about yourself.", " Of eight your values and your life wake up every morning and write a gratitude list between November 25th and December 20th. Just give yourself that kind of Rhythm and practice in coming into sweetness coming into a feeling of abundance and see what it does for you now Jupiter is the ruler of your sign a planetary ruler of your sign. And that means that Jupiter is bringing qualities of expansiveness. Adventurousness Good Luck Good Will and the desire", " To learn and grow into your second house. So over the course of this next year pretty much all of 2020 you have Jupiter's assistance in learning more about your values your value systems your self-worth. You have Jupiter's assistance in increasing your access and capacity with resources Jupiter and Venus both will be setting off the Saturn Pluto conjunction that you've certainly heard me talk about another horoscopes and you'll definitely hear me talk about", " About a lot next month and you're Capricorn season horoscope, but just to say that these are helpful planets and you are in a space of transformation around these issues of value. So Dive Right In don't be shy see what happens when you get really interested and enthusiastic which is the gift of your sign last thing I want to say is that on November 28th, which is Thanksgiving Day in the United States and is also", " Is a national day of mourning for the genocide of indigenous peoples and the North American continent. I am encouraging people to donate money and time and to do what you can with whatever privileges or platforms that you have to support indigenous lead organizations. I am really enthusiastic about the indigenous environmental Network. They are an amazing group of people. They're all indigenous LED. They do really important.", " Work around the environment and education and please donate some money to them on Thanksgiving ien Earth dot-org if you would like more information about astrology this month, please become a subscriber. You can subscribe at any amount per month and there is so much going on over the course of the next month many planetary aspects a lot that's happening with the Moon that I did not talk about in this horoscope. So check out the subscription offerings you get a audio recording with my interpretation of the month of", " Astrology as well as a printable calendar that you can use to work with the aspects and transits yourself. Definitely listen to the Sagittarius season embodied astrology podcast. There's a lot in there about Sagittarius, and it's embodied associations as well as how to work with its energy. Thank you so much for listening. If you enjoy these horoscopes and podcast, please share them with your people much. Love to you. I'm wishing you all the best in this season and Beyond bye for now."]}