{"showID": "0a2BQTox8cxHkTZQzkIpf4", "show_name": "The Wrestling-Wrestling Podcast", "show_description": "Wave 89.1 and PWR's Stan Sy, PWR veteran bootcamper Ro Moran, PWR Head Young Boy Raf Camus, and stand-up comedian Chino Liao talk about professional wrestling for the thinking Filipino fan.", "episode_name": "The Wrestling-Wrestling Podcast", "episode_description": "Wave 89.1 and PWR's Stan Sy, PWR veteran bootcamper Ro Moran, PWR Head Young Boy Raf Camus, and stand-up comedian Chino Liao talk about professional wrestling for the thinking Filipino fan.", "transcript": ["What's going on? This is Xavier Woods AKA Austin Creed onto. This is Dana's name is not sexually transmitted. Hey, this is DJ P the fill and Flash and you are listening to stand row Chino and camels on the", " wrestling wrestling podcast", " You are listening to the longest-running weekly episodic Filipino wrestling podcast. This is the wrestling wrestling podcast stancy and roma ran together here at podcast Network Asia. No yo Thomas. Yeah. Jim is a out watching the Chappelle show. Yeah so good for him good for him and asked for a goddamn was he has some bosses too, please.", " Those bills don't pay themselves. Yeah, yeah things happen. So we're throwing it old school for this and this episode of the week just for this episode. We have another one scheduled for later in the week. So don't worry. I think we should all be together again plus more on that episode. Yeah. It's going to be extra pact once we announce that guest. So I will let you know who Our Guest is for Thursday at the end of this episode before before we get to talking about this week in wrestling and when we say this week interesting there a lot that went down.", " Numb stuff that we need to unpack before that. We've got some upcoming events that we want you to be a part of so let's start off with pwr Mabuhay young wrestling that's taking place on January 26 last Sunday of the month at the Power Mac Center Spotlight over at circuit McCarthy, as always you can get your tickets at ticket to me dotnet. I believe there's also a shortened URL. It's a bit dot l y / Mabuhay on wrestling or something like that. Probably the something like that. Yeah. Yeah, they're probably might be a pwr there six awesome about so good.", " That out tickets as usual our at 399 pesos for one 1099 for your burka the bundle and at the gate it'll be four hundred fifty pesos and then the following day the wrestling does not end there because you've got the annual Royal Rumble viewing party at skinny mykes. Hey as always we're gonna be doing it big. So we're going to be having the viewing party at the main bar tickets are a 300 pesos of Pop. They come with a free drink whether you want to drink a beer or soda and IC IG. Yeah. Yeah. That's right.", " We'll be there as early as 5:00 a.m. Will you be there and the ottoman do something about it? I'm thinking about it. Well, the robot is different. Yeah, I know but you have work and sometimes you don't miss work for that. Well, that was last year last year was the first Rumble viewing party I miss and I kind of regret it. So because Becky Lynch had a big big rumbling. So this year, I'm not sure. I'm still thinking about it. I have another couple of weeks to to mull it over. I know we don't have we don't even know like we don't have any", " It's going in no one's a clear winner to win the hole to both both rumbles. So but I'm personally I think we're going to talk about this more we get closer to it, but there isn't that much to bite on right now. Yes, ma'am. The rumble is there. Um, yeah it is. It's a spectacle. There's always that the drinking games. Oh, no, he's mine. And then when young spectacle of what conning down see seeing who is part of the 30 for each but this time I don't think they're focusing on it.", " As much or if they will Baha'i creme de la moneda, I guess. Yeah, it kind of looks like that because in previous years you had the hype like in 2016 our first Rumble viewing party for remember the boat. We were all hyped for AJ and Nakamura, right? Right. Hopefully making an appearance on we got AJ and that was awesome. And then just last year we were all thinking that oh, it's Kenny Omega going to appear. Oh God not now. We know that he isn't but actually I think it's one thing to think about now. They're in there aren't that many surprises?", " More especially on the WWE side from from outside the WWE, but I'm gonna animal Machado big news. Whoever it is is likely going to be the mean whoever the big surprises are going to be are probably going to be from NXT icuk or my Legend. Yeah Legends as usual. No big rumors being rumored so far. I let you know if there is or if there are any as a week's go by but in yeah, not as", " One more you but there isn't as much in that in that sense feeling courts because well handling free agent pool Machado the its kind of thinned up because of a aw. Yeah. So like we know where Marty's girl is going, you know, he's going to roh, he's going to be their head Booker and he's reportedly getting six-figure W level money for everything is going to be doing over there. Yep, and then as mentioned you've got aw, which has basically all the non W top talent. So the speculation is", " As ripe as it used to be and it kind of takes a hit song Rumble which is kind of sad. But until then - I don't know. It doesn't mean you guys all come in and watch the show because I think it's gonna be fun for sure. It's always going to be fun. So please bring your excitement to the door. Yeah too skinny Mike's to the bar and plan your leaves Caillou half day leave Lanka will be done by 12. You can have your lunch then report to work if you work in BGC or Makati the but if you've still got the energy to keep working the rest of the day.", " I think some of us will for sure. Yeah, it's daylight will happen daylight savings time in so the main show will actually start around 7:00 or 8:00 a.m. Yeah better. We tell everyone to come in by like five or six Cafe was intelligent and able to grow. Well, that's true for Wrestlemania. I don't know if it's as true for the rumble. I don't know I wasn't there last. Yeah. I can't remember. I can't remember if it was standing room really early, but still all the same if you want to good seat then.", " Come in early. Yeah. Yeah and the cops on man make a new friend charity. Yeah, why not tables are big enough. Yeah as we've seen over at the over at the njpw wrestling the viewing party. So yeah, a lot of tables are a lot of room to go around and a lot of friends to be made. Yep. So there those are our upcoming events for now shout out as well to all the other members of the podcast Network Asia family. It's steadily growing. We've got a bunch of new shows that you might want to check out just a couple doors.", " Down this Corridor to nine Riders actually recording so all right now, yeah, if you're a cool person no, no cool pass today. They're probably at the Chappelle show. Oh, yeah. Yeah, that's true. That's true. Yeah. So if you're a motorcycle Enthusiast you might want to check them out. They talked anything and everything about more motorcycles something our boy Chris Panzer knows about if you want to listen to get in touch with your feminine side. You can check out the eavesdrop. My girlfriend was actually telling me about this back-to-back episode stretch where they were talking about Chico and Chico and", " And he was there but he was there on one of those episodes. Yeah that episode. They had a mini bull session telekinetic had up until about how their friendship friendship. Yeah and how they got back together as friends. Yeah, that that stuff got made some waves on one social media. Yeah. Yeah. So those are the type of material you can expect here on podcast Network Asia and you know, we've been making a lot of noise on the internet as well. So shout out to our CEO ronster Beethoven for landing on Esquire. Yeah and shout-out to the writer who also put his", " They're under the honorable mentions only nice. Nice. I did not expect the wrestling lasting God cast to get a shout out there this humble Niche podcast gets an honorable mention Sinai resting finding Jess. Yeah, I hope so. I hope so or someone close to them. Yeah in fan let them know know we exist. So we appreciate everybody doing their part to let people know that this podcast exists. All right time for us to get to talk about this week in wrestling and the biggest event that happened over the last seven days was NXT UK take over. Yeah, you would think nahin should be", " Thank you. Say anything UK such a niche product for for the UK Market. But here we are. It still is pretty banging especially if you give it a chance, you might not everyone might know what's happening on the NXT UK brand going into the pay-per-view. But as always as with any nxc product if you just tuned in you're going to get a really good time of really good wrestling no matter how much you know about the product itself.", " Still a great show. Yeah, so I came in with like zero knowledge or knowledge of NX UK because I haven't watched an episode since like episode 3. Yeah, which is way way back last year probably will start watching the whole thing weekly again, because I kind of want to skip 205 live over at now you Opening match was Trent 7 versus Eddie Dennis and I didn't know that they were feuding. I didn't know any Dennis was injured and came back. The barbarity commentators are Tom Phillips and Nigel McGuinness and they do a very good job of laying out the back story. I have these guys are making their entrances.", " So don't belong here Keeta. I'm gonna be really they cater to both him a hardcore fans and human a big lump up a tune and know my NXT takeover, man. So that's that's an example of what role was talking about earlier. I only caught the main event and the main event is Walter versus Joe Coffey. It's your traditional ww-who's fight phosphide loved it. I thought it was something definitely worth investing a half hour on it wasn't the strongest main event on paper. But um, I would definitely would rather", " Much see other matchups in that place better as usual because these these guys are two of the best that the world has to offer and then they're under the B. The B Banner. It is a main event that definitely delivered way past its expectations Yannick, but I am silly but I know how covid is that there were a bunch of running. So yeah, it was a cluster. Fuck. Yeah. It was yeah Delia Dragon of running in your side Alexander Wolfe running in so I think that sets up dragon overseas wolf or something. I know.", " It's already happened. That thing is already a call back at that point. Okay? Well backlash I over from matches that happened before but then Elia have a match with Finn Balor that same night or is it for Worlds Collide know that is a match scheduled for Worlds Collide? Okay. So Elia draganov and Alexander Wolfe, they they Tangled with one one another and you know, we're burying the lead here, but at the very end of the show, they did the usual take over Chiron fake ID. Yeah. This is their fake out of the year. Yeah, so", " Imperium stand stalled by last year exactly last year Tyler either way Pete Dunn Dunn had just beaten Joe Coffey and retain the UK title. Yeah, and the fake-out is Walters debut, right? So this year Imperium Stands Tall and then the Undisputed are discussion and you can tell like you're watching Imperium Standing Tall. There's ironic name everything their Union find such a are up next. So when their voices start Rising, you know, something's about to go down right and then coalfish strong and O'Reilly come in and just lay waste the Imperium.", " And imagine for small guys laying waste to two big guys in Walter and wolf better. I guess they had the element of surprise and the element of having not been having been fresh having not been, you know gone through a really hard Main Event like that. I guess logically my bottle of vodka. Yeah. Yeah. I don't think it's a great way to set up for Worlds Collide for sure. Also a great way. I", " I guess to tune it to get people to tune into the Takeover pay-per-view if you hadn't had plans to tune in already or if you're a fan of the Undisputed era the month. That's enough weakly. Yeah, here's my thing though. Both are he'll factions. This this establish Imperium is like the anti-heroes or the baby faces. Here is the Undisputed your image antihero and then it's a next year. I think you can do not sure if I think going by the reactions that that we heard on the in that segment. Yeah it", " Definitely seems like the yui are the anti-heroes here because it sits in front of a crowd that was definitely Pro Imperium before you showed up right so, I don't know anything you crowd. Yeah, and I mean, I know they pretty much provided the energy of the whole event and then you realize. Oh, okay. Wow, these guys are really still into NXT UK as a brand. Yeah, even though the rest of the world might not be. Yeah, so", " nope. I don't I'm amazed that they kept the whole energy going the whole night and now you have this and they pretty much cheered both teams. So we don't know until we find out on both NXT and fcuk shows see, you know, you know very well and I'm a huge fan of NXT. Like I love my NXT. It's just that one of the few shortcomings at the brand has and I'm talking about the NXT umbrella is that they book their factions to be healed slang like there is no Babyface group on a mine. I think that's a shortcoming.", " Say one in these are balanced to when you make these groups go up against one another which fans would really wanna buy the day with fantasy book group showdowns singing baby face and I still believe that you need a clear-cut Babyface in a clear-cut. He'll I would have been would have been British Strong Style. I think it would have been yeah the not be the lateral move to the Full Sail sighing Lang. I just wished, you know, one of these groups are doing would have been face because even when Galas is going up against yui, or when Galas was going up against Imperium gonna both are he'll factions. No, no,", " They're not they're not heal factors anymore. I mean goddesses out of here faction. Oh, it's elegant. It's not. Um, that's why Joe Coffey was against Walter to begin with. Okay. I didn't get that impression because I thought Joe Coffey was still a heel no. No. Okay. I realized this somewhere before I was watching her random and actually UK episode. Yeah, and they went up against Imperium. So it was clear to me then they turned gathers face somewhere along the way just because Imperium was here.", " Already see this is weird because when they showed up on NXT saw a brown girl Angel potential I guess and I see you later Punk Invader get tighter. Okay? Okay. I stand corrected. I totally didn't know that Galas was working maybe face. So okay that takes care of that then hmm any other thoughts on the other matches like I haven't seen the women's match or the ladder match or the other two undercard matches. I haven't finished watching everything, but the ones I wanted to watch first based on the based on the", " Actions I've heard after the show were the women's match the championship match Triple Threat Tyler bait versus Jordan Devlin and the first main event and all of those definitely delivered. Yeah, when you when your expectation of a takeover or a big ppv is a change in the status quo. You won't really get it from from takeover Blackpool very, I don't think I don't think every takeover means and you're changing the Status scroll, I guess in recent years like that. It's kind of happened.", " More often than not if there's a takeover something's about to change. Yeah. I just think that they needed to show because they needed a milestone, you know, one of their usual I think they do too UK takeovers. Yeah, Blackpool in Cardiff and young black boy bomb attacks at La Casa. One-year anniversary. Yeah of Walter's debut. And you know last year's Takeover in Blackpool, so there yeah. Yeah. All right, so that takes care of that. Let's transition now to another big thing that happened over the weekend.", " And that is Impact Wrestling crowning. It's very first female world champion in Tessa Blanchard. Yeah. I saw the match impacts pay-per-view called heart to kill that happened on Sunday their time American time and it was okay if the high the big question the big elephant in the room is whether Tessa Blanchard was still going to get this spot after many accusations about her being racist being a", " A person all over all backstage surface over the course of her career. Yeah, it's very interesting how this all came to light right before the pay-per-view was about to happen. Yeah, so you have you have this as Puerto Rican wrestler LaRosa buzzer name? Yeah, the Rosa. Yea So La Rosa was one of the people who spoke up you had Sienna big swole Renee. Michelle was another name. Yeah. My name is Rami could be the V to be done via who's in NXT. Yes other point.", " Each of the NSC women can say they were working with her during the May on classic. Yeah, Sarge met young Classic this this all stems from a Tessa Blanchard tweet when she said something along the lines of women should be supporting women. Yeah, which was really it was really dumb to be honest with you. Nobody thought nobody was thinking about her being a terrible person backstage until she brought that up and she brought that on herself. Yeah. I'm pulling up her Twitter right now and of", " And yeah, it's not so very wow. So the Tweet is and I quote. Hey women try supporting one another. Yeah, these things happen Jesus Christ. So that tweet has since been like over 4400 time without even without even the things that she's done before in her career. The Tweet itself is super bad. It is super terrible. It's a terrible thing to tweet because it means that you're fishing for support going into your big.", " Match, yeah better if it if it were Tessa Blanchard if it were a kind of slurry like someone who's universally loved I Kyrie saying if if Kyrie was fluent enough to tweet something like that. Would you have that reaction Amparo in the Ghana playing support a the pain? I think it depends yet the pan with it. I didn't give it much thought actually if Becky tweeted it I wouldn't have cared.", " And I don't think you would have to hmm. So Chelsea Green reacts. Yeah, he quotes it and says and I quote you've consistently put down bullied and belittled countless female co-workers including me. Is that support so from there you Nana Globe has an allotment a ban on female wrestlers from different promotions promotions. Remember Chelsea Green is with WB now and actually managed by Robert Stone formerly Robbie. So from there you Nana Globus and Elena accusations.", " Sharing either sharing stories or eluding the stories? Yeah, right. So as with always as with everything you and I will never know the full story sure, unless like miraculously we get Tessa here in this room or we get someone who has interacted with pesto Blanchard. Yeah, and they tell their side of the story, but we'll never get the full picture. Right? So it's easy to throw around accusations and throw around opinions, but I just think that it's really unfortunate now at the in timing", " In the incident metal in in tightening because that's what she was looking for. I mean that's the kind of support. She was looking for heading into that match in to enter World Championship Match. Yeah, but here's the thing though. Like let's let's say I am someone in Tessa Blanchard shoes, right? And let's assume that I may have had a not-so-pleasant history with my peers in the business they but like what was I going to expect after a tweet like that? Like that's a whole thing that that's it shows a lot.", " Utter lack of self-awareness on her part you say she did she really realize our did she really think she could get away with tweeting something like that without you know, all of these stories from all of these women have they she's wrong and surfacing all over again. Yeah. There's a Reddit thread that's been going around since the weekend. We're all of the tweets from the different women's wrestlers were compiled again. We would have no idea but I wouldn't know how to deal with this myself because I've never been in that spine and I", " Up the not be in that spot. I just think that it really just slightly such a but it's such a feel-good moments on Anna. You know, you have someone who finally becomes a World Champ a woman becoming a world champion of a major promotion in the u.s. I think what she should have done right? There was I mean there was enough time there was enough time before the the match. Yeah for the show. Yeah between the that tweet in the show. So what I would have done there is as soon as the student", " The stories kept coming in started coming in I would have just apologized as I at that point I should be aware that I did some terrible shit and I was in the wrong soap. I don't to not apologize there after what even the first story even kind of paints her as someone even more terrible than what the story say it again, but let's assume that she's innocent until proven guilty because until she's proven guilty all of these are accusations.", " They sure if we're assuming she's innocent then why I apologize. Like what's the pr moves to get? Both of us are PR practitioners? So let's brainstorm here. Like what's the PR move? Assuming that our client is innocent? Why why would you assume a gun at the client is innocent? Well a benefit of the doubt but because if I were me I would have I would have just gone ahead and owned up to it because that's the only play you have. Yep at home Sabine.", " Nothing for whatever reason the client is in. No, here's the thing is if you keep denying it's going to look worse. Yeah, it's going to look way worse in the face of all these stories mounting against you all and then you're going to deny going to keep the nying all of that and then you expect to look good heading into your match into your show. I don't think it's gonna happen. So like I'm trying to attack this from like the opposite opposite point of view now, you know, we're going to assume that she's really innocent and that everybody is just piling up against her and and this this is", " Probably a result of what Twitter has become the vehicle for cancel culture and while cancel culture is not wholly bad. It's got a very very big tendency to just sure ruin people's livelihoods or ruin people's Public Image Emma. So, um you got this is why I'm so conflicted here because I don't know the entire story so I don't want to assume that yeah, you know Tessa Blanchard is all is a horrible human being I don't want to go out and say that because I don't", " Everything but but I would say that if you're if you're saying that Tessa is still innocent despite all of these all of these accusations. It's like you're saying that just because she didn't hurt me. No. No, he's a gun. No, not that not that more of it's like you're saying that people didn't get left in both honest. Okay, just because she may not have done. So I mean that may not have happened.", " That all the accusations right? Huh? No, no, here's a difference because they like for the people who are left in Baton is they actually documented it? Yeah. Oh, how is that any different from documenting this? I mean sure it's probably not documented the same way as okay. We have pictures of us or we have video of us getting hurt or bullied by Tessa so stuff like that. It probably isn't that kind of documentation that you're looking for, but how I don't know. How is it any different?", " From from these stories. I think it's different because of that because of exactly that you lack of like the hard evidence because it with the Baton has incident or sure. We have the hard evidence to back you up. There were no contract signed that nobody got paid for the work that they did that people were flown there and did not get a return ticket. That's all hard evidence. And these are all corroborated by the victims. Okay, but with this incident, I mean like yeah, I want to listen to the victims. Yeah, when Chelsea Green goes out there and put yourself out there.", " Says night you bullied me. I commiserate with that Barrel. It's equally easy for me to say you wrote bullied me and if I tweet that out people who are supporting me can easily cancel you you know what I mean? So it's a very tricky situation and it's an unenviable position to be yeah going certainly back to the original question though. If I assuming Tessa is innocent, what's the PR move you just", " You just deny it out loud. That's a PR move. That is Kyle a pure looks at. You say something you make up I guess and not my makeup, but rather say that you didn't do any of this if there was I guess you also throw in something that if there were any miscommunication misunderstandings disagreements, then you apologize, but you didn't really do any of this. That's a play write it again.", " It's very it's very dangerous ground. And it's just really unfortunate that this had happened and that this had to happen now because we could be talking about that. So Blanchard in a different way. I thought Eric winter so impact doesn't acknowledge it. No, no that's is an acknowledged it they kind of actually run away from it. They proceed as planned. Tessa wins the championship Elvis. She actually has a statement on her Twitter better after buying this not during the show or no. No, this is before what so she's up to eat it.", " Union Avenue, Chelsea grass even worse and she said and I quote. I've never been anything but kind to you I've dealt with mean girl since I started not saying I'm a saint hell. I've had my ups and downs and I've made silly decisions such as life. You have zero Merit in your comments instead putting me down here for a little clout. You've got that number itself to eat and not tagged her and quoted the Chelsea Bluetooth. And then she also tweet that not true. That is my statement and the most attention I'll give it because of how actually ridiculous it is, okay.", " That is for all intents and purposes her statement. Fair fair. Yeah. Yeah. So that's the play that's what she did so she categorically denied everything hmm. Basically right now Union better still impacting say anything. No, other than that, you can say anything they proceeded as planned despite how terrible it might look putting putting her on the pedestal like that that are it was no other there was no there was no other way to proceed.", " Because they were building up this wind for so long that to derail it off now would look so bad with would look much worse. Yeah. Yeah. I was going to say the exact same thing that bottom knowing position to impact a given this this bad PR situation the by if they give it a Tessa parent shame on them and social media if they don't give it that there's a shame on them but n because they blue ball stir. Well, it kind of turned out OK in their favor because on the", " Show itself there was a good reaction from the crowd when Tessa one. Yeah, so everyone still cheering her. It didn't seem like anything wrong happened. I think different happened on Twitter or wherever so it worked out. I guess what I would have done is what WWE did with Seth. Yeah. They turned him heal after all his Twitter controversies and then really leaned into his douchebag character. How do you turn Tessa here?", " Although when she's the only woman so far all the time same thing same same way you turn Seth heel but you wait a few weeks. I guess we're at that show itself now. Yeah, I want. All right. All right now fuck you all dependent dependent is a guru on how how long this this whole controversy runs like whether it's still going to be sustained but two or three weeks after a month after yeah, I don't know. All right, so", " You know for a for whatever it's worth, it's still a reason I guess a tune in to impact if you're looking for alternatives to WWE. You've got a lot and really yeah, aw is definitely at the top of that list for sure. And that's why I want to talk about it. Yeah, cause I've been watching Dynamite since the first episode and even if I miss an episode, I make it a point ninety, but back-to-back Russia and you know most times it I regret it immediately because into our spot on now Papa gonna who yeah, I got you. So there's something about dynamite and I've been meaning to get", " This off my chest that I just don't get like I'm not as invested in it as I would like. I'm invested in certain people. I love Chris Jericho because I have been a fan for years. So automatic. If Jericho's on my screen, I watch right? I don't care about the Young Bucks and I know they're gonna upset some people but I don't give a shit about the Young Bucks. I'm not that invested in them as well. I don't care about carry Omega. Oh, I sort of care about Cody. I sort of care about MJ F. Okay. I", " I barely care about the Jurassic Express and SCU. I don't to me private party is just a poor man Street profits. Okay. So these are all opinions I have because I think the aew is focusing on the wrong things. Okay, so they presented themselves as the alternative to WWE and they're doing it by having long matches. Like that's that's what I'm getting. Yeah, because every soul has 15 minute match after 15 minute match after 20 minute match.", " I'm like Jesus. I don't need all these pay-per-view quality matches week after week after week. And I think what w is done well for all of the shit that they've done that Hindi maganda what they've mastered is in production quality how they're able to time things such that Hindi connects Asawa or but beaten man it leaves you wanting for more when Drew McIntyre goes out there and squashes. No way Jose. It makes me want to see a match where Drew McIntyre finally meets his match right whereas need to say ew is like", " Every Kenny Omega matches so fucking long, right? Right, so and about an alligator Mobility because like sign I also knew Japan like my Marathon chat about 3540 minutes 1 hour matches, right? But I thought this is like a quick Sprint now forever Kenny Omega, but I don't think this is the way to go like if a ew wants to be the counter or the alternative to WWE. I don't necessarily think that long matches are the way they should do it. Okay. I really there in in respect in.", " In that respect because you you really hit it on the head that there are two meant dirt too many minutes of wrestling going on in each aw episode and I think that they're using this to try and but I'm not the one hide but compensate for the fact that people are tired of poor storytelling on the B side. Yeah, poor angles poor programs for definitely head-scratching fields and", " That yeah, like the Rusev Lana angle. That is still ongoing. Yeah, definitely that stuff is terrible to watch. So I think the it certainly seems like aw takes a look at that and then they re they somehow think that the way to counter program that is to just have really good matches, but I don't think that that necessarily solve it because for example the Chris Jericho, Jon Moxley story is actually pretty good. Yeah now Jericho was trying to poach Moxley.", " And have him join the Inner Circle. He's made his Godfather offer. And then Moxley suppose answered about her has already answered and I am not sure if I finished in last week's episode. So he faked it out. Okay there he faked it out. So so there so you don't need a 25-minute match for that, uh, three main event Mubarak or if it's like SCU versus the looter Roosevelt for the tag team back in the main event should own should be the longest match on the card. Yeah always even although I know Smackdown that's a follow this", " Rule does not need anything not needed that um at the bottom we touched on this weeks ago, but the way that they booked some of their characters is also very inconsistent. I mentioned a me Sakura few weeks ago how she comes out as a baby face but work sealed in the ring like what's up with that? She's not the only one the looter Bros are a very good example of people who come out to a good reaction kind of act like a badass baby faces when they're making their way to the ring and then in the middle of the match, they start turning heel. I know this because", " I've always been baffled as to what the Lucha rows are after the tag team tournament. I think they're healed that like they're healing now better. It also doesn't make sense. But I'm pentagon is the only one who can really pull off being healed because we all know him as a heel back and Lucha underground but Ray Phoenix doesn't doesn't have that same he'll quality or about him. You know, why you keep swinging around that's true and as an audience member you pop for", " A flying ship neighbor and now it's fine. The high-flying stuff is fine. There is a way to pull it off as a heel and especially if you're just being really arrogant think about it, but am I getting old and I don't want my heels flying around. Yes a little bit better it also in yay. It's in the how it's in how the heel carries himself. Here's the thing aw tries to say now. We're doing things WWE won't do and yet they're kind of doing some of the same things.", " No, no, I want to say the same things like obviously W doesn't do the doesn't have that much wrestling on their own TV shows. Yeah that I do think that aw thinks the best way to to establish characters is to have them wrestling matches. No, I mean the dark order even though they're not the best group ever. I'm invested in their Arc because they've got really good vignettes. Sure. Yeah. That's true. I remember in WWE, especially when you and I started watching we got invested.", " In Carlito and Kofi Kingston and Alberto Del Rio just watching their vignettes. You don't need to have them go out and put on a 25-minute marathon free to get invested in that character mjf is someone worth investing in even though he doesn't really wrestle ya how like I can probably count on like two hands how many matches he's had including you must pay per views before the actual shows. Here's the thing about the shows. The shows are supposed to be teasers for your pay-per-view and WWE understands that to a degree.", " The of also because they have pay-per-views every month either. We doesn't you as you've seen the next pay-per-view is what in February. Yeah in Revolution and that was what the last paper your was in November. Yeah. So it kind of makes sense then that some TV some TV episodes will have like big matches like NXT does. Yeah, so I get that in that respect to get counter-argument sure. Why was Lucha underground so easy to follow kite and as a bit, let's take out the length.", " That from that story at loot underground for one hour Dynamite two hours. But Lucha underground didn't really have pay-per-views absolutely underground is a show about wrestling. It is a show nothing about wrestling. It was a show about underground Lucha Libre fighting Club. Yeah, so they understood that they had to write around the show and not to write it as a wrestling show. Mmm gets soap on there. They were self aware that there was a bigger Arc.", " Whereas a dynamite this is it it's not that they were self-aware. It's more of they knew it wasn't a wrestling show. It was a show about wrestling. Okay, so it and it was it was a given for them that there were there was going to be a lot more character work. Okay, so get then compared, aw its direct competitor and XT. Sure NXT is also a two hour long show with probably a roster as deep as a double use, but NXT is easier to follow and anx", " Easier to get through and I think it's because they know how to mix it up with the squash matches the quick non squash matches and you actual hard-hitting Affairs. I'll tell you why as well something you probably might not have considered. It's also because of the style aw has there has a lot more freedom. Kombucha to have wrestles wrestle the way they want. Yeah, whereas in the VW as with all the BWB Brands under their umbrella.", " And it kind of follows the verb to be style of this is more. Uh-huh. So these are not only find out it even though it could get boring and slow sometimes on any W program. Yeah, they fight they kinda that's the beauty of their programming at the PC. Yeah, inviting tried-and-tested method. Yeah, they know it works. It's not obviously not for every wrestling fan. It's not that is not their cup of tea. Yeah, and there's a", " Then why aw is waiting in the ratings? Yeah, because there is an entire subset of fans who like it this way, right? But that's just the way it is. Here's my last hot take for this. And after that we can move on. There are people online who been afraid not oh, aw might just be like WCW in its Dying Years where it was a big a circle. Jerk. I fear that aw already is I don't think so because the worst of the bcw because I was the worst parts of WWE", " Inward. Yeah, you see how WWE gets absurd right now because there's no one to check them and you know, really derail their momentum and their viewership, right? Yeah. What w so what WCW did to fail was that they took those absurdities and really ran rampant with them and then basically use those absurdities to in their Circle Jerks not just the absurdity say", " But even how they book themselves basically to remain on top Humane. Yeah that that is part of the absurdity with aw. I don't accuse like the Young Bucks of always putting themselves over because if you don't lie, that's not even Kenny Omega is always on top you buy a Cody's not on top all the time either but I think the circle jerk comes in through the length of the mattress and them resting their own style and I having much control. That's a good point. Yeah, so they're that point so that's where I see the circle jerk and it's not as obvious as it was in WCW.", " You but when I say nah, aw is already a circle jerk. That's where it comes out. So it's just something for you to think about. I mean, I'm not going to stop watching aw, because I do have some vested interest in it and as a longtime fan of the business, I want aw to succeed. I just don't want it to bore me. Is that too much to ask for the thing about that is it's already succeeding. So you may be bored. You may not like how they conduct business but it's working whatever whatever they're doing is working.", " The market they're trying to capture it might not all be perfect every week. But it's I guess to a lot of people it feels like enough of an alternative to the W machine. So, you know, it's an entirely different taste. It's just the way it is and it's just the way people like it. Yeah, I guess I'm in the minority here. Unfortunately, I'm in the minority and normal bus. Nah, you know, look at that Stan.", " See Guy, what a pro WWE Mark. What I will say about the things you mentioned, especially the match length. And those concerns is that it isn't inherently wrong. Like I don't think it makes for a terrible wrestling product. It just makes for personally between the two of us. It just makes for a product that I can't really keep up with every week. Yeah that will sadly as much as I want to hail, aw as a true.", " Alternative to WWE. This isn't personally the way I want to watch that's why I kind of like that. We didn't end of a power. So it is the exact opposite of what aw standing for right now. Yeah matches a really short there are there's way more character work and talking. Yeah. So to me, I think when that happens when when there is too much talking. Yeah, there's too much segments too much.", " Segments to build up all the different gimmicks, right? Yeah. It kind of makes the the wrestling a little more special healing to be long enough talk. I mean you have to watch being the elite and darkness. Yeah, you know that I should you should have brought that up earlier. Yeah. I don't like that. Yeah, like I have to watch so many things to keep up with an already two hour-long show. Yeah, that's the biggest problem with aw that you have to watch the ancillary programming just to understand the main story.", " I don't need that why can draw get away with the three our programs at the need for you to go to their social media channels about I mean if you have time for an hour-long episode of dark and like a 15-minute being the elite episode good for you. God bless you. I don't have that time anymore. Right? I'm 30 next month. I don't have this anymore. I'm trying to be a functioning adult. He knows not even about the time. They say it's about for me. They's yeah better. I would say that it's not about whether who has the time for the other stuff. It's more of you should be putting the", " The other stuff in the main stuff. Yeah, and and you should be able to streamline everything. Yeah, it doesn't it's not efficient, you know, and yeah, it's not efficient. Right? So we're going to leave the aew discussion here if you want to jump in if you have any violent reactions because aw is the best then go ahead and tweet me at underscore stance III troll a troll is warrant with the podcast as well at wrestling to xpod. Let's get this conversation going. Let's try not to Flame one another and be responsible social media using adults here one last thing.", " I would say that I don't know if it's because of the the power of WWE to purchase so many talents around the world. Yeah, but the the the matchups on NXT are more compelling to me. Oh, yeah, I agree. I mean the time Splitters being back in Wi-Fi. Yeah. I'm in yeah the times feathers as you as you just heard right now and as you probably already know from last week, yeah are back in participating in the dusty roast acting", " Classic they're taking on the grizzled young vets. Yeah, I mean imagine that it's amazing. How WWE is the one company that's able to bring back the times two hitters Dubai. Fuck. Yeah. All right there. So I hit us up on Twitter. If you have anything that you want to contribute to this discussion. All right. So let's stay in the W umbrella now and let's talk about page because she made headlines over the last 16 17 hours as of recording because she sub tweeted a tweet of a", " Fan who screencap a portion of Triple H's interview following I think takeover Blackpool probably that. Yeah. Yeah. So the interview itself or the clip in question is something we'll play right here when you're talking about people as talented as age page who wouldn't want them to return. I'm a fan just like everyone else and I would yeah, I would love to see them step into the ring and compete more importantly than that though. I'd like to see them live long healthy lives. You know, it just kids, you know page.", " Maybe she probably some she is no of but thank you. So the clip itself isn't so bad when you think about it because the message is about Daniel Bryan coming back and Edge and pay him back. Yeah. Yeah, you know overcoming their injuries and whatnot and overall. That's a good thing. Hmm. I like Daniel Bryan coming back. I want ads to be back all the injured people who", " Believe might have had their careers cut short would be great to have back right p.m. Opening joke the Triple H at the end and I it's not. Okay. I want to be I don't want to be this guy, but to me, it wasn't cool, but it wasn't bad as well. Like it could have been so much worse. Okay, I don't want to be that guy who encourages another dude sure me a joke out of a woman's biological functions.", " Because that's not cool especially in this day and age or in any damage for that matter. So I think I see where page draws the line. Yeah, I see it too. I see it too. But to me because in their degree, so to everything and this wasn't scorching-hot to Merit. You know that yeah, so here's where you and I disagree. No. No, I get it. I get it that page should stand up for herself. No, not even that. Okay. There's the context that page has been made fun of and", " Yeah, yeah for sex. Yeah sex video sex tapes. Yes. Yeah the sex tapes about we all know what happened. So it's another low-key sex joke and the fact that these jokes have intended for page I get why this is a source of yeah and anger now don't get me wrong. I get it too. It's just that I don't know. It's if I were page and obviously I'm not page. I wouldn't have sweat over that over that particular line. But again, obviously, I'm not page. I'm not I'm not to say", " Say what what sets me off or what sets page off or not. So I will give it to her as well and that she is well within her rights to feel the way she feels no, I think she's perfectly entitled to fees actually wants to feel how she is feeling about I think she's also perfectly entitled to speak up about it. Yeah, what's the worst that could happen to page? What they're gonna fire her it Authority didn't ya? What does she have to lose? I think it was a very bad look for Triple H because he is their boss and he is the", " One of the figureheads of a big publicly traded company and from to make a sexist joke like that. Yeah. It's a sexist joke. Yeah, let's call it what it is. It's not a good look and it could have been so much better had he just kept that to himself because he Triple H is almost 50 and his views on the world may be different from you and I and I respect that but you know, there are certain jokes that probably should just not leave our mouths anymore and that joke was one of them. Yeah, that's pretty much it. That's", " All there is to say about it. Alright, let's end this episode or before we get to the picks of the week. Let's talk about raw really quickly. I see okay some things to talk about one the Rusev Lana telenovela angle still not fucking over what the fuck still not over I'm the rumors are that this is set to last all the way until WrestleMania Jesus Christ. For real. Yes, how how much more can they Twisted? I do not know but there is a mixed tag match scheduled for next week. Okay? Yeah.", " 2:7 liver teaming up now hyelin, actually, I mean the problem with stretching stories that far is that you bombard everyone every week. If you didn't do that, like could not if Lashley and Rusev and Lana and then maybe live took a detour doing other things right doing other stories and getting involved with other people in the wrestling part of the show. It might be okay to come back to what come WrestleMania time. It's kind of like what New Japan", " does divine that they're going to set something up for for example for a new beginning or the minuend about then some shit goes out to G1 and the New Japan cop and all the other shit then by the last quarter of the year publicness, I wrestle Kingdom. Yeah, and there are other collision course, I mean you I mean Rusev already lost and I lost again today nationally already won the whole divorce thing. Nope. I don't why couldn't we ever going to go with this and there is no reason not to because it really done this, but why can't we just", " Why can't we just explore married life between Lana and lastly? Yeah the bottom so it's not it's all it's cracked up to be Pilots. Exactly dude that shit. Keep them away from each other for what for a couple of months. I think we'll manage it - yeah exactly that's the problem with these things and that's something that Vince forgot how to do in all these years in what over two or three decades of could condensing.", " In the WWE calendar and putting so many shows in it. Here's one more story line under all that. I'm really sick and tired of Alistair Black versus buddy Murphy. I also wondered why they kept going back to that. Well, I mean, obviously it's because they they have good chemistry together. But when I saw that buddy Murphy is under under Seth Rollins Wing out. Yeah, I was like, okay, that's cool. No, I like this development because I finally I think we're going to get", " Of the Alister blackbody Murphy story, not only because that you know, like I don't know what Paul Heyman is going for when he kept giving us Murphy vs. Black for the nth time because he just wanted a good match. That's what they do. Yeah, but like in previous years we never had that problem as we dad or are okay. Yeah. Okay outside of this era like the ruthless aggression era we never had this problem when the only time we did have the situation was when there was a best-of-seven. Hmm But I think there wasn't anything on the line. There was no best of seven. Let's just keep these", " Guys fighting hmm. It was stupid. I I lost interest in it and a now buddy Murphy has aligned with Seth and aop that's good. I think I think this is good. I love factions. I don't know onion ties anybody Murphy to Seth and aop, but I'm all-in, you know, he probably has bought into the whole Monday night Messiah thing, which I love by the way. I love that as a gimmick Monday night Messiah catchy great t-shirt Q all the hardcore religious people screaming sacrilege. I think this is the this is the rate.", " Our Superstar of this year of something off Seth Rollins. Ah, you even that nickname that stands out neither architect. Now it's the is the character that he can finally tap into and you know, I don't know if he could take it mainstream but it's the gimmick that could finally really put him on the map as a as a villain as a top villain the same way rated R did for Edge. I hope so. I hope so because like the whole fist fights ship wasn't going to do it.", " It hmm. Let's talk about that really quickly because they were built they announced it last week and it caused so much noise on social media because number one what the fuck is a fist fight even in www-what are the rules. How does someone win and then all matches our hand-to-hand, right? Yeah. And then on the Bank closed fist Bali in wrestling, so at the way they but then again Big Show's finisher is basically a closed fist. Yes. So we're just waiting for the match. That's why they got it for the match. But when the match happen it was basically a no DQ", " Such tables are bust out. Kendo sticks all these weapons. So what was the point really of setting this up as a fistfight? Hmm. I don't get it. Oh, that's the marketing Ploy the promotion of the whole thing. As you know, Kevin Owens asked try to ask what the rules of the fistfight were. Yeah, and he was put on hold for five hours so dumb, it's really dumb. I'm just glad now we got the body Murphy thing coming out of this the Becky Lynch.", " In Chaska Saga looks to be on you know on a forward path and the very least, you know, Charlotte and Sarah Logan have a mini Feud. I don't know why but I'm into it because it means our log is getting sorry Logan is getting screen time. It's the little things, you know, you know in Charlotte's are Logan. They're not bombarding us with I would say 20 minute man. I would say even though not everything he does is a hit. I think Paul Heyman is really good at utilizing the rest of his roster. I think whoever's running smack down.", " Doing the same thing the money I never the oldest man you story. I love you owe this man the angle. I think it's really good. It's very organic. It's not disrespectful to anyone and it's tapping into relatable emotions than everyone can identify with hmm. Look at the Sami Zayn stable. It's also something worth investing. It is Mojo Salon in that stable like no, he's not. He's on Raw. So that means I really was just a one-off me. Yeah, it's a one-off thing. Okay. So Mojo's your twenty-four-seven Champion, by the way after Brock laid waste our truth.", " So so I'll give Paul Heyman that now you got the Mojo rawley's and the Sarah Logan's and fine. No way. Jose is get out there to buy they have something to do and Paul Heyman has managed to make me care about Randy Orton again. Yeah, so to some extent together there, let's give credit where credit is due. It's just that the big stories are not executed as well as we'd like, okay. Yeah, it's not. Yeah, that's a good also there is still a lot of meddling by veins and all that if you can mean what", " All does is that he does the little stuff well, but obviously, I think there is a lot of meddling on not meddling but you know hands very Hands-On management by Vince McMahon. Yeah, which is always been the the problem the bar and we've heard it directly or indirectly from people who have been in and out of WWE. So, you know for I think I think a thought pattern we can generally corroborate and accept this fact, right? Yeah. Okay, so", " So that's pretty much it for this week in wrestling. Is this for now? Yeah for now the first half for the first half of the week. Yeah, we've got some other stuff going on we talked about be WR. Mahboyy. I'm wrestling we talked about the Royal Rumble viewing party. Now, let's give you our picks of the week. We'll give you our picks. I'll start mine is the main event from takeover UK Walter Joe Coffey told you why we loved it. And if you just have room for time for one match pick that sure sure hi. Mine is Jordan Devlin versus Tyler bait from the same show really good stuff. You should watch.", " It's really good. But also if you want to you should definitely catch decimal answers World Championship. We have I told you not to gu Latin and Jordan devlin's actually Paul what? Yeah, he's like 510 is yeah, that's tall. No, but not the really tall. Well, I guess but say he's like as tall as Finn. Yeah, so I met him in person at access. Yeah, do not neglect because I had this image of him as well. Not really Drake Maverick height, but like it's inside what", " but silent when they were lucky and fin are like a carbon copies of each other. Oh, yeah. I know he was called budget battle. But yeah in alang alang I was just shocked that Jordan devlin's actually a tall person. Alright. Alright, so there before we end episode 312 of the wrestling wrestling podcast. We gotta tell you what's happening for 3 1-3 this podcast is about to get more handsome. Hey, we've got the newest member of MSG El Guapo Carlos Zamora joining us for next week's episode.", " So Dove or for Thursday's episode rather the wrestling wrestling podcast will talk about how he ended up coming to the Philippines in the first place working for pwr how he ended up back here within a year and how he found himself back on the card. And as a member of MSG. Can I just say that you signed him to MSG? But we are not the first podcast. I have them on. We're not we're not I didn't know that. Yes, we're not sadly well,", " I could not do this. Okay. All right. So there that's something for you to look out for on Thursday or Friday zepa sewed of the wrestling wrestling podcast until then. Please continue to subscribe hit download leave us a five star rating and leave comments and use the power of social media to let people know that this very humble nice podcast actually exists, but it didn't commit honorable mention on an Esquire article. And if you have any other comment to understand our way the Twitter is at wrestling to xpod.", " There's at caveman cameras achieving super-sized even though neither of them are here. He's a troll with soir. I'm at underscore stand see this is episode number 312 of the wrestling wrestling podcast. Shout out to be B face producer Ryan and the valve for doing all of the leg work behind the scenes and our family here at podcast Network Asia and Wii remote co-working Philippines. Where were you where we record every single episode since we signed that that's it. This episode's in the books were out here. Peace."]}