{"showID": "0A2jf2xBqee3KXv2AUfsp7", "show_name": "Breaking Beyond-Guided Meditation", "show_description": "Join me for daily guided meditations live on Periscope at 5:30AM CST or here on your favorite podcast.   linktr.ee/jillzjazz   These meditations are derived from my years of practice in Shamanic journey and are uniquely different.  I work as an Intuitive healer, meditation coach, past life regression therapist, and psychic medium. My meditations are meant to allow you to turn the mirror on yourself and look inward for deeper self awareness and healing.   At the start of each meditation, there is a brief discussion to help bring clarity to the signs and symbols that present during your practice", "episode_name": "Breaking Beyond-Guided Meditation", "episode_description": "Join me for daily guided meditations live on Periscope at 5:30AM CST or here on your favorite podcast.   linktr.ee/jillzjazz   These meditations are derived from my years of practice in Shamanic journey and are uniquely different.  I work as an Intuitive healer, meditation coach, past life regression therapist, and psychic medium. My meditations are meant to allow you to turn the mirror on yourself and look inward for deeper self awareness and healing.   At the start of each meditation, there is a brief discussion to help bring clarity to the signs and symbols that present during your practice", "transcript": ["Hello and welcome to my daily meditation. My name is Jill and I do a live broadcast of my meditations every day on an app called Periscope really early in the morning. And this is the audio recording of that meditation. Now today's meditation is about looking at the things that we sort of hold onto US holding our bodies thoughts and feelings and it's just sort of continue to Circle.", "And there's really no relief from them. We all have these we all know what they are. So in today's meditation were taken to a place and this could be any place but it's most likely a room of some sorts and you're in this place and first I want you to fill in your bodies because we'll have our bodies won't lie to us. Our minds will tell us all sorts of things. But our bodies will lie to us about how we're truly feeling about something. So if it's nervousness or fear or love or excitement, whatever it is", " So first, we feel that in our bodies and then we move those few those feelings to words and the words are going to come out us going to be able to see them. And then from there we're going to release them. So how you release some can happen in a million different ways. You could grab ahold of them crumble them like paper throw them in a trash bag in the basket. You could place them in a fire. You can do all sorts of things. You could make them into balloons and let the balloons go off into the sky it whatever.", " Your imagination wants wherever it takes you it's just a way of release. So releasing just kind of gets it off of your heart. We're going to release and transmit it to something else. So after you release that we're going to allow new words to come in and these words are to shift. This is not ego. This is you just receiving love loving affirmation and those will bring into our hearts and then we kind of anchor them with breath and come back. So it's a pretty simple meditation, but can be very powerful.", " Awful, if there's things that you really truly need to see and and release and transmute that into love. So I hope you enjoy today's meditation is always I hope it brings you homeless all my best.", " slowly exhale", " deep breath in all the way down to the belly.", " slowly exhale", " last one deep breath in", " and slowly exhale", " I returned your breath and nice relaxed state.", " Even flow through the body.", " Her breath should mimic an ocean wave.", " Earth tones in that tiny comes in breath goes out I goes out.", " Glenn relax your shoulders", " So your muscles relax?", " Will their relaxation all the way down your arms to the tips of your fingers.", " Feel that slow breath coming in and out of the body.", " Your mind races bring it back to that breath feeling it come in and out of your lungs.", " Hearing that breath in your ears.", " Just returning everything to balance and your body bring yourself to much calm or state your mind. We can too slow.", " Who's racing thoughts will subside that breath will keep everything balanced.", " We're going to start meditation little differently today.", " We're starting in a room.", " a place that you know", " place you've been to", " Why you just see yourself there?", " You're standing in the middle of the room.", " Your feet on the floor.", " slowly rise your gaze", " take a look around.", " Identify where you're at.", " Your mind races to choose a place to stick to the first one that you land on.", " Don't change it.", " We're mind goes is where you need to be.", " As you're looking around this place. I want you to find.", " sort of an anchoring spot", " place where you can sit", " or stand and view the whole room or place its most comfortable.", " Keeping up breath flowing through the body and the body relaxed.", " Now is your mind settled on this space?", " in this room", " We're going to start digging into the body. How did the body feel?", " Is your heart racing?", " Did you feel your body slump a little bit?", " It's your belly tickle or do somersaults.", " She'll come over your body.", " How did your body respond when your mind settled?", " As you're in this place, how are you feeling?", " I'm talking about physical sensation. How are your feelings were not examining those yet?", " Now those were analyzing our bodies. I want you to bring those feelings up.", " Do identify themselves with words one word at a time and we're just observing. We're not analyzing why we feel that way. We're just observing the words.", " As if they roll past our face in a picture.", " Because you see all those words come out.", " Moving across your face. I want you to release them.", " pushing them away", " not down not down into our bodies. I like we're ignoring them. This is a release off of your heart. So as we have these words come up.", " Painful. Joyful. We're putting them back out into the ether.", " And holding them on to us.", " So if those words were lying on our bodies or just plucking them off.", " And throwing them away for our bodies.", " Perhaps in the room that you're in is a fireplace.", " To place them directly into the fire.", " To be burned and changed into something else.", " Now go back to your Anchor Place.", " Going to bring something else in.", " Suppose we sit there and new words are going to appear in front of our face.", " As they do I want you to bring them into your body.", " Those last words coming to your body which to place your hands over your heart.", " I wanted a nice deep breath in.", " Slowly exhale take a nice deep breath in and slowly exhale.", " Put your hands together in front of you in prayer position. Just take a moment for affirmation.", " You're setting a goal for yourself.", " Reset your mind starting to a new whatever it is that you need.", " Just take one last deep breath in.", " and slowly exhale", " when you're ready and come back to me and open your eyes and greet the day."]}