{"showID": "0a2P0WKrPIzDSiB57ILdwN", "show_name": "Your Sleep Guru ", "show_description": "Join me, Clara, for detailed weekly guided visualizations through various landscapes to promote relaxation, peacefulness and sleep. Each visualization is detailed so the listener can lose themselves in the dreamscape and as a result, leave behind any anxiety, tension or stress. The podcast is FREE and intended to create a space of refuge from the tumultuous times we live in. Simply close your eyes, breathe deeply, focus on my voice and walk with me in your mind.   https://www.yoursleepguru.com   **please, do not listen to the podcast while driving a car or operating heavy machinery**", "episode_name": "Your Sleep Guru ", "episode_description": "Join me, Clara, for detailed weekly guided visualizations through various landscapes to promote relaxation, peacefulness and sleep. Each visualization is detailed so the listener can lose themselves in the dreamscape and as a result, leave behind any anxiety, tension or stress. The podcast is FREE and intended to create a space of refuge from the tumultuous times we live in. Simply close your eyes, breathe deeply, focus on my voice and walk with me in your mind.   https://www.yoursleepguru.com   **please, do not listen to the podcast while driving a car or operating heavy machinery**", "transcript": ["We will begin our visualization today with a quote by Susie Kazam.", " Everybody has a little bit of the Sun and the Moon in them.", " Everybody has a little bit of man woman and animal in them.", " darks and lights in them", " Everyone is part of a connected Cosmic system.", " Pot Earth and sea Wind and Fire with some salt and does swimming in them.", " We have a universe within ourselves that mimics the universe outside.", " None of us are just black or white or never wrong and always right.", " No one.", " No one exists without polarities.", " Everybody has good and bad forces working with them.", " Against them and within them.", " You find yourself walking through a Ponderosa Pine Forest on the Eastern edge of the Great Basin.", " It's soft wind Whispers through the trees.", " And the Stillness of the place is broken only by the sound of crickets and a few birds in the distance.", " The breeze carries with it a hint of butterscotch Aroma which is unique to the Ponderosa Forest.", " The footpath is well-traveled.", " The pine trees Tower overhead.", " Coming in between the tall straight trunks are Brushwood and Quaking Aspen with Lush spring growth.", " Among the wild grasses that line the Sunday pathway. You see purple woolly locoweed mosque. This'll", " Vermilion Indian Paintbrush and sunflowers", " after a while the trail begins to curve tightly through a Slot Canyon beside is swiftly running creek strewn with massive Granite boulders.", " Here and there the Rocks hinder the flow and the Rapids drop down into small pools.", " Above the noise of the water. You hear a soft rustling in the trees overlooking the trail.", " You glance upwards. I noticed the porcupine quietly watching you from the branches of a Ponderosa tree.", " The porcupine has gentle soft eyes.", " And even that it looks kind enough.", " You understand how dangerous those quills could be if you are to upset it.", " The deeper into the canyon you go.", " The steeper the walls of the canyon become and the world of the terrain.", " You can almost feel the canyon breathe with pockets of warm air in the Sun and cold air in the shade.", " the canyon walls a smooth and soft red", " In places you see small grasses and other plants pushing the possibilities of life.", " growing out of the sheer rock face", " the Kenyan ends", " it is spring cascading jewel blue water gently into several deep Rocky pools.", " You walk over to feel the water with your hand and to your surprise. The water is perfectly warm.", " You realize you found some hot springs?", " You take off your clothes and step into the pool.", " And then float on your back.", " You gaze up at the puffy white Bank of clouds.", " a feeling of tranquility and Gulfs you", " You relax like this for a long time.", " breathing in and out", " weightless", " After some time has passed.", " You see another smaller pool we decide to try.", " It isn't just hot for as deep as the pool you were in before.", " The color of the water is a bright shade of blue.", " You weighed in and then stretch out on the flat cobblestones lining the base of the pool.", " You can support your head and neck with a smooth Rock.", " And here you decide to relax.", " Until it's time to return down the trail."]}