{"showID": "0a2rz6SLuoQagFLypkidtg", "show_name": "The Modern Warrior Podcast ", "show_description": "Welcome to the Gavin Meenan Podcast; where I'll share the strategies and principles you need to adopt to become a more confident and resilient man in the 21st Century!", "episode_name": "The Modern Warrior Podcast ", "episode_description": "Welcome to the Gavin Meenan Podcast; where I'll share the strategies and principles you need to adopt to become a more confident and resilient man in the 21st Century!", "transcript": ["Hello and welcome to the Gavin meaning podcast. I am delighted to have you here today. The aim of this podcast is to help the man out there build stronger Mains bodies and lives over the next few podcast. I'll be sharing some of my own life experiences my own struggles May on lessons to help you navigate through the storms of life throws your way. But today I'm going to ease you entered today. I'm going to share with you some of my", " My daily rituals that have helped me become a stronger man and in turn will help you become a stronger man and made a stronger more confident and more resilient life. So the first thing I do every single morning is I get out of bed and I make that bet and make that bad like, it's the last bed. I'm ever going to make in my life. I put a lot of effort into it. And the reason for that is it has many different benefits. But the main reason I find is that", " It's set you up on a productive north of the day completing one task. First thing the morning will help you complete many other tasks throughout the day after that. I make sure I get hydrated when you sleep at night your body becomes dehydrated and dehydration can cause a lot of tiredness and can be mistaken for hunger cravings throughout the day. So it's important get hydrated first thing in the morning. I have a paint maybe two pints of water with my breakfast as the third thing. I cook a high-protein breakfast.", " What's that? I'll have some eggs, maybe a bagel some porridge Weetabix. Have a good balanced breakfast to set me up highly energized and ready to take on the day. But before I get into my daily tasks and before even switch on my phone, I'll go out for a walk and what that walk I will listen to an audible or a podcast to learn something first thing in the", " So I feel like I'm powered up in mind and body. I've got my heart rate up. I've Got My Mind gone and I am ready to take on the day when I come home. I usually do some meditation maybe 10-15 minutes depending there's a great app. You can use for meditation called headspace if we're not too sure how to meditate or how to go about it. It is a practice that is a discipline that needs to be learned Over time. However head space has been", " in a massive benefit to me and I can help you out too. You will need 10 minutes of it and really set you up for the day gets rid of all that noise in your head and really brings a lot of clarity into your daily routine. And after that I get a blank piece of paper and I just brain dump whatever is in my head and if you've got any negative thoughts that you dumped onto the page this may sound can a Cheesy or a bit hippyish like but if you got some", " But it's really beneficial. If you rip that page out and burn it or flush it down the toilet because you've just got rid of that negative thought in your head instead of carrying it with you into your daily routine and it affects every single thing you do everything you're doing your morning routine has a ripple effect into your day. That's why the more routine is so important then the last thing I do is I write down maybe three to five things. I'm grateful for in my life and they're going to read it.", " Personal to you make sure something really means something to you don't write down thankful for this pan that I'm using so I can write down a piece of paper, you know, think about the things you value your life and the things that really make your life worth living again that just set you up on a more positive note for the day instead of switching your phone on you read news. And you're just reacting to perhaps the Lakes the comment you got from your post and I before whatever.", " This can set you up on a really reactive mode for the day. You're basically starting your day putting out fires. And for the rest of the day. That's all you do and you are on a very short fuse. So it's important to recharge your battery before you go into the day because throughout the day people things. Your job should tasks are only going to drain your battery. And if you haven't charged up in the morning you are gonna find yourself fatigued run.", " Down and burnt out very quickly. So that is the first thing have a great morning. Also, what's that? I will plan my day in this is usually done the night before and the reason we're planning. My day is it gives me a GPS system almost for going into the next day. So don't go in there and autopilot. I know exactly what needs to be completed. I've got one or two priorities every single day. That's non-negotiable.", " That means they say that nothing is going to get in the way of me completing those priorities and those priorities have got to be high value task something that really means a lot to you and it doesn't necessarily have to be something work-related could be personal it could be family, but it's something that's really important to you that you need to complete that just adds a dynamic to your day a positive Dynamic to your day. And again, that's just going to enhance your life enhance your day and", " Should positivity now with my daily routines and this is gone to the next point. They're all based on a long-term goal that I've set for myself.", " And it's important that you have a long-term goal for your life. The reason for that is a gives you a life of purpose. It gives you a drive and what that long-term goal. I break it down into smaller pieces. So it could be a six-month goal breaking down to a 3-month goal break it down to a one-month gold break it down to a weekly goal and break it down to what you do on your daily activities in your daily tasks that are going to bring you a step closer to", " Your long-term ambition. There's your purpose. There's your reason for creating a daily structure. There's your priorities and tact not just written down there for the sake of it. You're not just wasting time and that leads me on to the next point is monitor your social media. There is a great app. You can use called get focused. It shuts down your apps for a certain period of the day and what that you can improve your productivity now.", " Roland guilty of it, even I'm guilty of it picking up your phone replying to a message or checking some post on social media and next thing, you know half an hour has gone by an error has gone by maybe even 19 minutes. Those are 90 minutes. You'll never get back in your life. Those are 90 minutes. You could have spent working on something that's more important to you work on something that's going to add value to your life and not distract you from your long-term goal your long-term vision.", " super important", " time times not going to wait for you. You've things you want to achieve your things you want to do if people you want to meet you have a business you want to build. You've got a body you want to improve.", " Time's running out every second every minute of the day is an opportunity to improve that.", " Don't become distracted procrastination will lead to dead end destinations. Remember that.", " along with monitoring your social media", " It's very important that you monitor your income and your expenditure. It's difficult to be a strong or powerful man, when you're completely frustrated worried or anxious about the amount of money in your bank account. And we all have bills to pay we all have money. We want to save for a holiday or something that's important to us. However, without monitoring your income and expenditure.", " You could end up in a lot of debt and I can relate to this.", " Years ago I would have had no value in money and I spent it as much as I earned it and I'm spending more than I earned. I ended up in a lot of debt all because I was buying things to impress other people who I really don't give a shit about it. And the reason I want to impress them was because I wasn't impressed with myself. I was putting on this Persona of a different person buying a fancy car buying clothes. I couldn't afford even go ahead and nights I'd spend a lot of money back.", " Thanks for the people trying to come across as this High earner Big Shot confident young man, which I wasn't I was simply filling a deep hole on the myself and the way I got out of that was.", " When the shit hit the fan and the banks were in me look for money.", " And I'd ask myself. How did I get to this point and what that would been in the pits came the opportunity to progress?", " And I was able to progress by becoming more self-aware.", " And self-awareness is something I will go into in the next few podcast. I think it's so important you will find massive power in your self-awareness to get to know your strengths your weaknesses and how you can use them to navigate through the many winding roads of life how we can utilize your strengths to work for you and how you can navigate through your weaknesses or else delegate your weaknesses to somebody else so it doesn't", " Deter from your strengths and without stuff wearing this we end up making a lot of destructive decisions. You see it every week and guys going out spending a lot of money on drink and Coke on women, whatever it is waking up on a Sunday morning with a hangover. I'm feeling completely empty and wondering how they've got to this point.", " And it's quite painful to wind the clock back and find out who you really are.", " And that's the reason a lot of people don't go there.", " However, the way I see it is the consequences of not going back are much worse than the consequences of pushing forward without knowing who you are.", " I've been there. I've had to ruin back the clock to get to know my anxieties my reasons for falling into pitfalls along my life. And as I said, I will discuss this in a bit more detail and further podcasts.", " The last thing is it's important to exercise every single day. No one has a exercise. That doesn't mean you have to go to the gym every single day and completely kill yourself in there.", " I mean doing something every day that's going to enhance your body. And what's that improve your mind and your life too.", " I train five to six days a week on mine on training day. I still go out for a walk do something. I enjoy but it's active rest and my active rest could be your idea of exercise and that's cool. Everyone's got their own thing in go to class go to the gym. You can go for a run. Whatever it is. As long as something you can enjoy so then you can sustain it. Keep it going for life and becomes a daily habit.", " Well that you create many other great habits in your life. And again all this serves to strengthen your mind your body and your life. So to recap on those points in no particular order. Have a great morning make your bed get hydrated do something active go for a walk. Go to the gym. Just exercise get the body moving read or listen to inaudible learn.", " Something every single day the thing but Audible and reading is you are listening to some of the greatest humans who have ever lived and you're observing some of their failures mistakes and lessons and what that it can help you come to terms with some of your failures and find the lessons in them along with that meditate and have a journal brain dump every single morning get all those negative thoughts out of your head.", " And what that you can make sense for them to also think of things you're grateful for and write them down every single day. This will set you up on a positive note for the day and what that improve your life.", " And then plan your day you can do this first thing in the morning, but I preferred in the evening time. This will save you going to the day on autopilot and we'll give your daily Pursuits a purpose a drive a direction link your daily routine to your long-term goal or vision and then monitor your social media and your earnings an exercise or work out every single day strengthen your body strengthen.", " Your mind so thank you for tuning in. I will be in touch very soon with a new podcast, but for now keep fighting the good fight chat soon."]}