{"showID": "0A2xwMoDNIlwkJGsaFq68I", "show_name": "Everything DFS Sports", "show_description": "All about DFS NFL and how to profit. Rolling out my customized chart after 2 years of preperation. Email me to get into my group mikealby1524@gmail.com  Support this podcast: https://anchor.fm/slabof-meatloaf/support", "episode_name": "Everything DFS Sports", "episode_description": "All about DFS NFL and how to profit. Rolling out my customized chart after 2 years of preperation. Email me to get into my group mikealby1524@gmail.com  Support this podcast: https://anchor.fm/slabof-meatloaf/support", "transcript": ["I want to spend some time to talk to you about anchor anchor is the easiest way to make a podcast anchor gives you everything you need in one place for free. Would you can use right from your phone or computer me personally, I use it on my phone and it works great. It has creation tools that allow you to record and edit your podcast. So it sounds great. They'll also distribute your podcast for you. So it can be heard everywhere including Spotify a podcast Google podcast and many more you can easily make money from your podcast with my", "Minimum listenership download the anchor app or go to Anchor the FM to get started.", " What is going on everybody and welcome to the show man. Did we have a very very interested in Sunday? I haven't had a fantasy weekend like this in quite a long time, especially when we thought that my our charts we're coming together correlating and we were starting to pinpoint all these plays and it was backtracking through the season and the fantasy guys kind of look down on us this weekend and said,", " I got an idea. Let's let's have a veto Smith get a touchdown and then let's get Tremaine Pope a touchdown. Let's get Reich well-armed set a touchdown. Let's get Foster Munroe a touchdown. Let's get miles boy and a touchdown and while we're at it, let's give let's give Trevor Davis like a 60-yard touchdown.", " What was going on? That's so hard to work with. We're your brothers and sisters that don't know anything about football. They're making your free lineups for you just to plug in players are having line was better than yours because the players that you research and you-you-you chart and you project do well. It just didn't happen on Sunday.", " which is fine cause", " it's it's going to bounce back as it is not going to happen again. I've never had a weekend like that since I can remember and what we do best over and over here is that we bounce back and we come back stronger you get back to the ground. We're not going to stop what we're doing. We're not going to change our thought process because it's been working. So we're single right back at it. We have a short memory and we're going to just dive right back into this week, but real quick before we start on the Slate is I just want to call out all you guys we reached over a thousand views.", " So I thank all you guys very much for your continued support. So, please continue to like subscribe five-star if you want to do a couple backflips for me to do anything. But all this stuff is very very appreciated. I can't even believe we're already over a thousand views. It's crazy to even think about because myself and Jake were just doing this for fun. And I mean this is kind of our passion and we do a lot we research and DFS is what we do is our Hobby and with what's going on is", " kind of making me crazy. But with that being said if you're interested at all enjoying my Facebook page is called a DFS shark Hunters its free to join and then once you join from there, I have a premium page. It's only $50 for the entire season and that's where I post my player pools for college football as well as NFL and I also post them lineups every now and again, but we have a lot of activity as far as shopping up slates breaking down plays what you do and don't like so just", " In general, it's foremost first and foremost. It's a really good tool just to help your own research because I give you my customized charts which show how many times each team is going to three x value to each position as well as my flip side is I have a chart that shows how many times a team accumulates 3 x value by position and it breaks that also down by a point totals so you can", " And of gauge of against to be a high medium or low point total and then from there you can see how that team does as far as fantasy relevance in that game point total and that's really nice to correlate with my defensive 3x charcoal. You can see that let's for example TMax gives up three times on a four game so far to the running back position and this gives me low scoring and a low-scoring games the team they're playing has", " Turn back already hit 3 x value three times. So that's gonna be a Lock and Load. So the two charts really really correlate with each other and that's something that's available for you and my premium site. So like I said, if you're interested in at all, it's only $50 she entire season. And once again, it's a DFS shark Hunters on Facebook. Just go on there and then requested join and I'll send you a friend request and we'll we'll get you in there. We just got our new logo today. So you getting our premium page you get done logo. You can start wrapping that.", " Pretty it's pretty sweet. And we actually have a guy that's working on a website for us right now. We're in the future. We're going to be able to have all my articles and charts and all the information up on our website. So we're growing we're very new but we're we have a big picture big picture. So it's going to be exciting to come all come together. And with that all being said though, we're going to jump right into this Sunday. So late starting with Jacksonville going into Carolina and putting the Panthers and I'm not", " Of Jake start this one off talking about what he likes about this Jacksonville side of the ball. Oh, well, the legend of Gardner Minshew it continues. I guess. I mean before we go with that I'm starting to really enjoy these Facebook means we're basically all the Chuck Norris memes and now turning the Gardner Minshew memes. He is the man. I mean, he pulled off that win against Denver out of nowhere. Really I heard that he", " personally tour Riley chubs ACL just by looking at them with all that being said my favorite play probably from this game is going to be Leonard fournette. He's coming off. I believe a 230 yard rushing game against Denver. I think he looks to continue that he's going to stay hot and carry that into this game against Carolina my other Flay I like in this game is DJ chart.", " The Denver secondary. It's a good one. Each Arc du du du du didn't and I mean Denver they their defense came to play last week. They finally got sex. They have leave told five sacks in the game five or six. So I mean there wasn't a lot of opportunities for Gardner Minshew to throw and actually complete a pass. So his his numbers kind of", " we're kind of low last week. I expect a bounce-back game from DJ chart. You only had four receptions for 44 yards in that game though. He did get a touchdown taken back by a stupid holding call that shouldn't even affected the play. So his numbers within the way more inflated if that called I get taken back. I'm definitely looking for DJ charkh to at least double is production from last week. So I like DJ charkh and Leonard fournette out of this game Mike. What do you like?", " on the Carolina side Manuel", " I don't know what the quite to think about this Carolina side of the ball. I will Kyle Allen. He came back to Earth last week. I'm showing with his six fantasy points that a he can have he's not going to be what everyone thought he was going to come in where he was not going to be like that fantasy positive performer. He's not the Savior. Right? Right. He's at Gardner Minshew, but I'll never not say no to playing Christian McCaffrey because that dude is", " He's incredible. He will eat his having him on Sunday. Even if you play Miko Hardman Sammy Watkins all those kuber's that decided and that play you so cashed because you play Christian McCaffrey and probably Austin Eckler and we'll just those two guys. You could have those freaking dingbats and still decide to find the cache line. I know for me and one of my FanDuel lines I had Nico Hardman Sammy Watkins Emma, huh?", " Holmes just terrible, but I still managed to cash because we had some pretty solid gems my Claire pool that were able to bail us out with with the poor performances of mostly the Kansas City Chiefs passing game going to our player pool our player pool took a pretty big hit at receiver. But with that being said on the entire slate with players 4K and above only 10 receivers were fire and we had two of those on our player pool. I don't believe I can.", " Going to look like with ten or eleven receivers and basically they were all cold and then we had to fire ones but it was just so crazy crazy weekend, but guess I want to look to bounce back but going to this Carolina side of the ball. I said I'm not going to ever say no no Christian McCaffrey. So he's always in being play but looking at my chart that I have Jacksonville has been getting torched by the secondary option the number two receiver and Courtland Sutton showed that again last Sunday with to", " touchdowns, but if you really dig deep and see what they do in jail and rameses gone that pasty pasty fenders different both Emmanuel Sanders and Courtland Sutton were fire on Sunday. So you could you could definitely use DJ more and Curtis Samuel and they're both very fairly priced at five thousand two hundred and forty five hundred dollars. So I have no no issues at all playing either one of them. I won't be stacking this this game at all, but I'm looking more as one-offs to for especially for value with the", " More and Samuel to get these higher price guys in because once we get into more of this late, you'll see the hot dog the high price guys that were really highlighting and DJ more and Curtis and they're going to help get into a be able to afford those plays but just in general this game comprising a stick with awesome Leonard fournette some baby charkh, and then maybe DJ more and Curtis handle sprinkled in but leaning more towards Curtis handle is because it seems like Jacksonville. Well, then again, it seems like Jacksonville's taken up in the motors here because", " Callen Sam or Jalen Ramsey, but now since he's gone. It's kind of a the floodgates of open and DJ more is a better receiver over Curtis Samuel and you're you're only getting a seminar dog difference. So kind of makes me interested in playing DJ more just because I said he gets more targets and you just a better overall receiver. So you could see him you could see him arrive at that price point he will he only needs 15 and a half points at Value. So he just needs a solid receiving game with five or six catches and", " You can set for you will jump to the next game though. We're going to have Arizona Cardinals going into Cincinnati to play The Bangles. Hey, Jay, couple you start this one off. Oh boy. Well, I think I was a week early on my Arizona stack. I've you and me both. I definitely thought they were gonna hire going to keep that game close. Larry Fitzgerald gets 10 12 targets game Cristian Kirk of same way and they're leading Target receiver was", " I believe it was David Johnson and sits and Kirk were lucky to get five perception or five targets David Johnson got 11 and I believe fits Gap. I've just a crazy crazy today. It was a it was weird. I mean they just they look to go to David Johnson, which brings me to my next point. I love David Johnson, I think obviously, like I said, I think this is going to be a team stack that I'm going to have.", " Just because when we saw it last night on how Pittsburgh handled Cincinnati, I think Arizona could definitely do the same thing. So I think they're going to run away with it early and then just try to establish David Johnson running the wall a strong start to the season wore on the ball. Yeah, he is he is not head over first week. He had 82 yards. But since then he hasn't had over 40. So I mean, I think they're going to look to establish him in the Run game.", " That they're going to throw the ball 60 times. Yeah, that brings me to my next Point. Actually. I love Kyler Murray at 6-3. His visit passing attempts were down. I believe it was like 15. He had 15 less passing of times last game than he has in any other game. I'm throwing them out there. I love him this week. Then we call Kyler Murray for his first rushing touchdown last week. I think we did. That's one thing we got right at least wow.", " Yeah, so I'm going to go out with a full-on team stack with Kyler David Johnson Larry Fitzgerald and it's actually going to be either Larry Fitzgerald or Cristian Kirk depends on if Cristian Kirk is able to play it's looking like he could miss some time. So be be weary of that if he misses time, Larry Fitzgerald should get 18 targets. He should easily just beat and he said he's because prices", " Creeping up. So 6K and if he has a good game on Sunday, he's gonna be tougher to play because if I get that six-three six-four six-five K range where you gotta fight for it. He had to get 20 points to hit value, right? He can do that consistently, right? Because right now he's at 18 points to hit value. And essentially if you're not going to touch down he needs 10 receptions for you know, like his 80 90 yards his normal which isn't out of the question, right?", " That's he's done it plenty of times. But once he creeps up more towards i-765 rain, she needs a touchdown basically hit value on top of getting his 80 yards receiving but with that all being said pretty straightforward and like we were talking about before you need a short short memory. Arizona is in a good spot. They played like garbage on Sunday, but they aren't a good spot and they're ready to bounce back. So don't be afraid to play them before the Cincinnati side of the ball. I have no", " I don't want to play any of them. They their offensive line run blocking pass blocking has been atrocious and they really showed it yesterday Monday night against the Steelers get nine sacks Andy Dalton had two picks that he threw that got dropped just they just look terrible. And then John Ross he's gonna be out for at least two weeks. So if you really want to go dumpster diving Todd and Tate is 3/5, which is actually a pretty good price for his", " For his are what he's getting four targets the last two games. He had 10 targets then one night. He got six targets and with John Ross out. He's obviously gonna that's gonna inflate a little bit and I35. I don't mind that play at all. But as far as Joe mix until he gets a whole new offensive line. I don't want to play him. I don't want to play mixer. I don't want to play Boyd. I don't want to play any Dalton if I go anywhere.", " We're here. It's going to be dumpster diving fraud and Kate to be able to fit in some higher price guys that we'll be talking about later in this late. So this distance nice eyeballs pretty atrocious, which is why we want to Stack Arizona Jake next game we're talking about is going to be this would be interesting is to be Atlanta going at the Houston to play a Texans to Great offenses that are struggling mightily. Well. I'm actually going to let Mike just talked about this whole game. Oh boy.", " He seems to be super high in this game. For some reason the let me just take a drink of this this Captain right now actually drown. I mean time he seems to think that this could be a sneaky gamesack actually, so I'll let you I love to talk about this one. So my theory is like I just said both offenses are great.", " Atlanta's defense has not been good. They've been getting forged in the passing game especially and then Houston's obviously been successful susceptible of it. But Houston also their defense plays to the pace of the other team's offense or I should say their offense with their offenses going touchdowns. They're going to be on the field more and with that lamb has being able to also answer that quick obviously with Julio and Calvin Ridley and all them guys. This could very well be a", " Shootout however, I don't want any part of either of these teams as one-offs. I would rather just if I'm going to play someone going to play it as a team stack or play as a game stack because this game has the potential to either just be a shootout or you have to struggling teams just struggling against each other and they just this is up going to be just a fun fast and it'll be like a 22:17 game. So is this one of those fine lines that it could just", " Blow up or is this going to be this atrocious? So that's why I said if you want any any part of this game, make sure you just like to stack make sure you stack it. Make sure you game stack it.", " Because I don't feel comfortable taking a struggling Calvin Ridley struggling this all these guys are struggling and I mean, he got even got DeAndre Hopkins throwing interceptions last Sunday. Like there's nothing going right for either team right now the one-play though that I really thought hard about for a core play, but then I thought about it again and said this I just don't trust the struggling offenses as will Fuller only four five, especially if Kenny Stills doesn't play", " Just because I'm kind of secondary is not good. But then against good defense for Houston to get back on track to clean at home so that you could really this can be hit or miss game. I'm going to have some on my have a game stack of this just in case it does go off but it's very very risky just because of how how poorly these officers have been playing anything to add Jake. I'm actually gonna", " I'm gonna go out and say if you do want a one-off, I think it's got to be there Hopkins or Julio. Other than that, I wouldn't have anyone offset or cheap like Freeman Ridley Fuller or even Hooper who's been having some pretty good games at least DraftKings has their price is right. They're not all expensive like DraftKings is making their prices seat know that it's because they've been struggling but if you really look at Hopkins and Julio You Don't See Stars like", " That just being slumps their teams. Usually try to do what they can to get them back on track and DeAndre Hopkins has been god-awful last three weeks and Julio.", " Julio's first bad week was last week basically, so it is a bounce-back spot in general. Like if you want to go there to stack it up. So Jake have you talked about the Tampa Bay Buccaneers going into New Orleans to play Teddy B and the Saints. Alrighty well,", " Who would have thought that Tampa Bay has a running game this year?", " I mean Ronald Jones and Peyton Barber. I lookin good Ronald Jones. I believe is averaging like four and a half four point. Seven yards per carry. I'm gonna give him the ball consistently and Peyton Barbers even are urging three-and-a-half. I believe yards per carry. They've both been looking great. They're both priced down for what they've been doing. Really, I believe they've both been getting pretty close to a hundred yards pretty consistently each now with that being said,", " Plane either one of them the same don't give up three three X's value two running backs. So I'm staying away from them. Now this game. I mean, it's two explosive offenses. I think both wide receivers on Tampa could eat especially if Jamis decides to come out like he did against the Rams and just", " toss dimes to Godwin all game. I mean Godwin had a career game last week. He had what he have 172 yards and two touchdowns. I'm 12 receptions 14 targets. I mean dude was Unstoppable so man, don't let me started that whole he's gonna be doubtful and probably not playing on Sunday because he didn't start practicing till Friday. He practices limit Lee Bruce Arians is did not want to tell", " One what was going on with them and then shortly after the enact is were announced on Sunday. It just says Chris Godwin's actives, you know as us as DFS players like all he's late active. Is he gonna be on a snap count? He's hasn't been basically has a practice all week. They're playing the Rams who have been a pretty decent defense, especially in the passing game of the season. I'm just not going to play Chris Godwin. Oops Ike I'm gonna get 4301 you unbelievable.", " Oh.", " The other thing is Cameron braid is I Believe been getting about the same but he also got to touch targets. And yeah, he got touchdown. He's getting where is he Cameron breit has only 3K he is getting he got three targets last week. Whereas OJ Howard dogs. You should be free. He also got three targets last week. DraftKings should actually give you more money to play. Okay, how are ya no kidding.", " As you money, especially if you are higher than season long he decided to take them where he was going as a basically a tear to tight end and he is just worthless and especially enough offense that has been doing pretty decent. He's just sleeping. Now with that being said about the only only place I can trust is wide receivers for Tampa Bay and they are only two hundred dollars difference. I like both of them this week Mike Evans at seven one and", " Godwin at six nine", " Play one of the other that's for sure but on the New Orleans side of the ball. What I've noticed is Teddy Bridgewater likes to run a slower slower offense to basically just slow the tempo of the game because he's not one that's going to go out there and be Drew Brees and sling the ball 30 40 yards down the field using to be Smarties and take high high percentage throws. He's going to use Kamara a ton out of the backfield other certainly gives you the KB of memory a little bit.", " Or just doing safe plays and what's more safer than Michael Thomas? He's one of the great the best receiver in the NFL. He's got one of the best hands basically behind DeAndre Hopkins and what's his price and he is only six thousand six hundred dollars what against Tampa Bay's defense who remind you Robert Woods torch them last week who perk up porch them last week. They're playing in New Orleans and Michael Thomas is priced down here.", " He's 18 points to hit value. And that's what his average is on the season. He even got that last week against Dallas Cowboys in the 10 to 12 game. Now, I think that they're going to be more scoring than 10 to 12 against the Buccaneers and that's going to probably go right into Michael Thomas Ted. Ginn is basically just been not exist in this offense with Teddy Bridgewater. He doesn't look at him like Drew Brees did Jared Cook starting to see a little bit of targets, but he's still kind of out of the picture. So it's pretty much uh, Alvin Kamara Michael.", " I'ma show on offense and they have Michael Thomas price down at home against the Tampa Bay Buccaneers. I'm just about ready to Lock and Load him in every single line up. He's just in a great spot and because Teddy Bridgewater just throws high percentage passes, he and he looks his whale out you're seeing the see Michael Thomas PPR you to death. He's not going to get you a hundred forty hundred fifty yards away with Drew Brees recent get you nine ten catches for a hundred yards. And that's all you need from it that price and he obviously", " He has the upside of breaking the long touchdown. This is just receiving he if they find their way into the Red Zone that's going to be the Red Zone threat one touchdown is going to make it if Michael Thomas is one touchdown on Sunday. He is going to smash value because that's one touchdown. Obviously. This is saying it's a 20-yard touchdown you're sitting at nine points. He needs 18 points solo hit value. You got half of that on one touchdown half of that Michael Thomas.", " As such a high ceiling this weekend and he and he also got high floor at his price. So I love the idea of what Michael Thomas and every single line up Jake anything on this this New Orleans side of the body working on the next game. Well, that's just go under the next game. Alright, so next game is going to be the Minnesota Vikings and they're gonna be going to Danny dimes and the New York Giants Jake. What do you think about this? Oh boy. I'm", " I mean Minnesota's been a dumpster fire on offense other than Kirk Cousins has been a dumpster fire and off and so I put that on feeling what about digs? Hey, you got a big game on Sunday and one big game. What about the rest when Kirk Cousins? Yeah that 84 million dollar contracts really? It's in his pocket. It's in his pocket about the only positive note on the Minnesota side of the balls and Elvis cook now.", " their coach and Adam thielen both called out Kirk Cousins this week saying that he needs to throw the ball more and he's the air it out and key were was that he needs to throw the ball down the field, you know, and", " What are the Giants give up they get torched by quarter bags get torched by quarterbacks. Now, if you're in my premium page, you'll see exactly how many times the Giants have given 3 x value to the quarterback. How many times the number one receiver and we're number two receiver the tight end and the running back give up 3 x value.", " And that's why you need to get in the page. So I'm calling out a big offense of showing from the Vikings and Kirk Cousins Kirk Cousins at 5 3 is going to smash value. I think Adam thielen and Stefon Diggs it both. I mean feelings not really price townies. He stayed about the same. But Stefon Diggs is is priced pretty is he's pretty far down. He's six to I mean I see them.", " Both having big games and then Dalvin cook. I mean, he's just gonna he's gonna get his he's gonna eat. I love this Minnesota game stag or team stack. I should say Mike. What do you think about the giant side of all know? It's all about how you think the game close on the go one thing. I want to point out about Kirk Cousins. If you really look at them. Look at his history Kirk Cousins does not play well in playoffs. He does not play well against good teams because", " Well against other good quarterbacks, he destroys bad teams and bad quarterbacks. I'm not saying Danny dimes is a bad quarterback, but I'm saying the Giants are not a good team. The defense is not good. And what better time for what better team for a Kirk Cousins to go up against after he's getting all this I hate from his own players that he doesn't throw the ball down the field. He's not aggressive enough basically just handed up and cook and that's about it. This is gonna be great.", " Especially a 5-2. I mean that stuff this is such a low risk. All he needs is one long touchdown. He's going to be gold using to be a he's a good cash play for you. I'll cash game players, but I'm a giant side. So like I was saying about game Flow if you believe that Kirk Cousins and going on there and just swing the ball or in a score and if you swing the ball, they're probably score and pretty quick, which means that the Giants are beyond the field quite a bit there have a few extra possessions.", " Golden Tate comes back this week. I believe right Jake. Yep. Golden State's back. He is four six four six. He is one of the best receivers in the NFL with yards after the catch. He is there he's he's known for taking the screen pass and just running with it and he's going to run forever. So he's a great plant for 6. If you're looking on this giant side of the ball Sterling Shepherd has yet to crack 6K and he's been playing great Evan engram. He hasn't kissed.", " XK yet. He's been playing great and then obviously when gulman he had a fantastic showing against it for defense in the Redskins. I don't like his I don't like him at all this week against a Minnesota. This was a pretty decent run run Isis too high for us now, right? That's who he's 5 for he needs basically 16 points ahead value. I'm going to let everyone else chases game on that he had and I'm just going to attack.", " Giants receiving Corps, but I don't think I'm going to go there too often. I'm molding mostly going to focus my attention on the Vikings offensive side of the ball because the Vikings do have a pretty solid defense. So I don't see the Giants being able to answer back. I think it's going to be a game or Kirk Cousins just called everybody out and he shows that he can still throw and I'm feeling should get a touchdown. I think it's been am feeling game or using a force feeding the ball because I don't know why.", " He hasn't especially if you had them in fantasy and Sunday, especially in season long one and a half points. It's just going to bounce back game for this, uh receiving Corps for the Vikings in general. There's not very many of them to feed Stefon Diggs and I'm feeling you don't have to play Russian Roulette. Just pick one and go so with that being said Jake next game. We're at the Chicago Bears going to Oakland. What do you think about this? Oh, well, this game is actually going to be played overseas is going to be in London. Yeah. It's", " in London now", " That's intriguing because I don't know if you guys remember but Ellen Robinson played for the Jacksonville Jaguars. And what did what did they like to do in London? They tore it up in London. Now whether that was just Blake Bortles playing well or was it was a little bit to do with Allen Robinson? I don't know but Alan Robinson Street intriguing at five six. I think I mean", " He smashes in London. I very well could smash against Oakland in London again, I like that but they got a better quarterback in Chicago right now. They sure do the other thing. That's kind of intriguing about this game is Cleo Mac going up against his former team first time since since he got traded so I think he looks to dominate so Gruden that it was he", " is wrong to get rid of him. So I think this game is going to be controlled majority of Levi Chicago. So that means David Montgomery. I think he's gonna have a Breakout game this week. Other than that, I'm all these Bears players are super cheap. Yeah, they're real cheap. But I mean, I'm only really looking at Robinson Montgomery, maybe a little Cohen Chase Daniels actually looked past a Cohen and get them out and open space unlike to Biscay. So that's actually an intriguing play at", " Or eight. Other than that, I mean not much to look at it Chicago side of the ball kind of upset that this London game isn't played it. Usually 8:30 in the morning. He usually is playing the same time as everything else. I like waking up in the morning watching the first game of football and then jumping in the noon to noon game. So it's kind of a kind of sucks that it's not at the normal early time. But anyway, Oakland side of the ball, I only like Darren Waller he is still way too cheap.", " Keep the amount of volume. He gets he's basic. He's our number-one receiver. He gets he gets force-fed targets. He got 14 targets eight targets eight targets seven targets, I mean", " If i k i mean, I have no problems at all playing during Waller, but I won't touch this opens have the ball in general because I actually like playing the Bears defense a lot come Sunday because they're only 3 8. Yeah. Oh Grand all hit a two-run bomb. Go Brewers go Brewers. I got him and DK. All right anyway.", " Next game New York Jets going to go into Philadelphia to play the Eagles Jake. What do you think about this? Well, this is very unfortunate. I mean, we just saw what Aaron Rodgers did against the Eagles secondary. We've seen what the eagle secondaries just atrocious this year and for another one went down on Sunday, unfortunately.", " We don't have a good offense or a good quarterback unless I mean Sam Donald is questionable for the game, but I don't think it's likely he's going to play this week know what I stress a lot of the guys in my group is you can correlate with a chart you'll see that the Eagles have given up three x value three out of four games two quarterbacks only play good players and good in those good matchups because it's likely that a good player is a reason why they got charted.", " 3 x value against the against quarterback positions do not go in and say oh who's the in the Jets quarterback all that's a good question. Jesus it all boy. It is Luke Falk. Why in the world? Would you even think about playing LeapFrog? I don't even the Eagles could give up three x value every single game against quarterbacks. I am dating the Jets side of the ball. Absolutely. I won't fade Le'Veon Bell.", " Though because he does have this his price is M7 K 6 8 and he could easily catch 10 passes and get 15 carries. He could literally be the entire offense and he's already basically done that this season and a game which game was X. I know we had one he played I believe it was Cleveland. Yeah, it was Cleveland. Yeah, he caught 10 balls and he ran the ball 21 times. So he touched the ball 31 times and against it even worse deepest the Eagles.", " I can see Le'Veon Bell basically replicating that and at six eight he's gonna heal Hood value. That's about awesome hit value in this Jets offense because Luke box our quarterback equal sign the ball Jake you want to talk about it or go meet you you can go with it. Oh boy. So well first first off their author, they're playing the Jets. So", " that means their offices in pie have good field position for a decent majority of the game.", " Zach Earth is only 6,000. He's has not had a Jacker it's game yet. The season kind of appointed for me. Especially see some longwise.", " Nelson Aguilar, I'm not going to play him the rest of the season Al sham Jeffries back to Sean talking about the back you saw him that agalloch give you as many points as you and I both did put together. It's less less game against the Packers, but I'm just going to focus with Alshon Jeffery Zach ertz. Keep an eye on DeSean Jackson's If he if he is ready to go. I mean, he's a 60-yard touchdown. Just waiting to happen. He's five nine though. He's priced up. So I'm", " I have to I don't think I'll go that way but I'm gonna I'm definitely gonna keep my eye on else on Jeffrey and Zach Earth's. I still don't want to play the running back here cell because Jordan Howard's is the goal line running back miles Sanders. I'm not quite sure what they're doing with him because while Sanders is the bed running back, but they're still trying to just run the ball Jordan Howell, because they pay them so I'm not going to touch that backfield souce games is kind of be pretty sloppy.", " Maybe even I don't even want to look the Eagles defense because next thing you know is you play the Eagles defense of Luke Falk decides that he's going to show you why the Eagles secondary is garbage, but I could see why you would want to play the Eagles because it's Luke Falk in the Jets and they're playing in Philadelphia as well. But just overall just a sloppy game. This is going to be a lady on bail show and Carson, which is probably gonna spread the ball out pretty evenly and try to get get Earth's and I'll shine back.", " In that going and I can even see them maybe trying to get my old Sanders some more touches and getting him which is more repetitions Jake while we're next game where I talk about is in be Baltimore Ravens Lamar Jackson going into Pittsburgh to play the Steelers. What do you think about this one Jake? Well, I'm actually going to let you talk about Baltimore side of the ball. Oh boy, that's got done talking. Yeah. Let me get a quick drink of this. Go ahead. Holy cow.", " So this Pittsburgh defense in general is very very interesting because you don't know which one's going to show up. You can have nine sacks against one of the worst lines and football or you can go play the San Francisco 49ers and get five turnovers in the first quarter or you can just write the play defense in the skin pregame blasted one thing that's", " but I do like on the", " The Baltimore said the ball is Lamar Jackson. Unfortunately, he's the highest price quarterback in the Slate but with his Russian nobility and Pittsburgh's lack of secondary, obviously his bowl set up a little bit more with Mika Fitzpatrick. I think Lamar Jackson still has a pretty decent game with this price point though. I don't know if it was claimed as much but he proves a show that he is also I mean, he's Metro proof because of his Russian nobility.", " Other than that, I do really like Mark Ingram against Pittsburgh. They have given up quite a bit on the ground. Obviously not against this Maddie. I'm a truck down up to their terrible offensive line, but they give over a hundred yards this the Seahawks combined with the shot Penny and Chris Carson, and I know that you have more food goes to go to play San Francisco. They have over a hundred yards to their running back Trio and with with Baltimore. It's", " The marketing I'm showing it comes to rushing. I mean he gets about 15 to 17 Russia's a game and he kept the ball in the backfield and with Lamar Jackson playing quarterback. They can't just play the run because we'd have tools available to bootlegs available and Lamar Jackson can run for just as long as Mark Ingram can which helped Mark Ingram tremendous tremendous tremendously. So I like marking him a lot playing in Pittsburgh.", " And Marquis Brown he is in he is do is first two weeks were great. 33 points 16 points last two were knackers six points eat game. So he is he's due to have a bounce-back game at 5 7. I doubt I'll go there just because he has not been good, but I will go back to the well again with with Mark Andrews at $4,800. He's still getting more targets. He's getting more targets and Marquis Brown.", " Yeah, eight more last week. It seems like his foot is fully healthy. Now. He's not even doing practically this week. So I'll fire Mark Andrews up against the Steelers. So I'm looking more towards the Lamar Jackson Mark Ingram and Mark Andrews stack Jake what you think about those Pittsburgh side of the ball? Oh boy. Well, I love Pittsburgh after what they want me last night. Yeah. What do you want last night Jake? I won seven hundred fifty dollars on The Primetime sleep because of Pittsburgh. How much did you spend to get that?", " $12. I mean we're with a players to the player pool. They were they were players on the player pool it was", " It was quite it was quite fun to watch. I mean my heart was pounding through the whole second half. It's a good makeup from Sunday's shitshow sure was well leading into this game.", " I'm actually not going to be playing Juju. I mean his price is low at six for but Baltimore doesn't give it up to the wide receiver one which leads me into my favorite play in Pittsburgh. Deante Johnson at 4-4. He's actually the one that won me money last last night. He's one of my favorite plays in Baltimore actually gives it up. I believe that given it up two or three times to the number two, and he's definitely showing these", " He's he's getting the targets over James Washington. So he's the clear number two. They're real quick though Jake if he didn't lose that fumble with you made more money. I probably would have been up another $250. Well, that's besides the point. I don't want to talk about what I could have one. Yeah, it's unfortunate if I played the Steelers defense. I wouldn't 3K that's besides the point. Who cares. I still profited sure now James Conner he", " He had his coming out party which we called with we did call I mean has used his usage was through the roof when Daddy gets boned by running back. Unfortunately, so was Jalen Samuels usage. I mean, they both I believe had 10 rushes and eight catches seem like James jail and cymbals playing quarterback more than Mason Rudolph was he they were playing Wildcat like at least five. That's six play those crazy Jalen Samuels.", " He knocked me down like a thousand dollars or so. That was that was unfortunate. But anyways, I'm loving I'm loving deante Johnson and I mean that's probably about it. I like the Baltimore side of the defense. So I don't think that James Conner specially nursing I believe that was a hamstring injury. Yeah. This is looking at that if if you see that James Connors out kill someone you like $4,100. I think it's a lock.", " And load because jail and Samuels is very very the he gets used a lot in the passing game so they could stop them in the run. But the way the Jalen sample is used the passing game. He'll make value at for one. So keep a very close eye on that James Conner if he can't go Lock and Load healing Samuels next game Baltimore Not Baltimore buffalo. Buffalo buffalo and the concussed Josh Allen going into Tennessee the play the Titans.", " Jake and are you want our the Buffalo side of the ball? Well, Buffalo has one of my favorite plays in the Slate if Josh Allen clears concussion protocol and that is colle Beasley at 4600 dollars now full Beasley is he he's just coming off with 13 Target game with 10 Target game. I mean, he's this dude has in the last three games. He hasn't scored Under 12 points in the first game was nine points who would have thought", " Colby's lie, I mean who would have thought he'd be performing after what he did last year the safety blanket. Yeah, he is definitely the safety blanket. I mean, they don't really have a tight end anymore. They haven't had one for if I got that knocks fellow that yeah, who's well, I mean, he's getting probably I think for targets a game. He's pretty cheap to at three abilities three thousand three one one. He's such a kind of interesting.", " He's not getting the targets that you want and just catching tight and what he's definitely catching all the targets. He's I think he has to get a touchdown really they look at him in the Red Zone though. So who knows they had to get their against this tough Tennessee defense now speaking of the tough Tennessee defense, I think this game actually plays into Tennessee's hands. This is going to be a slower game. Both teams have good defense has because it's going to be a low blow.", " Point total it's what Tennessee's used to be used to play in and so I don't see a lot of scoring in this game. I really only like Cole Beasley on the Buffalo side of the ball Mike. What do you like about, Tennessee?", " I know this is a stretch but Tennessee in Buffalo both play Slow. They both have good defense has their camera shows Out and low-scoring slugfest because of obviously if you've seen him he is the size of a fridge and he runs pretty fast and now apparently starting to catch passes of the backfield and at $6,000 you could see a high usage rate out of Derrick Henry and this low scoring game and", " This is do is just crack one seam and he's gone because he's shown that a few times where people still stack a box on him and they'll hit the wrong. They'll hit the wrong hole and he's Off to the Races same thing a couple weeks ago. We hit that 70 yard touchdown pass just a little swing pass out of the backfield that there he goes. So this this game is going to play into Derek Henry's favor Derrick Henry is not as good and higher scoring games. So", " I'm all for playing Derek Henry if this game if you believe it to be low scoring which I do so I might look a little bit closely with Derrick Henry because I said this game is going to play into his script anything for you Jake on this or no, no not really will go to this Russian roulette game is going to be the New England Patriots against Washington plan in Washington and I'll go ahead and I'll just start with New England side of the ball. So washing absolutely gives it up to the quarterback.", " How Brady could throw six touchdowns Tom Brady could also hand the ball off six times for six touchdowns to of the Bolden one does Sonja Michelle one to him a you just do not know what this New England offense is going to do. So is really Russian Roulette trying to pick these players. So when I look at New England players to pick I'm going to look at the cheaper plays because they don't need as much to hit value. I don't really want to play Julian Edelman is because he needs 19 points hit.", " You which means that they're have to force you in the ball, which means against impiously be competitive because I don't think it's going to happen when they run away with it and they're going to play clock management. So I'm going to look more towards the more towards words You Phillip Dorsett it for nine. He's getting almost ten targets a game. All you need to do is just connect on one.", " As well as James White. I mean you just look at that price range just a for 4K range to 5 km range for the Patriots. Obviously if you want to have a Tom Brady stack with Josh Gordon, Julian Edelman, they all couple knots but I decide rather play a safe Play Just Because the pictures are so unpredictable and so on to Michelle could open up the game with touchdown on the opening drive and finish the game was seven rushes like he's already done. So this is so hard. It's just", " Tell what the Patriot should do, they've played so many bad teams already this season. You think that you would know what they're going to do, but the decided to show you different every single week Jake any other that are you want to talk to the Washington side. I'll talk about the Washington side. And actually I only like one play on this Washington side of the ball. And that is Chris Thompson. I think he's a super super safe played because they they got to be able to complete a past somehow.", " And if you were watching any of the game last week their quarterbacks Keenum and Haskins, they couldn't complete a pass to save their life. They were missing wide open receivers with no pressure on them. What do you think they're going to do with pressure in their face from the New England defense? I don't like any of the receivers. I only like Chris Thompson at for six. I feel like Chris Thompson is coming just like go to play this entire season because he's never gotten under 10 points at all. And this price never goes us.", " Not exactly and he is Adrian Peterson. Once again, it's not going to be a run game. Eric Thames had a bomb. Yep. Ho boy. Let's go Brewers. Max Scherzer is looking like he is gonna wobble.", " Heat up and it's not going to be us. That's Justin Verlander. Whoops. Oh man anyway about Chris Thompson. So if you follow them last game, he was very pretty quiet through the first half of the game in the third quarter. He was hovering around like five six fantasy points, but once again got out of hand, he started getting targeted all the backfield consistently to bring them over 10 points.", " They're playing the Patriots the games. We get a hand early. It's going to be the exact same situation. So I have no problems at all playing Chris Thompson only $4,600 Jacob. We talk about the next game quick. All right. Well we're going in we're going to Denver at the Chargers. Now this game is it's going to be interesting on the charger side of the ball with Melvin Gordon Bean back and I believe he's expecting.", " The play is and there. He said he's expected to start so that pumps down off the neck where I think he is a complete fate at six seven. I think that's way too pricey for for a guy. That's not going to be starting running back. No as we already know Denver has a good secondary. So it could Chris Harris should be keyed in on Keenan Allen who", " Who had a pretty horrible game against the Dolphins? He was our corporate. He was one of our core plays and he burned us. I'm actually not going back to him this week. What I'm gonna do with this Chargers offense is I'm going to let it sit. I'm going to look back on it Monday and see how they use Melvin Gordon how they use awesome Eckler how they use Keenan Allen because you just don't know for one how much how long is mum going into play? How many times do we get and are they going to use awesome that", " As more of a receiver because they really don't have a number two receiver. They'll ask you that Dontre Dontrelle and men who left the game with an injury. He had a pretty decent game cute, but now he's hurt. So you still know how the charges defense are charges offense is gonna run. So I'm just going to just stay the entire offense wait and see how they play. I'd rather take a shot at something. I know and I can track especially at their prices. I mean you gotta $7,300 Keenan Allen a $7,000 Melvin Gordon.", " X7 Austin Eckler, I'd rather spend that money elsewhere that I have a better better gauge of what I'm getting out of. Yeah. This is definitely a wait-and-see with the charges off and I don't like it much I'm probably fading. What do you think about Denver? So the Denver side of the ball, they're sneaky and offense for value-wise for one because the entire offense still space at least it's under 5K, which puts them all in play, too.", " The number two the two receivers are basically they're only receivers that basically get 10 targets the game Who both were fire on Sunday. It kind of sucks that Phillip Lindsay and Royce Freeman split all the work basically right in half. So you can't really you can't really gauge that and can't key in on right back on that under this unless you're playing a team that gives it a throwing bags like we did against the Packers you play pillow clumsy, what word which are work out perfectly because we look Lindsay is the better back.", " But against the Chargers are not that bad against the run, so I'm going to fade the Run game.", " Emmanuel Sanders is valid in Drew right now. He's going to play but who knows if he's going to play just basically just be out there to give Courtland Sutton a better Advantage because he's going to take cake because Emmanuel Sanders would be out there which would mean Casey Hayward is on him which means Courtland Sutton who has been the better receiver. This season is going to be in a more favorable matchup and obviously healthier. I actually really really love Portland.", " This week one of our favorite plays this week. He's under $5,000 it gets what's his Target looking like now Joe Flacco like some a lot he's got", " Targets targets nine seven seven eight and nine seven seven and eight and you're getting mad at $4,500 sign me up. Yes, please. I'll take that divisional game division games played different as the Steelers and their nine sacks last night. So like I said Portland Sons his look like a better receiver. He got to touch on those Sunday the often seems to flock towards him. So sign me up for some Cortland, son.", " In this weekend, especially to be able to fit in these high prices people like we're about to talk to talk about right now in this Green Bay Packers going to Dallas the play the Cowboys now, I'll start off and I'll talk about the cause of the Packer side of the box and I'll Jake I'll let you talk about the Cowboys side, but for the Packers, they have not look that great the season especially on more towards the offensive side of the ball. Aaron Rodgers has been slower. They have glimpses they play good quarter, but can't play a good half.", " The game you can't finish out. They can't close out the game or nothing and it's going to be even worse because the Monte Adams is not going to play which is going to bump up and be a strong animal Alison and that's kind of scary to think about because they have basically not done much to season Jimmy Graham. He's cuz you just gonna just gonna go up so I don't mind playing Jimmy Graham at all and he is only $4,300. He was used heavily last game and the coaching staff Mike LaFleur even said that", " That we're gonna look to get Jimmy Graham more Targets in the passing game and they forced on the ball. Basically last game and what Davante Adams out that's 10 to 14 targets. It's got to go somewhere. Jamaal Williams is going to play. So there's you're not going to be able to hand the ball off as much because it seems like there's trying to cap Aaron Jones that is 10 to 14 carries because they using the pass game. So I think it's going to be a", " It's going to be interesting. I'm not quite sure how to how to digest this pack or side how they're going to play but mvs and Allison and Jimmy Graham should all get tons of targets. I don't know if they're going to catch them. But Aaron Rodgers that he should be Packers. I really only like Jimmy.", " Graham like you said is usage is going to be through the roof and those targets have to go somewhere from Adams. So I like Jimmy Graham A lot it always stays this because you know the pack of the Cowboys are gonna score because we love Zeke Elliot which means the Packers have to answer if the Packers answers to me through the air and the receivers aren't that expensive their highest price one is Valdez scaling at five six trembles at 5K. They really do have a number three receiver then just Jimmy Graham.", " Well, let's talk about the Dallas side a little bit.", " Zeke is I think going to be in the corp corp Lahey, we're streaming and running backs against Green Bay. So weird oven Cooks Jordan and Howard Philip Lindsay. Let's sign me up for Zeke Marty Cooper. I'm not touching him. He should get a lot of dry air Alexander who I believe has a completion percentage of 40% when targeted. I mean dudes a do the solid Corner. He's having a breakout year.", " He's I am not going to touch Cooper the one-play that's intriguing is Randall Cobb going up against his former team. The only thing that would make this better if there's a his it was in Green Bay now, I mean, there's really nothing back in this up. I mean, he's I guess he had six targets last week for six and five targets weeks prior to that but", " I don't know. It's a gut feeling but I think Randall Cobb. I think they're gonna make a point to have him score against us just a just a thank us for letting them go and let him go to Dallas. I mean if you really want to think deeper about this game script is obviously we know what half the Dez Bryant catch with the Packers against the Cowboys in their home playoff game, which is the first home playoff game and basically forever.", " and now the Packers are the Cowboys have", " Randall Cobb they're going to their favorite in this game to win. They should win. They should control the ball. The entire game of should have plenty of trips into the Red Zone. I think that that they game script real cop to get one touched on this game and with Randall Cobb price at for to only for to that one touch on is all you need from them, and he already gets floor of five targets a game.", " I don't mind at all plan Randall Cobb. It's a cheap play he lets these four to gets five targets a game playing his old team averages nine points a game. I mean, it's pretty close to what he needs to hit value so that run that run games and opened the past will tell you that right now and that means that the line back to be cheating in rental car place in the slot which means the middle of the field is going to have holes for rental cops getting into so watch for Randall Cobb if you got up one giant tournament flyer.", " You want to play Randall Cobb all the way or than that? I don't watch much about this game isn't easy can go sure is that's all the games. So, I mean given the and Dad Jake I sure don't know just continue to like subscribe our Channel go on Facebook DFS shark Hunters, give us an ad and we'll get you in there. And then if like I said, if you're interested all my premium, my premium page is 50 bucks the entire season for", " Football NFL my customized charts player pools lineups you name it myself and Jake are very reachable to ask questions and continue continue to hit us up with questions about your lines your season-long daily, whatever. We're happy to help. Yeah, we're even getting questions right now about seasonal talk about what what the theme of the trades you should pick up drop who they should start. So we kind of do everything I said for 50 bucks to buy 50 bucks by 17 weeks. It's", " Basically, you're basically paying but nickels and the dimes to just get more information and for you guys that are already pretty decent at the fs. It just makes you better just another chart more information going to help you. So I encourage you to give give my pay to try and we also do NBA coming up here pretty soon. So keep an eye out for that as well. As I said our new website should be rolling out here pretty quick so nice.", " To keep an eye on well that until next week. Good luck this weekend. Bye. Bye."]}