{"showID": "0a4HRdmYYB4jQrc0bGGPkS", "show_name": "AAA Pass: A Nation of Billions Podcast", "show_description": "Hosted by Sunjay Kohli, AAA Pass is A Nation of Billions podcast taking you behind the scenes and stages of some of your favourite and most exciting artists. They don’t just give an AAA pass to anyone, but when we get Access All Areas, you get Access All Areas.", "episode_name": "AAA Pass: A Nation of Billions Podcast", "episode_description": "Hosted by Sunjay Kohli, AAA Pass is A Nation of Billions podcast taking you behind the scenes and stages of some of your favourite and most exciting artists. They don’t just give an AAA pass to anyone, but when we get Access All Areas, you get Access All Areas.", "transcript": ["Right, let's talk about light. Yeah that obviously that made so much noise for you. Yeah, man, he caught everyone's attention and then I was even more impressed when I saw that you had produced it as well. Yeah. Did you know what you were making? No, do you know what so we had Anthony Hamilton sample that one of my favorite songs that is and same thing. I was just like I didn't know. How did you clear that? So,", " Stevie", " Recorded at Kiki Studios, you're listening to AAA pass and nations are billions podcast taking you behind the scenes and stages into the minds of some of your favorite artists. I'm your host Sunjai Koli.", " In this episode, I'm joined by Jaws after his song Glide here are ways and are pods early last year. His career climb has begun to shift gears. The Croydon born singer songwriter is now truly on the rise with so much to give you wanted to explore his motivations. And what makes in life without further Ado. Let's go access all areas towards. Yes, they say every oh good one. How are you to me, man?", " Quiz incredible huge fan huge fan seriously of your music. Obviously. I'm yet to know you as a person. Yeah, but bro like yeah now that means a lot man for real like yeah anyone who know when you put your all into something, you know, I mean, so the fact that you like it is yeah, man, pretty sure I wanted to start off with just a quote from one of your song and it's just a sentence and it is all my brothers wear crowns hoodies or hail it. Yeah. It's from attract cord.", " Late-night told him and 42. Yeah, that's I think after listening to all of your catalog. I feel like that line is one of many that sort of defines your values. Yeah. Yeah, man. I'm a very like family-oriented person. Like, I've all my friends now most of my friends. I've known him since I was like 11, you know, I mean that we've grown up together are from the same Hood like I'm still in the same ends that you'll see me and every day and I still chat to them every day. And those are mad", " Guys, and I went up go out and do something out what to bring it back to where I'm from if that makes sense. Yeah, man, I'm just here for the people that I'm around going out and doing the crazy things that I've done like career-wise then bringing it back to where you're from and sticking around the same people keeps you grounded. It keeps you level headed keeps you regular, you know, I mean, so yeah, I think it's important to have that kind of thing in your life.", " I first came across see when my friend Warner sent me Glide. Oh, yeah, we were just talking about. Yeah, and that's probably the main reason why I started looking into we'll get to that later because obviously that only came out last earlier this year my last softening my mom so we'll get to that later. But while really want to start with was pretty much, you know, Croydon and and your upbringing and you know, what was it about? Why did you feel that music was your path?", " Accident ready if I want to slide, I grew up in XX. My cousin is America and he's a songwriter from New York. You were some just you know, the Tory Lanez some say it is something that is so important. He wrote that song Brownstone if you love me and I'm so he always used to T. He thought you had this thing where you would teach me how to remember a phone number like he'd make it on Melody.", " For the phone number and I'd sing it and then that's how you remember is always had those kind of things in my mind growing up and then out, you know, I just always loved R&B music always had a love for that from like the way I was raised but then always thought I'd love that Graham and Hip-Hop and that kind of music from my environment and peers and friends. I was around so I think when I was 16, I was in college and I dropped out and I was rapping.", " Just wanted to freestyles watching like a rectory to Westwood Freestyle and I thought yeah, this is this can't be it can't be that difficult. You know, I mean, so I just started writing and then I recorded a little freestyle my friends Studio other guy called J Star Entertainment saw it and he filmed that Krypton corner and could there and those people we saw it on without you? I really like a stuff come-come that link me today. I'm doing this thing with Cadet and we went to like a kid.", " video shoot", " I know is these two other guys that I knew was I want you guys to be like a rap group called called The Garlic has yeah with then. We so at the cadet videos you met him. He was at your you guys should do like a freestyle now.", " And yeah, fuck it. Let's just do it like, you know, just Cadet and then did the freestyle just I recorded it put on YouTube and then things kind of like around created and that was that circulating around other people then from then I think he took J star. He's that a big reason why I'm doing what I'm doing. He sent me to the studio with like J5, but way back in the day.", " Kaku - as well and from then I just kept oh no, I just kept making music I didn't stuff and then eventually I thought this might as well just feel like the thing that I want to do for a long time. I dropped everything else. I was doing that work. Why isn't you know, what were you doing? I was wasn't I do know is that I was at Uni. Those are uniform better music production had a job like an insurance office. Hmm.", " Just boring shit one and then I was doing a couple of things that you know, you just do just to get some quick money and you know, I mean, but I spoke to my dad. I really want to do this music thing.", " Like you know what you're saying. Yeah. Well, you can either work all day and work or now on the music or you can drop it or say for a bit drop it all and then like diving head first and then that's what I did and fast forward four years. We're all right, let's talk about light that obviously that made so much noise for you. Yeah, man, it caught everyone's attention and then I was even more impressed.", " When I saw that you had produced it as well. Yeah, did you know what you were making? No, you know what so I had to Anthony Hamilton sample that one of my favorite songs. There it is and same thing. I was just like I didn't know that did you clear that? So Stevie was Mother's not actually I think I heard the song.", " Song and I was just I just got a new laptop and I was in my bedroom and my heart he was moving our flat and she had these speakers and I said well, can I just kind of take them she would like okay gone now and I was just making beats and just was just trying different things and then I heard this sample and awful. I let me see what I can do with this didn't think about making it into a song. I was just like making a beer and I had to be another you know, this is kind of its kind of tough man.", " Nothing of film myself dancing to the beat for on Instagram and everyone was like yo like yo, this is file for for this is fireman. Like I don't really know I want to do with it. But sick and then one day I left it for like a week or so. I came back to the next week and I just started rapping in the I was just wrapping to myself enough for you. Oh, this is really like a this is a really good song. Do you know I mean I was and I remember not having to think about this is the chorus or this.", " Is the did it added that I was just wrapping to the chin and then yeah, I'm just 100 Pala and then I remember playing at my boys and they were like, oh this is this is some fire shit man the barmaid in Late July and we released in March because we're just sitting on it for time. I didn't really we didn't really know what to do with it because I'm more like a project that's not really do singles like that then in January. I just thought you know what let's just release.", " Because there's so many people that like it. Let's just fuck it just hit up. Whoever we can whoever we know from anywhere and just try and get through the door. So it was it was it part of a bigger play or was it? Yeah, so I had the whole project. Yeah complete. Whoa had the whole Quilt Project they're still there, but we just had glad and that just stood out to everyone and to be honest if I'd kept over the projects and this may still not even be are now but", " just about taking that first step and having like a fucking moment and just releasing it and I mean and yeah, I think since then it's like done amazing things for someone that's like has really changed everything for me. And yeah, it's just it's mad because I think I made that you know, what's on me that was sitting on it for time then my grandma passed away and then you had the whole body of work and I would add like life is short man. Let's just", " Like it. I literally that was it and then from then.", " The trajectory just like changed everything. So even if", " Glad hadn't come out. We'd still have the same project that were working on now, you know, I mean, it's just it's the same thing just on the biggest girl now because definitely glad came out so elevated. Yeah hundred person and the next thing I know I see a video video of you on Twitter signing a deal with Virgin. Yeah, when did that come from? So glad you came out.", " And we did so much of glad independently like I got playlisted on BBC we've done like a BBC Radio London interview lab performance represent. We're just pushing as much as we could and Stevie or we had the whole project there and Stevie hit me up. You're like, you're like I'm working on something and I know that corner he's fast he's of the project as well good haters and", " Stevie I hit me up on Friday. He was like, yeah, I'm trying to this guy on a Monday. I went to come in to meet. This guy was I a cool. Where is it? You're like, yeah Universal version and we're just trying I was just literally just having a conversation when I'm talking about music. Yeah. So yeah, so I want to I'm not gonna lie. I want to put", " Just you and I was like, okay. Well then okay. Yeah cool cool cool like for attending. Yeah. Yeah, this happens all the time whenever and then I'm", " Bad by the next week. We had a deal. Everyone's not working on negotiating the best possible deal on blah blah blah, but then at that point a lot of other people started making noise so that Coach K managers amigos. It's flown to London and he wanted to meet me and play him the record and I was playing and he was just like crazy few weeks, you know, I mean, but with version and lost ones they I don't know why I felt like they just it just seemed like where I felt I felt right it felt around. I just follow my", " And then yeah when when it came through and when you signed it and what feelings came up for you, honestly.", " At the time I was just like because we knew it was going to happen for a long time. I took like a while to go through but at the time I was just like cool it was saying now one that was it's like in difference. No difference not I don't feel much of a difference. Once we send we had the champagne. We had all of that. Yeah, so it is there like, I don't know like I just felt like I just felt like a normal step because it was the thing that we have been working towards yet.", " remember getting home", " and my mom was home and put all my friends around the whole family around and had a big thing at the house and I was even then I was a bit like, okay cool, like everyone's better happy and I'm just kind of here then that night. I know that that night. I started taking in the side even like how much work has gone into it. And I just lost it emotions are still running. I was balling went to my mom's room old. Are you proper crying? Hmm. I was like, this is mad then I started deep inhale.", " Big a deal was because it's not like I've been making music since I was 16, right? I was 24 when we science. I was like eight years or what not going into that. So it sounds like you processed it correctly. Yeah. I think I'm always a bit louder and the moment. I'm a bit late hmm, whatever and just do what needs to be done in an art was when I'm by myself. I start different things and I'm like yo like this is some real shit, man and then but then even then after that I was that cool, but", " But but Monday, let's get back to work was we have to is no there's no slack. And you know, I mean you can't just be together sand and I haven't even off of it then it's more pressure and be friends double triple 100% Yeah.", " Let's just talk about your sound quickly.", " Eclectic is the word I use to describe it. Yeah, I'm guessing your influences are as well. Yeah. Yeah, I listen to a lot of different things neck and said I was raised on that OMB but by the age of a teenager listen to that Graham hip hop as you do as well as Anthony Hamilton as well as I can tell no one's like literally and then I remembered what that's a random songs on my phone when I had like Celine Dion that Sonic song", " Didn't the whole new world. This is back in then I'll knock your phone so that if you go through my songs, and then there's obviously the Jamaican influence because I'm moving our Caribbean and gospel because my mom was in church and I just love the musicality of order that I mean, I could climb a fan of Music before anything.", " And so I just I don't know when there's no real. There's no rules for me. I don't really see it as this type. I saw you at the next J Cole the next whatever like I just sit down and make what I feel I'm Makin that day and I don't know it happens to me. That's very commonly nowadays because we're so alike exposed to so many different types of music and content. Like how can you be boxed? There's no rules now. I think there's no rules anymore like before I stepped into things and people", " Yeah here I like this. You're like the next blah blah blah. We want to hear more like glad we want to hear more like whatever and I think it makes it harder.", " There's never been hard for me. If I'm honest, I've always I mean to progress also progresses in being a collector Corps. Yeah, so like because every because it's open now days, and anyone can do anything. Do you think it makes it harder to stand out?", " Nah, I just think if you're real and its raw and York on from you then that will shine through like I said, there's no rules to this man. Like I don't see that I don't see any limit under the only books. I don't see any no, I mean, I don't think there's anything that can conquer family to anything if I wake up tomorrow and I feel like making a classical record and fuck it. I'll do that whatever like we'll make it work. You know, I mean, I don't see it as a", " When doing this to progress and get on this playlist and this this this I just think you made the music first and all the other stuff will cover herself out that way. Mmm, that's admirable.", " Some of your highlights so far ends festival and thrust of all because that's like I was around the corner from a secondary school. My yeah, like I kiss my have my first kiss on that part for hundreds and I'm performing there was like", " I was mad but at the same time wooden opening set.", " Now caught my second cut, you know, I mean, I was like did it? Yeah, they caught everyone do they caught everyone's set by like just having your set card was like man, this is the moment and I didn't at the time of the day under there was pissed. I was like Regional just stormed off drop the Michael Pearce permit like taking in afterwards and seeing all the anticipation to before you're like yo, and it's however, I still a mess.", " Massive massive dork. I don't know. I mean I guess a stage with those names like seeing like Damian Marley burn away your back stage in life. That's almost chapters. And one of the things not didn't man. I spoke to that who I News Tonight Show lingo mirror me. Jazz carriers caveat was there also is a girl on stage when we say goes performing. Actually, I'll just on the side that is filming.", " And that was that was fun. It was a see also J Balvin quickly Dave was there was quite a lot of people there that you just bump into. Yeah say hi to and whatever and I think that was like a week after I had sent over. Oh my God, it was nice. And that was the week before my 25th as well. I would like a proper as a nice mad mad mad week. Yeah. It was nice. Definitely nice, but I'm that's a highlight every headline show dived under highlight hundred percent cotton.", " Knowing how I think the BBC Radio London thing was a highlight because you're not only you know, your songs not just getting played on there. You can interview you're talking about things that mean something and that's like real but I remember looking onto Twitter afterwards. Yeah, and this old when he was like, ah,", " you stop playing this gang hip-hop shit and all that probably. I'm just as it slides glad acoustic. What is that? How was that Kang shit? But yeah, that was nice just quickly also on production line, obviously produce a lot of your own records. Yeah.", " Did that come hand-in-hand with your Artistry or wasn't that was so I said, I was fastened Studio J5 J. Fire was the first by professional student I went to so I used to just watch him. He's been a wizard for Life way before he come up with the jae-ha stuff. He's been the guy everyone was telling me that our he's so talented and he's used to stay there all night like leave come back and he stood are working on the same song. So I used to watch what he did religiously and", " Is when I was like wrapping so I could rap and I could play piano a little bit. So I used to always try and do a little something here. And now then I went to college to the music production didn't listen in any of the classes always just on YouTube just like watching tutorials and stuff. But yeah that I think production was something I was a lot more taut. I had to learn a lot more about how to do a bit more research into that. And what what made you do that?", " Being pissed off at that no producers being about I really always any producers got any original Beats on that. No one hit me sometime cool. I'll just make my own and listen to something and just copy exactly. Oh as close as I could right? That's how I would practice and then eventually I'd started to make things a little bit more original now. I cannot feel like I've got that control over the hose out and so hundred percent man. Yeah.", " What's your deepest motivation?", " I can't go back to know me. I can't now I'm at a state. I'm In Too Deep to fall off by I'm still up I'm coming. But for me, I'm In Too Deep to fall off and go back to like a 9 to 5, or worst. You know, I can't comment. Like I'm so in control of everything. I'm doing at the moment. I can't go back to that. So that's that one motivation. Then I got that loved ones that you know what to put on for and myself like I do want to do think back out. I got my I got my car today.", " My car today this morning. I got delivered this morning and I fought sore enough for ya. Sick. What now? That's a financial commitment overpay for every month for x amount of time. So like I can't I'm In Too Deep to pull off basically, so I gotta keep Corky working.", " Then what's next because I know there's a project in that like you said a project in the works. Sounds great, man. I can't have really like yeah, I think it's it. Like where's the exclusive deals like night? No, I got a couple things in the works around the project that big me has more like I don't know because people had a lot of things in drips and drabs you heard single you've had EP this is like the most me that", " Can possibly be if that makes sense? This is like the closest thing to me like I got production on most of the songs that most I've been there from like the making of every song from start to finish and this is the like yeah, this is the closest thing to me that I can what we taught is an EP long as 90 is nice full-length. Yeah for length. It's serious man. Like I've worked on it for a long time and I put a lot of effort into it and it's", " same thing is very eclectic loads of different sounds I think I'm experiment and a lot more on some things but I think this is like me becoming the person that I meant to be right and it's because even like I just wanted to bring everything together over and I'm doing because also alongside making music I work out mental health and music charity as well and that's like", " Try to not necessarily with the music but around the launch and stuff. I want to bring that more more of that kind of stuff into attention it become more valuable stuff things that can people can take more away from rather than it just being good music that you can listen to you want to talk a bit about that because I was going to ask you now was that was that so close to your heart? Yeah, man, that's a charity called key changes. It's just I don't know everyone go through mental half. I've got a lot of people close to me now gone from it.", " I'm going through my own mental health struggles. I think everyone has mental health struggles. I think is the same as my physical health. So if you get a cold, it's like the equivalent of having a load are your bit depressed. You know, I mean, I think I needed to the two are completely linked. Yeah hundred percent a hundred percent, but we don't know about a store something that we're learning about every day. And then so of key changes their charity that they have we have a deal with recovery of", " People have gone through that mental health breakdowns and been on psychiatric Wards and what we bring them into the studio. They get to record. They got to just talk they get the chance to perform for each other as well. And yeah, it's valuable for nothing. Even when I go there every week. I gotta like twice a week and I see the change in people over time like the recovery of them and that means mm. He's just as much as this other music stuff that I did, you know, I mean because that", " Yeah, it's as you see is very rewarding seeing directly impact your work and I think is any ever something. I would want to leave behind - well, he's proxy for that fish is very important. Yeah.", " I'm normally end Auntie questions. Yeah, so I do this with everyone first one is what was the first piece of music you remember getting hold of for purchasing?", " It's not the first thing that comes to mind is Rich free to black and white was a big album. That was a massive album. I remembered I was like", " I was religiously listening to Rush right? Yeah, but then he's like you just mentioned earlier about like you listen to his freestyle and that's why did you appreciate how much of a Wordsmith he was and his wordplay was mad. I like he was 23. I think he did a one I heard you let today I'm tier 3, well, that's funny because I'm still free to you know, that, you know, you're just you just bear good like he's very good with words and", " Yeah, he's like a big inspiration of mine. Lyrically. I think if there's any piece of someone that you can say is a direct influence, I'd say he's probably the closest thing but you're black and white incredible and finally stage or Studio.", " Studio then I know six months a year Studio Semana, it's not yeah. Yeah. I'm a music geek and it's like I see that being on the computer making beast. That's for me. Not the equivalent of someone playing PlayStation. Hmm, and I could do that all day. So yeah, she did what's the stage feel like this stage is sick when you're on stage by like everything else is man headache like you", " Are there any guest list going to get plus one? But Stephen can worry about that dog was brought I even like Steve you on the day of the show, and it's so I've started at turning off my phone on sure it is. Yes. It's can't stand it the constant but studio is your own. There's no rules. Just whatever you want to do. So that's a studio under percent man. George is a pleasure version."]}