{"showID": "0A4HFH7rgoBjz44K0ZABXl", "show_name": "The Real Madrid Podcast ", "show_description": "Presented by Tim Caple with new podcasts out every week. The worlds greatest football club Real Madrid generate a huge amount of news, rumour and speculation here at the Real Madrid podcast we round up all of the current headline making stories relevant to Madrid.", "episode_name": "The Real Madrid Podcast ", "episode_description": "Presented by Tim Caple with new podcasts out every week. The worlds greatest football club Real Madrid generate a huge amount of news, rumour and speculation here at the Real Madrid podcast we round up all of the current headline making stories relevant to Madrid.", "transcript": ["Hello and welcome back everybody to the row Madrid podcast for coming up today. We'll ran up what's been making the news. We will look back at that Epoch midweek draw in.", " Kinsley with DSG and we'll run the rule over this weekend's opponents in La Liga oliveres.", " First up that nice take a look at what's been making the news over the last 24 hours or so very Val Verde has renewed his contract with Real Madrid until 2025 with a release Clause Now set at 750 million the last few months of given him the confidence to believe that he now has a significant future as a Madrid first-team player early hollered the 19 year-old for Darby Salzburg who so far this season scored 27 goals in 19.", " James is again making headlines. He allegedly has a release Clause of just 30 point two million in his contract and it was reported that RB Leipzig were in pole position to buy him in January, but the club has issued a Stern denial of any agreement actually being in existence with anybody and their message was if anybody thinks they can buy them in January and as you've got very deep pockets and around a hundred million euro to spare then forget about it.", " It it's father Alphas Keen that he does make a move to Bundesliga to continue his development before a jump to either Premier League or La Liga now some news for anybody believing that they're going to roll into Madrid to take vinicius on though this January the club has made it clear that the answer is no despite the fact that he has played very little in recent weeks. They've said that he is simply non-transferable. Not only this January but next summer as well if you room.", " Flying around Spain about the future of Jaden Sancho and his potential for acquisition this January the player has become increasingly disillusioned believing that he is being scapegoated for the drop in form of Dortmund this season in addition, of course to the odd breach of Club discipline seems highly unlikely that hradzka and Dortmund would sanction a sale in January, but it is use is only going to be peripheral by Lucien Favre and who knows he might just happen.", " And plenty of rumors beginning to fly around particularly in the UK about the future of Pierre Emerick aubameyang with reports saying that he wants out of the Arsenal at the end of the season of letting some to the potential for him to come to Real Madrid. Now, he still will have a year to go on his contract. So sizable fee would need to be page. The player will be 31 years old as well. So whether Real Madrid would want to invest a large sum of money in a player of that age that", " The big question the reality of a move to Bernabeu looks you'd have to say slim. It's almost Munoz comments are still doing the rounds after he issued an apology to Eden Hazard following his challenge that led to him leaving the field against PSG. Honestly. He said my goal is never to hurt or harm another player, especially eating. I do try to contact him after the game to apologize that I couldn't actually see him Hazard won't be fit to this weekend, but he will be back for his pre-Christmas Rush including the game.", " Against Barcelona, there is some potential bad news on the horizon Port Marcelo and indeed men d-pad Earth has told Borussia Dortmund sister's ashes of hockey money will be returning to Madrid next summer and there will be no potential for a deal to keep him. Keep an eye to on Federico chiesa as Fiorentina the Italian International and spent Five Seasons with the club and is said to what a fresh challenge to Dan is known to admire the player who has scored 16 goals across", " All competitions. He's played in this year keeping up. What is an impressive ratio as well. Remember for Italy's under-21s six goals in 13 games another rumor circulating particularly again in the UK, press surrounds Alex lacazette at Arsenal unhappy with the current code. She and Ray would welcome a move away more rumors circulating especially in the UK about Alex lacazette at Arsenal unhappy with the coach. Emery would welcome a move away.", " Are there some suggesting that if Madrid could package hammers Rodriguez and Mariano as part of the deal and get some cash as well. Then this deal looks as if it could work certainly the 28 year old scoring record for Arsenal is impressive 31 goals in 75 appearances his contract at the moment runs until 2022. Now there's a lengthening Q beginning to appear to get the signature of Palo de Bolivar from Juventus who", " Back in the team and back right informs six goals since October the 22nd culminating with that goal against Atlético in Champions League the other night. However, again, there is no chance of a January move. So it will be next summer before his future is finally sorted out.", " In the aftermath of that Champions League draw with PSG there were clearly mixed emotions in the hours and the days that followed the fans were given a performance thirds remind you to all that at their very best. This squad has the ability to compete and beat anybody in this competition the dance I'd the game was one before defensive lapses cost them a famous Victory and it continues from the referee.", " Just gonna set a great little over from the referee there would welcome it as art Carver how Return to Val Verde Super Bowl. It's go Benzema.", " He's sweeping Real Madrid move ends with the for being swept home by their number 9 which kicks it despite Burnett's attempt to tackle. Its go Marcelo over the bed survive two goals for Karim Benzema the Frenchman on form against the side from the French capital and it looks as though they are going to avenge their match.", " They won't defeat in Paris. Although PSG will keep coming and it's come all the way to a backpack. The cushion did not last for long at all for an inexplicably let the ball drift and he reckoned with that killing and Buffet waiting just behind him girlfriend Buffet against the club. He might one day play for his 70th goal for Paris Saint-Germain in his 100th game, but now a buffet Let It Go.", " It was blocked by rebels, but it's in now Tablo surrounding area. That's quite an incredibly fine PSG level from nowhere, but it was an epic night wasn't it in Bernabeu? Xue jian's view in the days following. He said the players deserve to win. We played a great game. I would love them to play like this every matched our like to everything the attitude was good. We played good football in the end. It was a cruel turn, but I will concentrate on", " The good that we did and I also say thank you to the fans as well. They were fantastic with us today. The big surprise of course was Isco. So when did he decide that he was going to play him. He said I won't say when I decided but he has been phenomenal today. The team overall was spectacular on Val Verde. He said he is growing like all the players here and doing really well. He plays box-to-box the whole game he has been brilliant and lastly.", " The final word on navis. He said I'm not surprised what he's done today. We know him. Well, it made five exceptional saves which helped them to get. The result. Tony Cruz has added a few views of his own. He said this performance gives us confidence for the next few weeks. We must continue with this type of game. We play today. We aren't happy with the result. But the performance was good. Now after the dust settled though, the reality dawned that in not winning the group what lies ahead", " had for Real Madrid is the potential for a big big game in the round of 16 the likes of Maybe aventus by meaning or Manchester City, perhaps", " Now moving on let's take a look at out of this this weekend's opponents of 30 previous meetings between the two round Madrid of 124 loss for drawn to Alvarez one one-nil last year Manuel Garcia's goal scored in a 95th minute against lover teguise team. They had won one in Madrid back in May of 2000 demboski was The Man In Charge way back then McManaman and an elk are actually played that day. Madrid's biggest Victory 5-nil they've won three times.", " The last time was May of 2001 two goals for growl hell Gehrig Ooty and yarrow all on the scoresheet that day now Real Madrid start level with Barcelona at the top this weekend elevators down in 13th, Pete and six times this season in 14 the way record poor the home record. Very good severe. The only team to have won here at this season Atletico held one one back on the 29th of October.", " Let's get a look at the numbers. Then on the tale of the tape. Well goals per game Battle of has 1 Point 1 to point 2 for Real Madrid past completion rate 70.3 for out of sat 7.14 Real Madrid possession per game average 44.1 the season for elevators 56% for trail Madrid as for the goals shots per game 9.14 out of his 16 .94 Trail Madrid in terms of the actual gold 16 goal scorer for out of his decision.", " Burrell Matrix 3 set piece goes out of those just one set piece golfer out Madrid this year nine girls and open flavor out of his 22 for Real Madrid for penalties for Madrid three penalty for oliveres now players to watch out for 2x Premier League players. No less Lucas that are first of all seven goals the top scorer at this season. Only once has he made double figures in his career that was back in 2015-16 when he hit 17 with deportivo.", " His time there Yesa lose six goals the former Newcastle player. His best season since 2014-2015 when he got eight with Hanover had he to looks as if he's on course for double figures in the only time that he scored in double figures was twice when he was with Real Madrid Castilla team back in 2010 11 and 11 12 the key assist provider for these two players the doll and there we are that just about wraps up.", " Today's proceedings. We will be back next Tuesday with the review. In the meantime. Don't forget you can catch up with all the previous editions of the show via the website and www dot Real Madrid podcast.com or via iTunes Google Spotify or Stitch a enjoy the weekend, and hopefully the three points that are coming and I'll see you back again here next Tuesday from me Tim cable, buh-bye."]}