{"showID": "0A4rSk465szkl19Zb6UXA2", "show_name": "The High On Life Podcast", "show_description": "Get the whole story from the members of travel influencer group High On Life, we talk about life, travel, and our experiences along the way.", "episode_name": "The High On Life Podcast", "episode_description": "Get the whole story from the members of travel influencer group High On Life, we talk about life, travel, and our experiences along the way.", "transcript": ["Everybody you're listening to the high and live podcast the podcast where you can get inspired to reach out for your own dreams with us today. We've got Nadine sikora affectionately known as hey Nadine with over 600 YouTube videos and seven years of traveling in the bank and having stamped her password in over 50 countries, which is a huge inspiration to all of us at high on life. In fact, she was the one who got us", "Start with our first travelgate back in the day today. We'll be talking about her experiences turning her passions of travel into a full-time business and we'll also be talking to her about her experiences as a solo female traveler is going to be a lot to unpack today. So without further Ado here's hey Nadine. Yeah. What do you want to know a lot lately? You know what I was looking through your old you?", " Tube videos right went from like sort from oldest to newest. Oh, it's so good to go. It's from Steven know the private stuff. I had the private a lot of its from 12 years ago. Oh, wow, like when the like where were you in like the stage of life back then 12 years ago. I would have been and University still. Okay, where I started Toria? Yep you back. It's where I started YouTube. It was a hot. It was just something YouTube is something I found it wasn't a thing.", " Back then but I used to do you theater when I was in high school and then I went to University and I was studying engineering and then computer science and I was also playing varsity golf. So I had no life at all outside of that and I really missed the creative aspects of theater and I had nothing it was all work or Golf and I found you two and I found this random girl doing these sketch comedy in her bedroom with the cat suit on.", " And I thought it was hilarious and I was like, who is this person and she was just a little lie a random person and I found this world of YouTube. It was sketch comedy. That was where it the majority that was the majority of content on the platform at the time. This is 2006 and I was like I want to do that that sounds super fun. So I started writing up he's skits. They're really awful. They're not funny at all. What I thought they were hilarious. It was gonna bring up them up or anything. No, no. No, we don't need to do that. Um, and then I asked her.", " Ham for Christmas and started that's how I started just a fun creative Outlet webcam. Yeah, I remember my first with nobody but most people just know one feel time cameras back then it was all its majority webcams. Yeah. Yes. You remember the person who's making those sketch cat whatever. Yeah, Abby girl Abigail. She doesn't really do YouTube anymore, but she did it for a while and she was like one of the top creators. I'll show it to every girl. She's still there starting us all out. But yeah for sure that's so transitioning into", " To like your travel like how did you go from sketch comedy to travel videos? So when I graduated University before I wanted to like settle down and get a real job this before. Oh, yeah real job. I want to go travel. So I start I got a working holiday Visa to New Zealand and I moved on over and I started traveling on New Zealand and traveling around southeast Asia and I wanted to film my experiences vlogging wasn't really there was a couple people doing", " looking at the time but it wasn't like the huge genre that it is now and I was like, oh, this is a way to Showcase my travels travel that he was born to think either back then and I just kind of mix the two and", " went from there and I really really enjoyed it. I enjoyed creating that type of content and I kind of just continued with it. Oh, did you decide New Zealand? I love for the Rings. Okay. I like that. I am still huge witherington but I'm a big fan of the tour is apparently no the time the doors there's some toys like Hodgins amazing like only odds were alive, but it's because it's like Hobbit holes in real life, but the majority of Tours you realize how much movie Magic goes into", " Your stuff yeah into these movies, but it was still like some of the South and ones were okay because just the scenery is just gorgeous but you're more so marveling at the scenery than the actual leg Yeah. I feel that during Z. I felt that feeling when I went to the beach right outside. What's the island? Anyone anyone? I don't know I was I was just close to it anyway something but yeah when I went there I met Maya Bay. Thank you everyone. I remember getting there for the first time and being like", " Oh man, this is gonna be so epic this with the most unreal looking Beach. I don't ever seen in a movie and then I get there and I'm like all this really this doesn't look like it did in the movie and then I went back and looked up the footage of the how the movie portrays it. I was like, oh man, like they must have been at only one specific angle when they showed this shot and they probably had to touch up a few things - the thousands of tourists that are there now and I was like, okay, it's not what I was expecting. It's", " What I was hoping for close it off now to ya. I think they do like three months out of the year or something. I could still open every year but they have times where no one's allowed to go give some breathing space to the coral reefs and all that stuff. That's a good idea that's needed for sure. And did you go by yourself when you first left? Yeah your first trip. So interesting and how long were you going for ideally year? It was a your Visa. So that was the original plan. Although I didn't stay for the full year. I only stayed", " need about six months and six months because that's when YouTube kind of took off and I started getting well, I like travel video started taking off and I started getting opportunities to go travel elsewhere. I was like, oh my God son wants to pay me to go travel somewhere else the dream and when you say travel videos starting to take off, what does that mean in 2007 or whatever? So this was 2010 that it so I started into in like 2007, but I started travel in 2010 and what I mean by that is that", " Like tourism board started like the first one that reached out to me was New Zealand was because I was there and I was like what I was like, what is a press pass like what is right like, what is this is apparently something that's been going on for ages, but it was with journalists and like travel media like writers. Yeah, and I was like this YouTuber and I was like, I've never heard of this before because I didn't know anybody else that was doing it and they reached out and they basically just gave me this booklet. That was a list of all these providers.", " And discounts or free passes to them so I could take this booklet around New Zealand and get a free accommodation or 20% off this ticket or 10% off here. Like it all vary depending on the provider but it was like, oh wow, I this was so cool. I didn't realize that like this could existed so that started like halfway through my New Zealand stuff because I was traveling and creating these videos before I even know that that was a thing and I traveled route Asia before", " He knew that press passes with its yeah thing and then yeah people started reaching out then cause you're making videos before you even knew there was going to be a business aspect to it, right? Yeah. I mean there wasn't a business aspect to it for a long time as especially travel. I would say the biggest thing that came about was sponsored content and sponsored content and come out till about 2012 finish. It kind of peaked. There's a couple small things in 2011, but nobody", " Really knew what it was It was kind of ever random products that were being promoted. Like I did one for like just to promote a TV show which is really super random, but it was it was very like like I did like to in 2011 so and they were like barely any pain at all. It was it wasn't anything big and same with 2012 that was just the contiki partnership, which is no so that that but 2013 is kind of when", " Sponsored when people always say that influence our industry because influence and she was not a thing yet either. It was just sponsored content and then I because AdSense is just always been Pope. Yeah, like it. That's not good. No. No, that's you're making like millions of views. Yeah video. Yeah, nothing really any point to what was your reaction when you first realized that you get paid or you're getting free stuff because of your travel videos or even like people are noticing your stuff. I mean, I was stoked. Yeah. I feel like a lot of people", " Dream is to be able to be paid to travel and I was getting paid to travel which was cool. I mean it wasn't offsetting the cost of anything. I still had to work many different jobs to sustain actual other life things like rent and food, right because it wasn't doing it full-time. What were you doing? Like on this side as several different jobs in New Zealand? I was doing a temp work. So I did a couple different temp jobs. I always wanted something not full-time like you.", " Could have done a full time job like with my degree I could have gotten it but the whole reason I went to New Zealand's like I wanted to travel the working holiday Visa just gave me a means to make income while I was traveling. Did you serve restaurant stuff? Yes, I served. I didn't serve in New Zealand but I served in here in Vancouver. So I did a lot of serving around there because it just it pays well and it's flexible hours. Yeah, it's easy enough to get another job somewhere else if the if you need be yeah, so if you need a quick because", " like oh this opportunity came all of our I'm leaving for this you can go and then you can come back. It's very flexible. And as a transferable skill for sure. I resent you can do anywhere. Yeah, perfect. So like take us back to when you were about to decide, you know, just decided to travel by yourself. You know, we're there any, you know Revelations of like yeah. I'm going to go to New Zealand by myself that you have any fears about stuff like that? Yes. Um, well took a while. There's a it's a two-part kind of", " Question of how the New Zealand thing came about yes, I was about that one is I wanted to go travel. I didn't really have money to go travel. So the working holiday was an option that would allow me to fund my travels. Well the old to find my travels and travel. So I want I knew I wanted to working holiday the program that I went through which is a swap. It's a Canadian program, but there are multiple International programs. There's ones for every country. You can imagine they just working.", " Holiday visas are kind of a reciprocal agreement between countries. So if your country allows if if a certain country allows you to have a working holiday Visa there they will allow like vice versa. Yeah, that makes sense. Yeah. Yeah. It's a handshake. So there's only certain countries that you can go to its Canadian and likewise, but depending on your nationality you can go to different countries, right and New Zealand was one of those countries I was like, yes, so I was like, okay English-speaking great want to save it.", " Reason the world does like okay. That's cool. Okay Rings, I'll either earrings. So to me I was like, ah, no brainer done is Elin. So booking that and getting that sorted that's kind of another question because I had actual job lined up that I was debating about taking that I was having like quarter life crisis where I was like do I take this job and it was it was a government job that I was going to yeah, very cushy government job and it's just", " Like 2009 so like we're in a recession here. Like there's there's no really good jobs available. And I have this opportunity. I got set up through a friend where I could take this job offer, but I was like, I was a child. I was a job the government it was my can't say no. It was it was it would be to be working on medical devices that they use like Medicare like the BC BC put Medicare Plan.", " Oh my God. Imagine you nearing did you take we get your signs? I got you because we you're the third engineer of had back-to-back podcast by the way to be there for sure fillets. Yeah. Well, they're imaginary computer scientist. So would have been programming for the program that uses BC the Health Care System the online Health Care System, something like that. So you finish your you finish your degree then did you yeah. Okay. That's it finished. My degree not using it though having it's a common kind of trait. Everyone's been", " gone to school and either dropped out or they're doing something creative now just for the people that we've been talking to recently. I'm following that similar suit having say goodbye to my government job about a year ago as well. So I can't tell you what it is though. I just told you what my God my G-Man never targets. I don't know any secrets of the government. Yes. He was gone secret cave in government. Um, but yeah, so I turned that down. Do you have any like older siblings that were going traveling before you so you are the", " And your parents are they just as much or know they're immigrants both of them. So yeah, so they both came from Europe. They both immigrated my dad from Czechoslovakia. That doesn't exist anymore. I'm all from Yugoslavia, but also doesn't exist anywhere. You can probably put together, you know a little bit history. You can realize why they came it was both during war times. Yeah and conflict. But yeah, so there I'm first generation Canadian and so they the idea", " of traveling for fun like what? Yeah teach you any Slavic languages or anything. No, my parents wanted me to be accustomed to the Canadian culture, which is English which is a big mix of other kids. Did you teach me? Yeah. Well, I'm rather upset about that because I would have loved to known. I mean I could still learn but yeah, apparently it's not your Forte though. No, it's not my forte languages. I'm just the worst at so you were really the first person", " Your you have any siblings at all? Yeah, I have a sister and a brother. Yeah, and are they following the traveling Roots kind of so my sister's actually geologist. So she is an exploratory exploratory geologist. So she does travel for work. I'm she travels a lot more than I do surprisingly. No now that she's actually working but she does a lot different kind of travel like she's like in the bush with like no service like the secrets Top Secret locations at Cannes uncovering ancient civilization this thing off, right?", " Yeah, legitimately and your brother, um, not so much but now he just he just works a regular normal person job. That's not in the bush a random countries. I was the reaction to your family when you said I want to get up and head to New Zealand and go live out there for a bit.", " Well, they weren't overly stoked about that considering us. Like I'm going to go for a year to by the way. What do you know anyone really? I mean I said, yeah, I'm surprised I love look I know but they don't really know them but I think the normal reaction of parents would be like, I don't know about that leaving. The nest is a big thing but to another country for a year as a pretty big one. Yeah, it's a big one. They weren't overly supportive of that or stoked on that. My mom was a little bit more sporty.", " My dad my dad. I literally thought I'd be like out of money in two weeks on the streets in New Zealand begging for change to come home. And I was like first off Dad. Thanks. They don't even let you use the country with a working holiday Visa without a return ticket like you legitimately have to have a return ticket. So if you do run out of all of your money because you know, you just run out of all your money. You will have a way to get home at least. Yeah, if you can survive until the flight. Yes. Aidan has a really horribly gambling problems tell you about you lately.", " Um, so that's what they thought luckily that didn't not happen. Yeah. Um, but yeah, I think that you got a little bit more comfortable over time. So I'm assuming your perspective on your parent's perspective has changed dramatically back then to the to now which I'm sure that sure they're very supportive and they figure out that this is a pretty good way and fun way to make money. Yes, although to be honest the support wasn't as much about the travel and more about the Financial Security as any parent.", " Wood for their child for sure. I mean my mom's always been like", " The support you in my like Shield will always support me no matter what like I could be doing the most stupidest thing. She like that's so great. So happy for you. As long as you're having fun. Yeah. Can you do in a Slavic accent? No, I can't but she doesn't actually have an accent my dad does but um, but my dad he was just like it's a phase. Oh, yeah. It's a phase. Okay here, I mean the geese supportive but it took him a while to I mean to be fair it wasn't really a choice.", " Rear door while I was doing it. It was just a hobby that I was doing on the side for fun and I had other jobs and that and like I didn't treat it as a job as this was my career. So like he never saw it as that either but he was always supportive too, but it wasn't until like I was like about 2015 to 2014 15 when I actually went full time into it and I was able to actually sustain myself full-time that he was like, yeah. Ok, cool. I got it. Yeah, I don't get it. But I got it. I got it. Yeah.", " Support it as long as you're not in the streets begging your fine. That's Dad's Duty. Anyways, yeah financially the books all that kind of stuff so books. I mean like and also like from a perspective of a dad looking at like any kid the from a teenager to being a young adult they were phases as people of faith. I wish I wasn't the greatest kid. So you never know when those face is stopping at you start doing something serious. So just looking gonna be protective as though I was embarrassed phase you had, you know, when you're pairing we're talking about needy not me. I want to know your face is yeah.", " I don't know. I was just I was just the most immature piece of crap as like when I was 16 her eyes time he met at me. That's he's the head coach of the workspace. It's still going on. Yes used to head but we're not going to get into that. Okay, okay to your photos much too much. Just call it two guys who enjoyed playing rugby and being dumb grunts having a couple too many drinks together and then just being idiots together. Yes fast. We met we were at 20. Hello. Yeah.", " Is he never stopped? Okay, let's not do that again. I want to get into University and you'll never make it enough. Is that pretty good? I want to get the university and when you ran into the guys Max or Riker first, I'm not sure but you met them both when you're in you Vic in which year? Did you meet them first year university second. So would have been their first year of my second year. Oh, so young.", " Senior. Yes because I actually went to SFU for my first year I transferred over to you Vic because the golf program is a few was canceled after the first year. There was some know the coach the coach like I don't quite a hundred. No, all I know is there was funds that mysteriously disappeared that was for the coach was responsible. And basically the school's response was Acts the program. Oh", " Which was really crappy so he's back now apparently but this is actually called like sports. Yeah, like varsity varsity golf. I've never heard of this never diversity goals. It's like, oh you've heard of the varsity football. Of course. Yes the same thing just different sport. Okay, so we're in like in the same family. So we go to the same things kind of okay. All right, we can kind of colors. Let's get was as to whether it be a blessing in disguise that you want to work instead of s of you thing. I mean, yes, I also give me an opportunity to transfer programs because I was studying engineering", " A Tas of young girls here and golf I knew it would be over. So like I know is going to be transferring and I kind of like the idea of sustaining BC. So I talk to you Vic coach and they're like, yeah, we'll have you so I transferred you think's switch to computer science and then started playing both are so the transfer to you Vic was mainly through Varsity golf. Yeah. That was the reasoning behind it. Okay, because I mean the reason behind ever picked us of you was because I had a I would be guaranteed top spot.", " Golf team, so that's kind of like when you're when you're a varsity athletes varsity varsity athletes go through the opportunities are yeah, you kind of suss out a couple different schools. You'll get like your school offers, but they'll give you a placement of where they think you're going to be on the team and you could pick better schools, but you might be like, oh you'll be like an alternate number eight ten so means you'll never really play and the like competition you're just kind of there if somebody else can't injure his", " Yeah, exactly. So you have that option and it could be a better bigger school, or you can take a smaller school and you can play exactly I wanted to play so I put as a few Canadian schools are lots of smaller. We don't have the biggest budgets as like American schools as like we don't have huge football teams to fund our Varsity Sports Clubs. So we have smaller budgets. So we have spaceplane smaller divisions and", " Can't actually play in the bigger divisions. I don't think we even qualify for like give one the most we can do is Naia which is the div, we really played in, you know, anything about college sports or div to NCAA div to that's what we'd put also play in those tournaments. We play like Nationals NCAA div to but we could never really played if one although I now think that you BC kind of place them div 1 I'm getting sidetracked. Most people won't be able to follow that you might", " Be able to follow that so do you still golf that'll not not competitively. Have you ever made a video on golfing I have actually I've done a couple ones. I did like a travel one strong Kamloops by one played some courses there and I did like kind of an inspirational video just about my experiences and golf but my travel might like my channels about travel and write as fun as golf is to play it. It's not really he's almost like content entertaining. It was not accessible really. It's pretty expensive when you go anywhere I find", " It's just like AB is an expensive sport. Yes, it's fun though. Yeah, so going back to you better be right. Where were you on rats with Ryker? Yes. So we were at the same dorm room on the same floor. I met Max first and then Riker through smack smack smack smack warble. Oh, yeah. Well, I met him at the we were I was on the same floor as Riker. Okay. I like we were just a few doors down because they had like girls swing boys Wing, right? So we're I was on exact same floor as Riker. Yeah Max might have been but I met Max.", " First because we did the whole like building would do like these dorm things. It was that experience like you can count on Riker and Max being involved in those. Anyways, they were at the life of Hank Brown like they threw all the parties of sounds familiar HB sounds correct. Yeah. It's go into details right now, but record certainly got a few incidents with the RAS getting in trouble for shenanigans. Yeah, you can see it coming. Yeah, but no they definitely yeah life of the", " That makes sense. Actually. I want to know I want to know what Max was like back then probably watching the same actually hasn't changed believe it or not. He's a lot more mature now, which is right now, that's fair. That's fair. So I've been told that you were the one who, you know got us linked up with contiki. Is that correct Parker? That is correct. Now did that happen eating started really everything travel-related and sponsorship. Wow - shall we / like she opened the door for us? We owe her like Revenue basically royalty. Yeah.", " So half of our sensors cut this live broadcast, they are bills to but actually I never knew that side of that until only recently because I just knew I thought contiki came about just through you guys being in Greece or just prior to that. I didn't know that they didn't had some do that, which is amazing because that was the really the first not first. There was the first paid one and four sponsored one as well when we left home. The plan was to go to Australia for a year. Just like Nadine story, except a", " Current Island, we went to India first because Arjun had a family wedding did a month there went to Thailand because like everyone else is done southeast. Asia looks fun. And you know, you can buy cool stuff there for cheap. Let's check it out. It's do that. So we did the whole circuit and while we were in Southeast Asia, that's when Riker had somehow found out that you were doing your travel and vlogging stuff and that you even I guess maybe had this sponsorship with this company and he reached out to you and I'm not sure how it really", " Play it out from there because nobody else in the group knew who you were all actually Max was there by now, but anywho, so that that opened up this this door for us. And then I guess you talk to them. You showed them what our Channel had become at this point back in 2012, which it had started up. We had some some following by then and then whatever happened from their happened. So we met you just a couple of months later. Like it really wasn't very long after that in.", " In Hungary, we are Budapest was the beginning of our trip and we did a week together. Now that that was that's the story and it was a press trip. So they were looking for other kilometers other travel. Well and I haters and stuff. That's when I also I thought everyone was going to be people who made videos just like us and then, you know, Seattle dredge and stuff and I was like, oh, what do you do? I have a Blog online as I write stuff down. Oh no videos like, okay and then I kind of got the idea.", " Like oh other people do stuff pertaining to this kind of industry doesn't have to be making videos like a I was new to everything as well. Like a lot of this open my eyes, right? It was just in its infancy of real understanding what the possibilities were because high and life wasn't her Sunday findings of the time. Yes. I'm sure he was is not about travel but use what you guys who were just going traveling right? Let's film it. Right. It wasn't a travel thing until you realize wow, this could catch on in this could actually make money or have us like work with Brands and stuff.", " So like yeah, that was a very I wonder what direction it will see I think is not, you know, isn't that how it's supposed to start out at this is your hobby. It's something that you enjoy doing and then it kind of turns into something more because you get good at how did that happen for you? Like the transition between I'm just doing this little bit getting it out. And then now I'm okay. I'm in it full time. It's just like a slow process a couple of things here and there for the first couple years of next year a few more and then as you do more other companies started catch on like oh there's this new thing where these YouTubers are.", " And then so what is that like a to that was maybe like two years for you between like starting a New Zealand getting your first, you know gigs gigs and I'm going full time. Yeah. Yeah. It's so 2010 was New Zealand. Like I said sponsored stuff was not really a writing. I got a I got a paid like opportunity in 2011. It's why I left New Zealand, but that was like that was like, oh my God, this is the best thing ever.", " It was like very unheard of it was like a big campaign with several other YouTubers. So it's really really cool. But then there was like nothing in 2011 is just all my own just making money for I like hustling doing other jobs to fund other travels and then in 20 end of 2011. I did a press trip with contiki which was how I was originally they reached out to me which is how I originally got in contact with them and they're really there was no like the reason I kept up with like Max.", " Anger is like because there was no one else doing it like it was it's the travel video Community. It still is a very small community. There's not a whole lot of craters and I saw like that you guys were doing videos because like we were still friends on Facebook and their postings their Facebook. That's how I knew that you guys were doing travel videos and and traveling and I was like, oh my God other craters so cool. I was just really excited about it. And the 2012 is when they offered me a paid.", " Ship to do the kind of like a residency where I'd be like creating all this content for them. But that was just one company, but I that funded me throughout the whole year because I just kind of did contiki projects with them but that in 2013 just like nothing. Yeah, because like it wasn't a thing. It's still like sponsored influencer industry wasn't a thing in here. Nobody knew where it was going known like there were not like these hubs there weren't agencies or really wasn't money in it yet.", " Tiki-taka huge risks. They always were kind of ahead of the game on stuff even with like the road trips that they did and other like future stuff like Thailand. They were always kind of ahead of the curve on knowing what was happening and and the whole like influence our world that it's become right and in 2014 is when I was like, okay, I don't know what this is, but I'm gonna take a leap of faith. Here you go, and I'm going to try and do this full-time, but I need to", " Like be able to sustain myself and I need to be able to to pay my bills and so in 2014, we can try 40. I was like I'm going to make this happen. I'm going to make a knot and I just hustled like crazy and like I just like eating Ramen and just like physical like and just like going out the going into debt like credit card debt just is like paying my bills so I can I had like this flat in London. I was sharing with I had like six or seven of us roommates. I was it was super fun, but we were just trying to make this.", " Trying to like hustle. I was like pitching jobs pitching tourism boards pitching companies to be like, hey, I want to create travel videos for you because no one was like again, no one really knew like that there that they people doing this and then I just kind of things started falling into place halfway through that year and then in 2015, I was able to go full time because the industry exploded it wasn't necessarily because I hustled so hard. It was also because the industry took hold and then people started writing articles.", " Calls but other YouTubers that like hey, they're super valuable. This is a whole new type of marketing people started actually allocating budgets to do that. And I just grew into what it is today. Yeah, but you gotta, you know pat yourself on the back for sticking it out and get yourself in the right time the right opportunity. I think that's a probably a common Trend that we've talked to a lot with a lot of like other Creator friends like Christian, you know, there was always a leap of faith that someone needed to take to get into this. There's always a moment of money being scarce and just", " Knowing if this is going to be a future in this bridge is kind of like I love doing this. I want to hold on to this one and try it out until I have to come home to my parents or something like that. And there was always Ramen to always everyone's he's wrong this time boys. Yeah, so that's great. I mean, I think that's for anyone not even the travel space. That's something to remember is if you believe in something may not make sense now, but just hostile and try and if you think you can make something out of it just do it until until it takes off or until you realize it was a bad idea. You try something else. It takes a while like it takes a", " A lot of time I started video that started videos in 2006 and 7 I started traveling in 2010. I had got one lucky gig with the contiki gig that I was able to fund the year of 2012 of just being able to like cover my costs. But then 2013 and 14. I still like just working other gigs and drying and like 2014 by trying to like scrape but like trying to do the work that I wanted to do but still like it's like really really just scraping by.", " Like running on dirt just try to make it happen and then and then it's good but like many many years of not have Aces and not knowing what to even do because like I feel like in 2019 is a little bit easier because you have this roadmap of what is ever what like there's there's so many books on how to do what we do is I have in my own horse. You have what I do have it all it's perfect. I have a trouble you course.", " I'm how to make videos but there it just wasn't now there's a road map that has many many people doing it. You can kind of follow their footsteps. Oh, but back then everybody was just kind of figuring it out. I'm sure you guys were figuring out what you lot of trial and error that me you are I would say you're one of the biggest shovel Pioneers that I think yeah, just like Frank and definitely because like there was no one doing it. There's no road map as you said before so that's amazing. I love that you stuck it out and you're here now.", " It absolutely so I'll thank you. He's like, yeah, I've had another question. I forgot what it was Joshie. I got a ton here. I have a lot of questions as well. I just don't know what their they could be entire topic starters. So it I think you're serious here way and I'll have more to go. I do want to ask her about her experiences. Solo travel. That's where I'm thinking. We're a lot of it is like, you know dangers of travels all over email. Let's dive in have a lot of travel experience when you", " Left for a year in the first place and then you just did it and like you know for a lot of the people that you know follow us or engage with us with high on life. They have a lot of questions about you know, what's your do you guys even have advice for you know, I'm a solo female traveler. I want to go for 1 to 2 months low-budget. Like can you give me advice or is it not am I talking to the wrong people before? I mean, okay before you answer that I was going to ask you how many so countries. Have you traveled to solo?", " Time up in 2010 lessons Harlequin 10. I did a lot more my solo travel kind of earlier on okay in my like career. That's my trouble. It's real don't you? Yeah, I did a lot of my early on or I did a lot of traveling a lot of my solo travel would be in between like other projects, but I would just go solo okay to it. So I", " Yeah, so it'd be less than ten. I'd have to like think about it ever really alone when you're told her yourself but New Zealand be the longest stretch by me. I moved it to different countries by myself like London and New Zealand where I knew nobody and just kind of sound roommates and found friends and found jobs. Yeah so back that's kind of like the thing about Scylla travels. You're rarely actually by yourself. Yeah, when you're solo traveling like your verify early. I'm actually yeah.", " Like it's very rarely that you're by yourself. You spent a lot of time with people if you plan it that way, especially if you stay in hostels are going to always stay in hostels the majority of time when I would solo travel because then I wasn't so drawing anymore. Then I would meet up with I make friends and exactly the point of a hostile. Yeah, they're perfect for that. I mean it's difficult depending if you're an introvert and extrovert and sometimes you would prefer maybe the alone time but to be with people at some points but hostels I find you have to actually go and find time for yourself.", " If you were really wanting some time because hostiles are just vibrant and full of fun people. Yeah, but uh, yeah of travel around New Zealand solo China Argentina Chile other parts of like Thailand down. So easy Charles was like my first guess would like to Parker's question of like", " Or sorry well now I kind of want to get into language like China or chili is your average person you run into speak English there to like in China. No and chili not so much either Santiago. Yes, it's bigger city, if you're talking to like if you're in a if you're in the more well-known spot or any kind of tourist spot than they'll be someone who speaks English Okay, so going into a place like China or anywhere outside of Santiago in Chile.", " And your solo female traveler, you don't speak their language. What are you doing to get by like, what are your first steps of letting? Okay. Well, I'm here at the airport and I need to get to here don't speak the language and they don't speak mine. What do you do? Make sure you have a cell phone plan that works. So make sure you have data the majority of stuff you can find is on the Internet. It's very rare that you will especially you never solar travel before yourself. It's very rare that you'll end up picking a country that nobody else's soul.", " Oh traveled in before so that's the that's the beauty of 2019 that didn't really exist in 2010. No, but it exists in 2019. So first thing you do is you figure out how to get from your hotel airport to the hotel. You have your obvious choices your taxis your cabs, which is a solo person. Yeah. It's pretty safe. You're going to get there. You're going to pay a lot for that service. The other option is your public transit and that's I mean", " Public transit is pretty safe. I've never ever had issues with poly transom generally because it's public. There's a lot of people around you stuff's not gonna happen. Maybe if you're in like in a crowded train and everyone's squishing together, you might bump button awkward part with another awkward part, but like, you know most of the time it's innocent. It's there's like if you're taking any kind of like Metro, it's their CC cameras anywhere. It's generally really safe as a Solo Traveler you can get around them.", " Public transit pretty easily. Yeah, and you save a lot of money to I think the difference is that long and public systems don't necessarily speak English in countries that are pretty foreign. And that's so for me when I was first starting out. I wanted to see how much money I could save and but it would be hard to ask for directions or what is this my stop or like it's awkward because you were the bunch of people and you stand out and that feeling of you know, being the only glingo or just like person that's an outsider is kind of a bit daunting at first. I found definitely need to know.", " Stop is and I like to know like the map of the stops. So I want to know like always know what your stop is. So you'll look up the transit map or you'll look up the bus route map and you'll see where does it go? And I'll look up the stops that it goes like in between. I'll look up all the in-between stops so I can see it or hear it like if it's getting called out or I can kind of know where I am. Like if I'm not able to track it on my phone or something like even just using Google Maps. You can kind of look at your phone and see where", " You're going and you're getting close to it. Sure. So, you know, like what am I going to get off? Because sometimes you don't eat sometimes it'll call it. You have to just kind of look on this side of the road of like what's your stuff is just knowing beforehand. So like yes, there's a little bit more planning involved but internal public transport spray safe at night though. You got to be careful. I mean like a South America. I was warned many times by people not to take public transit at night as a female as a solo female. Why is that? Well also,", " No, I never took it at night but I wasn't going to take that risk, like when people generally want somebody warned you of something in a country. You take their advice, right? Yeah, the locals now. Yeah, if somebody is going out of their way to actively like give you a tip on something you should should take it should take it. Yeah, I think so. Yeah, there's a reason that person just told you something not a bad idea. Yeah heed their warning you just reminded me of my first trip by myself was the Thailand and I got to Bangkok on my first day. I took the main man.", " Metro but I don't think I Google Maps back then. Oh and I just remember having to listen to the name was a system but I didn't know it's goes complicated as like you stole a bunch of trains and directions and I had to listen to the name of the place was trying to get off and I didn't know any ties. So it was very gaunt was very difficult at first, but I figured it out. I got this Mark and I made it all the way back to my hostel and I was just like it was it was thrilling though. It was thrilling enough kind of legs. It is jam-packed as it usually is it was I was on that Metro last year and you know you", " The ticket counter you're trying to pay you realize no. No, you don't pay you here you get a card and then you have to move over to a different counter to take that card and then you pay for it or something. It was just really strange and make any sense and you don't have the language barrier. So public transit is hilarious sometimes but I think it's an experience. I think it's more fun than getting in a cab, which is more expensive and easy if that's your mindset. Yeah, a lot of people who are you that's a nightmare that just like the worst thing ever put me in a cab. I'll pay whatever just getting straight there.", " When I have a lot of stuff like generally from going from an airport to like my accommodation or vice versa then I like to unless it's a straightforward like public transit. Wait. I know okay just hop on this bus or open this like Metro or whatever. I'll take me there then. Yeah. Okay take a cap just because like when I'm can't travel with a lot of stuff. I feel like it makes you more of a Target. Yeah, not just because of", " We'll just because I'm a foreigner and another country just makes you like stand out more where it's like I'm a lot more lead like I travel way more on public transit when I'm not carrying all my stuff and I'm just on my day bag and I'm just going out and exploring. Another thing is just being confident like after you've done it a few times. You know, what that like, most of this public translates the most bus systems. Most mattresses is most train systems. They all kind of run the same. So once you've kind of figured out like", " How to use one of them the same idea applies like you pay a ticket? Yeah. There you go know what your stop is. Yeah. I mean I have to transfer I think for any traveler Solo or whatever. It's just a good rule of thumb to not hang your expensive camera off your belly how money in public this is kind of ruined just don't do that. It's like being confident and not making yourself a Target essentially. They don't flash expensive things unnecessarily, I think yeah, there's a whole kind of rhythm of being a smart traveler and", " For yourself in situations. Have you ever been in like a dangerous situation as a Solo Traveler?", " I've actually pretty lucky. I'm not a lot of dangerous situations. I've been in like maybe some semi uncomfortable situations where I'm like, it's really like a couple nighttime. Once I times always sketchy. Yeah and items always sketchy as a solo travel. I try to avoid it at all. Like I'd really try to avoid it any kind of travel at night time if I'm ever going out if I'm like, oh I want to go out for drinks right want to go out here at night time. I'll always try to find somebody to come with me.", " Yeah, I feel like that I would do even like him and coover. You don't really want to go by yourself at night. That's just one a lot of bad things happen, especially in a place. You don't really know. Yeah. Well during the day though. It's pretty good. Like I had pretty good luck. The only times you only want to be a little bit sketchy is like", " When it's quiet, so the more crowds the more people that you are that are around. Yeah, the safer you feel these I feel ya because there's a lot of you can call for help you can you know, like you can if some if somebody's something bad is happening people there there. Hopefully the more evidence Samaritans. Yeah be there as well. Yeah, and so like it really isn't that like, oh my God so crazy. It's when you're alone like that's when it gets", " It's like if you're alone on some Road and this random car of guys drive up and you're like, okay, what do they want? Like are they just trying to help me like, you know Avenue? Yeah top and but like I've never had really bad situation. So I don't put myself in those situations. Like I try and avoid being a completely alone in a completely deserted place where it's might not be a hundred percent say if I keep to the main streets, I'll keep to the main areas that mean like toys.", " He spots you don't have to pick the craziest touristy cities, like just keep to the spots where you won't stand out as much where there's people there that can assist you and not just like dangerously assist you but assist you with what you want to see what you want to do. Like, where's a good place to go eat? Most people will help you like most people generally I feel like want to help you especially if your solo yeah, and yeah, I mean all goes down to like if you ever want to be around people just gonna friggin hostile. It's exactly is that easy? Yeah and one", " I was just I was doing some research on just so traveling. I want to come with a video about that soon. It was just like be so selective with your first country if it's your first time and like I know Thailand was a great one for myself and a lot of people but like there's places where the you the locals are the friendliest like I would say in Bali or Thailand compared to maybe maybe Mexico or something like that. I don't know but it is but like group they just wanted to burn. Well, there's want to go in like Bali they want to go they run on Carmen pretty much they want to go and help you no matter who", " Right. Why didn't you just say before we start the podcast that 64% of solo Travelers are female right now director or more solo female traveler in there are male and his moment which is a pretty cool statistics analysis is now are they introverts or extroverts? Are you an introvert an extra boat? I'm an extrovert. Okay. Um, she ain't drama drama. That's right. That's right. I think there's a good mix. Like I definitely know that there's some I'm like", " It's very popular bloggers that are very introverted. Yeah, they are writers. I mean if you're generally a video person you're not very I don't know very many introverted travel vloggers. We tend to be very bright colors on here just like filming ourselves and doing all this crazy stuff enjoying myself introverted Travelers can be writers. Okay, they absorb and then they'll go back and they'll write it my personal experience and those are true with", " Like my friends that are interested but right yeah. Yeah for the viewers sake and I'm we get this once in a while a lot of people ask, you know, solar traveler female yada yada. Where should I go? What should I do? What place you gotta yada? Yada ya what I want to ask you for the audience is", " Could you name a couple of countries or places in particular that you would recommend avoiding for a first time traveler or a Solo Traveler first time traveler first time Solo Traveler either or just maybe some sketchier places that you didn't feel comfortable or you aren't sure or maybe the you know, one reason or another where you just you wouldn't recommend that one South America is a continent is a trickier place to travel to I don't recommend it for first time travelers hundred percent.", " That includes Central America, I would say as well thoughts that came to mind for me like Honduras and then maybe Columbia I haven't been to Colombia. I just under stories and that's not really fair Nicaragua. I've seen some some jumping's and some of my friends got jumped and Rob would say the student hostel in Brazil and every night. Someone would come back with the story. Wow, but that's not like say that like you're not paying a brush, but it's just not I don't recommend something America for further.", " First time travelers at all. I think it's a beautiful place travel. I love traveling South America, but it's nice to have a couple other experiences before you jump into their I did feel when I went to South America and did Colombia Ecuador and Peru that it was more on the advanced side of traveling for myself. I actually got myself into them not hairy situations, but like uncomfortable situations because I was just not traveling as more intelligent as I should have been and I was like, okay, so yeah cool just being mindful of that, but you're right I got", " You that at least the places I went to you had to be a bit more aware and be a bit more experience. This was very helpful down there. So where were you can recommend then for first time travelers for Solo or group anywhere that speaks your same language first off. We're English speakers world now, right? Yeah, right. So anywhere that speaks English you just going to be able to get by a lot easier with everything. Yeah. So like for us it's like UK America New Zealand Australia even", " a whole chunk of Europe southeast Asia. They all speak English in South East. Asia Southeast Asians, right? Like so it's anywhere that speaks your language. First off is going to be the easiest because even though you don't know anything and like everything is new you can ask you can get around communication is a huge aspect. Yeah, for sure. I think that's number one is having the communication barrier down second. I would say is a high countries or places that are very high tourism places. Yes, okay.", " You're going to be dealing with a lot of tourists, but go slightly in the offseason. Like don't go peak season and you'll have a good time. But the reason I recommend that for first time travelers is because there's a lot of information out. There are well-worn their well-traveled there is systems in place like you don't even have to do research and they'll be signs everywhere of where to go. So it makes it a lot easier if you don't speak the language to kind of figure out where to go what to do it cetera. You just got back from Korea.", " South South Korea, we don't know think it created is well, that's what I'm saying. Like, oh people you go. There you go to North Korea and from what I hear they have a good time and it's a beautiful country and it's a great experience. Yeah, there could be bad things that come of it. But like you know, how was how was South Korea for you? Like, I guess I've never been I don't know what to expect necessarily. I haven't done any research, but, you know, just talk about Korea North Korea or whatever like got to be careful.", " Do you feel that's the case at all? I know you weren't in North Korea. But like what are your thoughts just on the subject of it like this it seem like a dangerous place. It seems sketchy. It just seemed like tourist aren't welcome. Like what do you think? Well, I don't know about North Korea since I've never been there. So I only went to Seoul in South Korea. Okay soul is very modern. It's a very modern city. I mean half the electronics in this room probably from so all the color and it's Korea, but they're very very Progressive.", " Massive like a lot of people's a lot more people speak English than I thought also a lot less. They have a lot of different. They really open to things. They're very like they have their Kpop. They have all things that they're they're moving towards. It's a great country to travel to I mean, I felt like it honestly it might be uh, Vancouver a lot like Jimmy Bentley. So that was my experience. I wasn't there for that long I was in there for about five days, but", " Yeah, they're apparently right chill it and I posted my last story today. That's over it. I'm recovering from jet lag. Well, thank you for coming in today. Oh, thanks for having me. That's what North Korea is. I don't know. I've never been there. I can't speak on it. I there are places that I just I know like my goal is a traveler. I'm not trying to check off every country. I'm not trying I'm not I don't have this crazy running tally like I know that's like", " Let me gloat my countries visited number 52. Okay traveling since 2010 night. My country is only numbers only 52, which is not that big for someone who's been traveling like pretty much full-time. Yeah, because I like this I like to revisits like I revisit countries I spend longer time in places. I also spent quite a bit of time at home like decompressing because trouble is exhausting and like especially doing it as a job as well as there's a lot of behind the scenes that needs to get done. So I spend that at home and I do", " Boring stuff in pajamas. It's really not that entertaining necessary necessary to and also like it's necessary to prevent burnout and to make sure that you have the energy and you can do that. You can sustain yourself and keep going year after year after year. It's important to take time to yourself plug that's important actually because like a lot of people say they've the trying to get the numbers of the trying to you know, be this many countries, but like there's a difference between going to a country and getting to know and entire country.", " The airport trick. Well, I stopped over here like yeah. Jesse came to this country is a I've been to Peru while I was there for Larry six days spent most of it in Cusco and I had an amazing time there, but I wouldn't say I know Peru very well. Yeah, so like I'll put it on my list sure, but I want to go back ASAP and just really get to know the country Mmm Yeah. I think that's true. A lot of people with the those lists. They don't spend a lot of time. They'll visit like one city for like a day or two and then be like, oh I saw this.", " Currently. Yeah, I mean II I've been to countries to that. I've spent a few days in the city. I got you definitely get a flavor of it. You definitely could see went to it but there's so much more to explore and I want to go like Explore More countries and more than that. I think I've heard this mentioned before a few times and I think I want to bring to light another maybe way that people look at it not so much as a cultural aspect of I wanted to learn this country or be in this country. Maybe just geography geographically or", " They want to hey, you know what? I stepped foot at this area of the Earth, which is in this country. And therefore I have walked in this country. I can say that I walked here. I've been to this country. Yeah. There's a ton that I don't know about. I mean, there's a ton I don't know about Canada was born here raised here and lift your time. However, many years 30 years. How many problems we have? We have ten provinces. Okay, good. I didn't return good job the second largest country in the world continue that thought because that's", " So I just think like for I guess maybe I'm thinking about myself when I started doing the number game when we started actually getting into consistent travel was like yeah. No, I guess I we did go here. We went to Vatican City. That's a country I'ma put it down in the list and they're like, well, we didn't do anything there. You were there for two hours. Maybe what do you what are you saying that you know about it? I'm like, well, I'm not really saying that I know about it. I didn't learn everything about it and learn very much at all at all about it, but I was there.", " On the other side of the world in this one location that is known as this country or whatever. Therefore I think that should count because I'm not trying to say that is not a competition want to say that I was there in the world. So I don't know. I just I think maybe a lot of people look at it that way I'd say it's to each their own like as much if you've you feel like you really want to get culturally involved and like learn the history and taste the culture and everything like that go for it. But some people just want to", " Maybe just be in the touristy locations and take selfies at the Eiffel Tower and that's cool too. I mean all that to say everyone has a different taste each their own or whatever, right? Everyone everyone. Everyone does definitely has what is what is your definition of travel for you experiencing something different? It's something that you're that's not necessarily in your backyard. It's just seeing sites that are new tasting food. That's different.", " Dancing cultures and just seeing little things to it's like seeing how their stop signs or shape slightly different than our stop signs. Like it's little things like that that are kind of cool like, oh they have different brands for their muffins. We do like it's just it's little things like that and big things like combined to me. I just like seeing how crazy how different the world is and how different Customs are", " In all of these different countries because we all grow up it grew up in an age of Internet. We've pretty much had it all our lives and when we were younger not so much but we've we've essentially grown up with it. Every other generation going forward will have had it since they were born so they have all of this knowledge that shared from around the world at their fingertips, but the world was never was not like that for", " every many years Pat like thousands and thousands of years beyond that. So it's interesting to see how all these cut like Travelers were how sit like, why do we have different plugs around the world? Okay. Why is this is here's a little fun thing for you cool. Why are there different electrical outlets? You'd think okay. Why don't we just have one electrical outlet that makes the most sense like why do we need multiple electrical outlets when it's all the same thing. It's to provide electricity.", " Because there wasn't the internet because information wasn't was it able to be shared like that. It's because one person thought oh, this would be a good plug like type and another person thought. Oh, that would be a good plug tape around halfway across the world and it wasn't until people started traveling with their lamps because they wanted light they would travel with their lamps. They realize oh, my lamp doesn't work in this plug and now we need adapters. So that's how the first adopter was created. All right, make sense. Yeah.", " So it's but like that world isn't going to exist anymore. So all of these similar human traits were all kind of like invented in shared but we discovered them by Travelers is just now it's on the web. Well sort of a tangent. Oh, no, that's great. That's amazing. That's like thinking about my folks who were big Travelers before they even met in their 20s and everything is like they didn't have Google Maps and have iPhones they were doing this before the", " Age of information that's easily transferable through the internet as like wow, like I would imagine going somewhere without my phone I could do it, but how much more challenging it would be or how much like the internet is so accessible to us and like almost that was like I was like the real traveling for sure doing it, but it's a lot easier for us now people travel for information. Like the first traveler is what they would bring back. What was information was like, wow, I went to this place and they were doing this differently and it was better.", " Iraq skin beavers and make hats out of it. They're super fashionable. Very warm and minimal Mercury like you guys got to try these boom. Yeah a new fad. How long are you home for this stint? Like are you packing it in for a little bit before your next adventure? Potentially. We have a lot of like work. We need to get done to like plan for April. It's like it's so funny and April 3 or 4 days away. That's generally like we don't find out about stuff until like a week before.", " And the worst it was like we were going on this job and we did it was the night before and we're like, we don't even have plane tickets yet. Like we're supposed to be there. But okay, we're setting that literally the night of we got the plane ticket. Just don't by the seat of your pants. Even though it's yeah so many years down the road that's great is realize that that's that is how most things work is very very last minute. Most get like most jobs are like two weeks out. Yeah, like that's I would say that 6,000 jobs when I was", " when high on life was getting a little bit more serious about this as a career as a job Riker and Alexi forced me pretty much to quit my bartending job there, like just stop it. I know it's easy to have a little side job and you can quit your job if you can't get time off and get another one when you get home, but like we really need you to just be able to make a decision on the spot just in case that should happen and sure enough like a couple of weeks later. Whatever. We got a call from a company being like Hey, we're doing this thing out in Montreal. Can we fly you guys out?", " Morning, you're like yeah. Okay - hey Parker. Have you quit your job yet? Because we're leaving tomorrow and I'm like, well, I guess I'll make the call but ya know some of them are super last minute and it's all McQueary. Yes people like we're going to we're gonna go with the opportunity. Everybody's in this industry. You have to be a yes - yeah is opportunities come real quickly and you have to be able to jump on them and no regrets. No regrets. I do want to ask you you've been filming.", " Going by yourself pretty much the whole time or you have a another person fill me up till 2017. Yeah your phone by yourself my cell types 2017 and 2017. I got my boyfriend and I got boyfriend Instagram boy from her face and he said yes to that. So is that made your just the shooting process of blogging and everything a whole lot easier just having another person. I mean not only just like the gear like full-on.", " I was like carrying all like my camera stuff. What were you carrying for? It was the Canon 70D and then I upgraded to the Sony a7s Mark 2 which is the still my main camera and now I'm seven eight. But now I've got new Sony they 6400 and he had the Sony RX V RX it like a phoretic gh7 I had a mark for like the small logging camps PowerShot. Yeah.", " It's actually I mean that's power shots where I started so so I just small camera that I upgraded to like vlogging with a big Cam and I went back down to like small camera and just hold the camera to use like a gorilla pod or what do you do? Um, I didn't make sure of GorillaPod when I would do by myself or a little like Sony grip so it's like a little yeah. Yeah. Okay, cool. But yeah, so before I would just be like juggling two cameras essentially it when I was doing a lot of it like I myself I would just like a side.", " Jean had like my main camera but it would have like one lens and that was like the everything lens and then when I was like I kind of want more than just a wide angle for everything. We came all the trickier. So I found his love it easier to do a smaller camera like to have two cameras. So I'd have like a vlog camera and then I have like a big camera that would do the more cinematic stuff. And if you like make all the pretty things, so did you learn how to do all this cinematic stuff? You know up until 2017. Yeah, so just by doing it. Yeah.", " By watching other like tutorials and that's the beauty of a 25 information and up and you can just YouTube everything there aren't everything and then Matt self-taught stock my boyfriend. He's the one that helps me now. It's so much nicer having another person one. It just makes filming a lot quicker to its it helps a lot with photos. It helps more with photos than actual video. I find because with like video I could just do okay Val.", " Talk about my stuff show my experiences and then do some b-roll clips. It's fine. I can make a whole video on that. I can I can tell a story I can capture the visuals. I want I could do it all by myself photos are very hard to have you in a photo and then how well and then like the timer or whatever right? Like I hate hate tripod. So like I would never travel I would always just be like ask. Okay, I got to have this got to be spot with his other people and then asking them and they like, okay, so set it up like this and then", " Then they give you like two photos and one blurring you kind of want to start the sound you want. Yeah, if you want to up your Instagram game, you gotta have somebody else taking photos selfies only go so far you really do at least. So is he the one taking all your photos right now on your answer is always it seems pretty he's got some good photos on that most of you but I mean that's that's what other photos but he doesn't really post them on his room. He just kind of has like his own collection of photos, but they're really good and he's also", " Of ties was really so you can filming by yourself. Where you editing by yourself. Yeah up until about 20. He's 17 ish as well. Don't worry using to edit a premier. Okay? Yeah used always use Adobe Premiere. Yeah, he's a Final Cut Pro user. Now. He's got me converted. I'm started learning it yet, but I'm very close to gotcha. Yes pondering both I'm taking about Sonny has not broken wife. Yeah. Yeah exactly.", " I was going to say I admire something about your videos is that yes you go out and you're filming your vlogging but a lot of the videos you film or just in a hotel room in your own bedroom in your in the airport simple places, but like almost when I watch them they're comfortable because these are places. We all kind of like we're in hotel rooms all the time. We're always an airport floors and you make good informative content. Just wherever you are. And that's something that you've appealed to just put out there. You don't need the most amazing setting backdrop. You have something that's I'm here and there.", " We're going to make you a video about airport tips. And and it was great. You have you always are putting out really good information as feel like it's very as just someone who's interested in traveling so accessible and it makes you feel like oh she's doing this. She's give me really good tips. I can go do this. So I think that's something that really appeals to me about your content already question is one of the say that I thought there's a question that that's great because a lot of people need the like super dope like expensive Lighting on stuff but and use some of your stuff is beautiful and cinematic to but you also,", " Down-to-earth content as well, which is great, which I think we struggle with sometimes it's trying to you know, keep it down to earth. Well, I'll just keep it something for people to connect to to relate to get engagement aspect because sometimes you know your personality think about what we're used to shoot we could just probably get information. It's really nice when you have pretty visuals. I love Prema Jules. I love the Cinematic b-roll shots and just like capturing the beauty of a place but it's very easy to get wrapped up in that and not think about the", " You're not thinking about what you're trying to tell her what trying to teach your way you're trying to this and like I went through a phase of like really trying to like perfect everything and I've kind of regressed from it a bit and trying to be like, you know, what doesn't have to be perfect just do it doing is better. What is that saying about like done is better than perfect. Yeah. Oh, yeah. So like you can get really really wrapped up and I know other filmmakers that could really really in their head about like I need to", " at the best travel video and this is looks like so when you're just starting out to it's really eat. It's hot when you compare everyone compare themselves. So you go all my videos are not good. I need to try harder. I need to make this an it needs to be perfect before I put it out, but you learn by experience you learn by putting things out and seeing how it does and and seeing what people like and working it that way. So like the more you do it is when you're wanting to learn is better than just putting out one perfect thing. I think that we've all struggled.", " That actually even as like a collective team with high on life. If it doesn't achieve the highest quality standards, we're not going to post it and that has heard us in the past because next thing you know, we just aren't posting anything because it's not hitting these standards that we want to try to hit it. It's not the best post. It could be here. It's not the best edit or best whatever so we just don't post it in the next thing. You know, it's like well you guys are going to post anything again. It's like oh, yeah, you're right. I guess we have been lacking and then and then you've hoped yourself up and he like a man because", " I haven't posted so I got to post something good and just getting this vicious cycle into a cycle. Yeah, I was feel like that when the reality is the viewer like I watch a lot of YouTube videos and I'm sure you did as well. What's you watch what you watch a lot of content and but you don't think of it like as a viewer like I'll click through and I can watch like ten videos tonight or what I said or something maybe not 10 times my videos night that be a lot.", " But you know, I'm not looking for. Oh, wow. That's the most perfect one. I'm clicking on the videos cuz like oh, I really want to watch that. I want to watch that one watch that and and not all of them are going to be perfect. Yeah, and am I going to ding you because your video isn't perfect know because the other person is probably wasn't perfect either sure so like but I'm watching it because I wanted to see something from you and if I go weeks and weeks and there's nothing from you then I just I'm clicking on other my other subscriptions and the other any algorithm. That's how the rig. Oh, yeah.", " The algorithm. Thank you as well. So that's why it's I mean with you two. It's always they always favor consistency, which there's always been a backlash with backlash from craters. Well that too because it creates this never-ending cycle of constantly having to push up content and then you can't really take breaks YouTube penalizes channels were taking breaks. It really really does and they've even they've been like, oh, no, we don't do that. They do it. How do you know how do you know they do that pretty consistent.", " Once a week because that's the consistency I can keep up with them. I wanted to do more of that and every time I do I take a step back because like I'm like this is not sustainable. It's not sustainable for I've been doing it for so many years and I still want to do it and right and people burn out after a couple of years if they're going like hard hard hard and daily vlogs.", " Our and nobody's doing it anymore. You realize that all the big daily vloggers. They stop they don't look at them to do it anymore. True. They daily Vlog to the Coptic time in and there's that now but didn't fucking is brutal. I do have a question for you. Do you think there is going to be like a time in your career when you're like, okay, I think I want to Pivot off of YouTube to do something else or", " I mean, yeah, I'm sure at some point, but I'm kind of like", " Riding the wave and seeing how long it goes because it's an amazing like job and each year. It changes in each year. There's more like more opportunities or less opportunities and you just kind of pick and choose and you're right the way the way you ride the wave until already constructed yourself a really solid surfboard in the last nine years. So why not? That's a ghetto partnered up. Yeah with with you being in the the travel game for I mean, I guess it's", " Almost a decade. Now. Whoa, how long have you probably been doing this for almost a decade? Yeah, exactly. You ever feel like inspiration is it's hard to grasp but new ideas or you're coming with those all the time. Like, where do you Source inspiration from?", " I'm going to be an awful person here and just and say that inspiration comes to be quite easily. It's fine. Um, I always I have a notebook or like an Evernote. It's an Evernote book. It's a very helpful tool but I'm always writing down ideas. So I have a list of like 40 or 50 videos ideas good that I can pull on do we see real quick. Do you find yourself? Like, you know having like an internal battle in your head thinking okay. This idea will be good.", " For my Channel or this idea will do better and or maybe not this idea but I really want to do it because of the fans are whatever do you ever have those creative battles with yourself or yeah. Well, it's unknowns. Right? So like any time you take a you I could do the same format that I've done and be like, okay. I know this what this is. It may be different like a child. He's traveled example, I can go do travel Vlog done many Trump looks I know how it works. Obviously each video is perform differently because it's different content, but I know what works.", " I can go do a gaming PC. Let's say a PC review video and I never know I'm never done a piece of your video. So but now I'm like mmm, how would my audience react to this how with this? I don't know. The only way to really find out is to try it. That's kind of been my motto. I like kind of stuff. I like that a lot. You know, I do PC review I want to do stuff and like one part it just fills you could be creative.", " You creatively because you get to experiment you get to try things YouTube. I feel like there's been like the big thing of like a lot of like networks. A lot of managers. Let people be like find something that works and stick with that. We have you ever sit down with like I have like a one-on-one consultation with the YouTube people like YouTube directly, they'll give you like a manager a partner manager that will like help you like give you like tips and pointers for your channel, except or cetera. They will always look at your top performing videos. They will always look at your videos up on the most subscribers in", " go do more of those. It's pretty simple. But yeah, it's not like it's flawed. No, no. No, it's not like it's flawed advice. It's good advice. Yea OK do more of what works what creatively how is that going to fulfill you as a Creator and are is that something that you're gonna want to do for the next 20 million years of your mom not trying to be realistic here. So what are your like most Pro well-performing videos if you had to follow that advice?", " Well, I'm one of mine was that Warcraft already. I don't do it all so see if I took that advice. I would still be doing more crafts videos. I was kinda known as you did you do a lot more skits, you know back in the first few years of making videos. Are you still doing skits? You're not can we help convince? You skit with us because I don't know. I don't know who it depends. I mean, it depends on the skin, but it's was a Content that I like doing at the time and then I moved on.", " And I like to gaming content for a while and then I moved on and I like music parody and then I moved on and YouTube changes to YouTube favor certain content each crazy favorite music parody back when I was doing it all people were doing it. It was what people wanted to watch. It's what people it was really fun to do. I loved creating the videos mainly because I like songwriting evidently actually really enjoy songwriting. So I was like taking well, I wasn't like truly songwriting. I was taking a lyrics just changing it up.", " And and changing it up and making but making a story out of it. Like I always would have a storytelling throughout I wouldn't just be like what rhymes with potato potato. I know I need to come up with a different word. That's like that Barker good fights of the russet potato. Go ahead. We've actually already done a Katy Perry parody together really stead of Roar. It was snore and it was about Max - so it", " like that was really big but music parody and a lot of channels that was really big back in those years and now it's not and then there were challenges that were really big and now they're not and that's YouTube skit sketch comedy is very very big character-driven comedy. And when I mean character sketch comedy is mean people in costumes playing different characters. That was exactly Superwoman and now it's not really big anymore. So called the YouTube itself as a platform is", " Evolving. So you has a crater even though you're in a different Niche. You always have to kind of look at how its evolving and see how your Niche can evolve with it. How are you staying on top of you know, this is really hot right now. That's what people are doing. YouTube's favoring this. Oh not So Much Anymore now, it's moved over to this. How are you following these Trends? How do you keep up watch a lot of YouTube videos? Okay. Yeah. It's the best way. Yeah, you you look at recommended and you look at what YouTubers are on the rise, so not necessarily.", " The most popular but what are your growth like looking for through the mouth? What's the growth rate? Yeah, and why why are they growing the most? What are they doing? That's making them grow the most there's always pockets of craters that kind of grow all together a lot of them because it cross cross collaborate but it's because they're doing something that's working at that moment. And then it's kind of watching that watching the trends.", " Watching lots of YouTube and just seeing you know, like it's there's no right answer. It's kind of making guesses. There's also like you can read certain articles on unlike trans YouTuber is not necessarily Trends because most of them don't know either. Yes, but you can read art like articles on YouTubers that are that are rising like what are people talking about on social media? What's really trending? What are a couple of common factors the stick out catch these stories and it's just guessing. Yeah.", " Best way I think hundred percent is watching YouTube videos and then when I just refresh my homepage and it caters content to me start watching new videos and like what's up and Rising is pretty much what you understand what's going on, like obviously Pete like how to use a huge peterik in and showed us that quite easily just like photography stuff and that's been a huge Trend and I think inspo is pretty big right now. Yeah photography channels. Yeah, they've blown up in the last couple years. I would say how to everyone wants to learn how to", " It's become accessible because people are teaching it and also look at what's not as successful anymore. That'll tell you what's what's for like we're Trends are going. Yeah riding elephants not successful not successful over cinematic Vlogs With No story is not a success. There was it there was this there's a spike at that everyone's doing the legs of the helicopter and a girl holding. The hair was beautiful it was because we haven't been seen before but now it's everything. I mean I enjoy beautiful cinematic blogs.", " It's but there's only so many ways you can handle like yeah, you don't want to go watch so someone's channels all like beautiful cinematic blogs unless it's like, oh my God, I'm literally like glued to the screen, which is very rare. Like you were probably a very you're a lot more successful YouTube if you're able to do that, but you're not going to binge watch someone's channel that has like five of those in a row like you're not really going to want you might watch one or two be like, wow, it's really pretty and click subscribe, but I feel like", " What people want nowadays is connection and and I feel like a few years ago. When I was on the rise in the same thing. You'll see Instagram. I feel like Instagram is changing quite a bit to People Want it they're like wow Gorgeous Beauty, like like just I can be essentially and now there's so much I can't name. Yeah, like it's my whole feed is flooded with eye candy that it's not new. It's not it's not as powerful as it was. It's just another it's just another content. Yeah, and I think people want that realness they", " and the connection. Yeah, it's good that GI G story came out because now you can do more long form content on Instagram, which I think we're going to be exploring a bit more. What do you think guys 2025 miming is going to be really big on YouTube. Why start now and hopefully that happens. Well, it's commentary that's was huge on YouTube right now. Yeah. Yeah, Terry political commentaries huge much commentary miming comments everything reacts to put you little cutie pie in this corner. You just watch a video and you say", " Exactly. Let's review Nadine's videos. I was gonna ask you I think we are actually going to wrap pretty soon here pretty soon. Yeah, that's cool. I mean we could talk forever we but your own shit probably should wrap this up. It won't know how long do people watch as well. We had an hour and a half every post.", " An hour and a half you are a trooper. I was gonna ask yours the secrets to succeeding in life. There is that you waited they have the secrets to succeeding at YouTube we could use some help.", " hmm the real Secrets ezeli YouTube", " now like if you were to start now or if you're if you're already started in your continuing, I would say both not just her for people to study him that our kids. I lie. I know a lot of people are feeling like they're behind because you choose huge not everyone's doing it, but I still think you can make it. If you have something you can always make it think about like this people are blowing up nowadays. They didn't they weren't there five years ago.", " So if you started you said oh five years ago, it's too late. I said two years ago. I'm still like but there's people that blow up in the last year. Yeah. Oh, yeah, but one thing that those people all have in common though is that they didn't just start a year ago. So when you blow up is not is no like correlation to when you started. Oh, I know many people that have been doing you do for a very long time at just this rate a very flat right and then something happens and they Skyrocket and they just keep going. Yeah. It happens to a lot.", " I think it's the biggest thing that defeats people is they think after a month they should blow up they should get even the first tank a followers every single successful YouTuber. I've watched has on this it's just as you said - are you guys watching? I'm going to bring up like Maddie employer Peter beginning again. Like he was doing the exact same videos he's doing now just with way less views but his exact same stuff uses consistently doing it and he bleeds and he liked doing it. So, I mean, I think that's that's the wise words for anyone. Yeah. It's", " only a small small percentage people get really lucky that first few months a few videos, but like they get really popular off the bat that's like one channel in like thousands. It's right does not happen and that's usually what happens. Yeah. It's a viral it's viral thing. Yeah, you do something really ridiculous or like but like if you're doing yeah, you can't find like okay, mr. Beast even for example, it has no mr. Beast. I don't personally okay. You guys should watch this channel. You'll find it. Very interesting. He's blown up.", " Lately in the last couple of years, but he was doing very similar stuff but different for many years before that. Well now we just spends obscene amounts of money on that stuff stuff. Okay. It's very interesting. It's hard to describe Channel, but you should go watch it. So what the thing that all these people have in common though, is that when they blow up the reason they're able to blow up once there's their stuff is found because something picks it up or something or they have that video is that people want to subscribe because they see all there.", " Other content if they if if you blow up unless you have other content people why they're going to stick around and be like, oh that's just a one-off video like you need that portfolio and all those people built up that portfolio. That's why like when they did blow up they were able to keep going. Yeah, we got a lot of we had a lot of people asking us, you know, because we Russia in particular release those Instagram videos how to grow your account really huge in 48 hours kind of thing and like he", " Had put a lot of time into that years of work into learning the tips and tricks of it and he posted this video and we started getting influxes of messages and if we didn't answer it via high on life and they started coming into our personal accounts and it's like, oh brother and so you get people ranging from like I've already got a hundred thousand, but I want to grow more and faster. Can you help or I've got ten followers, but I want to get you know a thousand. Can you shout my page or can you do this for me? And the biggest thing that we say to people is", " Is you need more content? You've got five pictures on your page? What are you doing? Like if you want to grow you need to post you need to have content something to show why people will follow you and that's like the biggest thing for some reason that people often don't seem to realize is that you don't have anything on your page. Yeah, everyone wants to blow up then after that like that. What do you know? You've opened your first video? It's just like what do I exactly like? What do you do? You have no Foundation. You've not you don't even know how you're", " Going to make your videos like yeah, we're just getting started. It's just a learning experience for yourself personally consistency and drive and just believe in yourself. There will always be room for new people like viewers want new all the time quite new channels new people new personalities leave YouTubers to watch you can't do you can be that new person that could be you but you need to work at it like it's gonna be a", " A lot of work with not a lot of stuff before then and it's just waiting for that moment. And you know it sometimes though. It might not ever happen. But if you at least enjoy the journey and that's the second key thing is I just something about like all of us you wanted to YouTube did you do it because there's a shit ton of money Tohono. How much is you to Beijing Parker? I want to talk about that. Yes, so there was no money either when I first started.", " And there was no money for a long long time same with a lot of the O G's of YouTube ever. So did I because we really just like doing it longer so you should like create something you like doing have fun doing it. And you know, what may be your moment will come and you'll blow up and this can be your job or career and you can go travel world or do whatever you want to do if it's gaming or makeup or whatever that you want to do. You can go do that but in if you don't just be happy that you had all this fun creating these videos like", " Don't stress Don't Like worry what every little metric don't there's so many like analytics you can be like, oh, how do I tweak this or how do I shout me out bro, how push my stuff push my this but Ilana, what are you trying to cheat? Like why like, what is your end game? I mean, yeah, but enjoy the enjoy the journey Percocet. Yeah. It's a good one. And also I said it because you said it you said and at the very least you have all these awesome videos or alone take a look back on the show French Family gang kids, whatever and that's pretty special.", " Last I heard YouTube's not going anywhere. You got content up there. It's going to stay. I don't know if you heard but like a couple of weeks ago. I think last week Myspace deleted like 12 years of music and apparently that's all gone. I can't get it back. If you had a profile there. I'm nervous engine ever had in my space my space. I don't know if ever closed it. I'm gonna write you should close this you were being into an EXO Pia. Is that right? Next. You'll be nice in your pets. Oh wait, I was into that to hey. Well you've had so", " 18 where you headed next travel wise know where the lovely fish dinner sweatpants on its way into work. Now. It's going to be you're going to see a lot of photos and videos come out. It's going to look like I'm traveling to all these while I was traveling to all these exotic destinations, but that is this like Magic by the scenes. There's a lot of behind the scenes a lot of boring computer work a lot of sweat pants. They don't see that's that's part of the YouTube job. That's part of your job has scheduled", " That content out there in planning for the next stuff. So that's what the next step for me is nowhere exotic. I just came back from somewhere exotic but nowhere exotic from the next little bit. Well showed up here in Vancouver at the right time weather has taken a turn for the best. Yeah. It's it feels like spring I think I was standing is snow two weeks ago at home. And now it was like 25 degrees last week. Yeah pretty cool in Squamish 25 degrees. Oh, man. Yeah, you're gonna love it. Right but hikes the chief and it", " toasty hmm. Where can we find your content? Hey Nadine everywhere. Just hey Nadine. Got it all dressed. Nice. I mean, I have some words of like, I don't know. I don't even know what's on Pinterest check her out on Pinterest maybe no, but it's hey Nadine everywhere else YouTube Twitter Instagram Instagram Facebook the Jazz the important", " So important. Well, thank you very much for joining us today. Yeah, thanks for having me. Yeah, super stoked you came back and despite the jetlag. You join us here for those who say one good day of know carry water but a good hour and a half of chatting normal. Thank you for tap water is well, welcome back. Let's tap water in the world. So sure is. Do you have any last minute of last second truth bomb to drop on us? Oh, no water's water.", " Be grateful you have some that's right. That's a good one. Awesome. All right, I guess note on that note. We will end the podcast right here. And remember you can follow us on Instagram Facebook Twitter and all that. You can get our podcast on Spotify and Apple iTunes songs made apple pie. Okay back next week with more stuff. Bye."]}