{"showID": "0A4ztiz48hDGPJyf0HECoH", "show_name": "Free Neville Goddard ", "show_description": "Law of Attraction with Neville Goddard. Neville was the mentor of Wayne Dyer and the godfather of the law of attraction. He makes Manifesting easy and fun.   This daily show is FAST AND FUN, hosted by Mr. Twenty Twenty and he loves answering your questions. Feel free to email them to him...", "episode_name": "Free Neville Goddard ", "episode_description": "Law of Attraction with Neville Goddard. Neville was the mentor of Wayne Dyer and the godfather of the law of attraction. He makes Manifesting easy and fun.   This daily show is FAST AND FUN, hosted by Mr. Twenty Twenty and he loves answering your questions. Feel free to email them to him...", "transcript": ["Already Sue. This is what I noticed.", " These are some bits from my personal philosophy. They may or may not totally overlap with Neville. I really don't care and I'm going to be really honest with you. I am not a Neville Goddard expert I love when people say that about me. Oh, he's an expert in the works of Neville Goddard that no, he's not what I am is I'm an expert in my life.", " I just happened to have found a fellow that I can relate to his writings describe what I perceive and they actually help me examine what I do a little bit more systematically.", " She maybe you notice Neville Gave Over 400 lectures. I've been told the numbers actually closer to six or seven but who am I to say?", " But over let's let's assume we did 500 talks and call it a day, right? And yes, he gave some free ones way Andy charged and made some damn good money. If you look at the dollars, he charged in today's dollars in the size of audience that he thought he had right think more like Tony Robbins, right? So here's the deal guys from what I can tell we came here not to keep calm.", " And I noticed so many people are trying to do what I call Keep Calm manifesting. In other words. I'll hit the lottery and things will calm down. I'll have my soulmate my special partner my ex back and things will calm down. I will have a $10,000 in the bank and things will calm down and I'm not a fan of calming down. I am a fan of Making Waves.", " See really take a look at this stuff because Neville says what we are is essentially the Elohim the one that makes up our the many that make up the one.", " Get your awareness of being as God you don't have to align yourself with Source. You are what gives life and it's these tiny little things where when you play enough you begin to notice this and you may even get to experience what novel called the promise but I'm not going to go into that here. Believe me that is a very real series of experiences.", " But I want you to get this you came here to make waves. You came here to enjoy giving life to your desires that includes the desire to wake up, but meanwhile", " One of your options is to judge. Oh, I'm better than you because I do not eat meat. Oh, I'm better than you because I do not seek wealth. Oh, I'm better than you because well guess what Neville enjoyed wealth. He enjoyed meet he enjoyed liquor. I can guarantee enjoyed sex because he had two kids right I suspecting Georgia more than twice.", " But I want you to get this shoe came here to experience your wishes fulfilled and to no imagination.", " You see Neville says we came here for Divine Purpose. And I totally agree with this we came here to no imagination. In other words to know who we are and how this works and you're not going to get this as far as I can tell if you're avoiding your desires because I get a couple kinds of emails to tell me people are avoiding desires. Well, I no longer truly want anything of this world. Alright, so why are you emailing me? Well, I went to some help with well, you want some help that's of this world next.", " Right. What are you emailing me on all you got an iPhone cool, we guess what send it to me. Well, but I enjoy it. Yeah for God's sake notice you have desires and give life to him whatever they are. And then here's the thing spiritual desires versus Earthly desires. That's a war. You don't need whatever your desires are. By the way, you'll notice that you have a lot more than you. Probably notice. You have if you", " If you notice you secretly have doubts pretty much everybody does they secretly doubt they can have what they want. So they ignore that they desire things right? I don't desire money. I just want donations to keep me going.", " See that's a typical quote-unquote church thing see Neville charged for lectures. He didn't charge for all of them. But he charged for enough right made some good money. He didn't collect tithes. He didn't believe in guilting people and to money. All right come in and give me a tithe. Nice. They look here's the cost of the lecture. Here's a cost of a lecture series.", " Right study, you'll find where he says he charged and this is the other thing.", " Don't be afraid of being worldly. It cannot possibly get in the way of you being spiritual and it just might be the path in which you notice who you are and how this works. It just might be how you actually discover the pattern within you that Neville talks about.", " Give life to your desires remember, how did the blue while Neville was in the whole process of this stuff? He had this desire to go to Barbados. He also had another desire to come home different trip couldn't get tickets. He had a desire to give his brothers opera tickets to a sold-out show. He desired for his friend to have 250 or 300 $50,000. I think that was in the 50s that's worth like well over a million dollars now.", " But but his desires as far as I can tell he discovered how to have desires without having them become cravings.", " You get it I desire to have fun with my wife, but I don't crave her.", " I desire to do fantastic in business, but I don't long for it.", " I love when I teach workshops and we get 12 people here for a little private event or many more for something bigger.", " But I don't make it about you.", " I make it about me having had a great time and me enjoying your feedbacks your successes. Gotta Clear My Throat on them. Hey, let this be all about you and the ways that you make and you won't have to seek calm or peace or an escape from the world.", " I talked to so many people and they tell me I want to travel and I tell them I couldn't relate in a way because I want Adventure and the thing is I have Adventure every single day and I can travel.", " But you get travel is about out there. Feel free to do it if that's what you longed for, but I suspect what you truly desire is Adventure.", " It even this podcast from he's an adventure I get to discover. There's about seven things. I want to give you in a typical podcasters four to seven goody bits that I want to get out that I want you to have because all I want is more playtime and more Playmates, but here's the deal I get to have an adventure of doing a podcast and notice how they weave together.", " So one more I made a little video for the dream driven day folks the other day because I went to the pool. Let me take a sip of coffee.", " Damn, that's good. So I went to the pool the other day and her sister older lady there. She's got a little dog actually a couple little dogs. One of them's name is Jack Jack and Jack Jack's a little Damon. He doesn't put up with any shit, which is great around them and Bruce, right? So I'm talking to her and she says like what do you do? Do you work? Are you semi-retired?", " Because I'm told I look like I'm in my early 40s. I just got complimented by a fellow the other day. I think he was hitting on me cool, right? I'll take a compliment from anyone.", " so", " I tend to be told I look like I'm in my early 40s and when a woman says to me, are you semi-retired because it doesn't appear that I work. I've got a lot of free time. I've divorced time from dollars, right but a life where I have systems in place where I can have impact make decent incomes and not have to be a slave to Any Time Any kind of routine.", " Well time clock I've got lots of yummy routines, but she asks me if I'm semi-retired and I realized that's it. I've won I get to win bigger now. But yeah, I have created a life where I appear to be semi-retired. I do a lot of play every day. We do little podcasts and shows and quote-unquote customer service answering questions setting up the next show. I mean, that's all fun.", " And I do it was someone that I loved from a place that I adore.", " This is all I went for you.", " And free to come on down meanwhile.", " From what I can tell it's really easy to get semi-retired if you imagine what works and if you use the tools see I didn't imagine up a life where I calm I imagine a life where I get to fully Express me and my zaniness and both my worldly and spiritual adventures. And here we are.", " Alrighty, so if you got gold let me know. There's at least seven little bits in here that", " that will rock your world. Again. This is just a little bit from my personal philosophy and experience. I'm not a Neville Goddard expert. I know a lot of this work because I can relate to it very well. It's funny because sometimes when people put quota put up things which are derivatives of devil's work. Well the I got I added this in our I pulled this out to make it easier and buddy of mine. Did this the other day it's like not any right there. There's something missing there. There's something off and sure enough. I look it up because it's off with me. There's", " Thing it's like no Diana something with Neville's experience wouldn't say it that way big key already guys. Visit us at free Neville.com. If you got some gold from this get on that two-to-one email list. You'll see a box. They're putting your details click on the confirmation link. We send you usually it shows up in your inbox. It may show up in promotions or junk mail, depending upon your email settings, but 220 ml is to free noble.com that pseudo", " them goodness like this podcast. Just something whatever's on my mind. That's what I send out. Meanwhile, if you want something really cool and structured takes about 15 to 25 minutes a day to rock your world manifesting Mastery course.com over 85% of our success stories come from there and I've got like five or ten times what we've published that I just don't get around to publishing.", " So that's manifesting Mastery course.com.", " Give up a donut change your life and meanwhile, thanks for listening. And we really appreciate your ideas and your questions for the shows and for the podcasts and I'm going to get ready and take them down eggs to the dog park. See ya."]}