{"showID": "0A5BLuSdVS2uQCC8uiuO2N", "show_name": "Justbrandi", "show_description": "How to START your healthy lifestyle", "episode_name": "Justbrandi", "episode_description": "How to START your healthy lifestyle", "transcript": ["I often get asked how I eat what I eat what I ate in the beginning of my weight loss journey, and if you followed me for any length of time and maybe you read my blog all those years ago. I started blogging in 2008 and I talked about everything I wrote about the meals that I would cook at night. This is before I even had children, so", "I had a lot of time on my hands and so I would often write about the things that I did at night and the recipes I would cook in the things that I would try out and then once I started losing weight and started my weight-loss journey, I wrote about the things that I would eat then the meals that I would have and looking back on it and thinking about the way that my diet has changed.", " Changed over the years is has really been a process, you know in the very beginning. I knew I had to change my eating habits. I knew that I needed to stop eating fast food 3 days. I'm sorry three times a day because that's what I was doing. I got up in the morning and I would swing through Whataburger.", " Myself a breakfast on a bun I think is what they're called. Maybe it's maybe it's called a bob. Anyway breakfast on a bun Bob and a large Pepsi or large dr. Pepper. And then I would go to lunch or go to work and for lunch. I would go to Taco Bell and I would get a Cheesy Gordita Crunch a seven-layer burrito and a Baja Chicken Chalupa and a large Pepsi. That's right there just", " Just for lunch alone is over 2,000 calories for lunch not to mention the breakfast that I'd had which would probably over 500 or 600 calories then for dinner. I would often make recipes that I knew my husband at the time liked. So it was a lot of Mexican food. He like to eat a lot of Mexican food. We ate a lot of one pan meals like lasagna.", " And casseroles and things where you have to take multiple ingredients mix them together and bake them. That's basically what I did and so for dinner, I would often have probably close to 800 900 1000 calories. So I was eating well over 2500 calories a day easy and I knew when I started I had to change my eating habits. I knew that I knew I", " isn't eating properly but I never knew how to eat I had to teach myself. So I knew that starting out for me. I was going to have to stop eating fast food. So I stopped eating fast food altogether. This was for three whole months and I'm telling you when you're addicted to fast food, you know where every single fast food joint that you like because there are ones that I preferred over the others.", " You know where they are on your way home from work, you know where they are on your way to work any path that you take anywhere that you go you automatically think of those fast food restaurants along the way you automatically think of already stopping through the drive-thru before you've even left the house. It could be you're not even hungry and it doesn't matter because it's a long the way you tell yourself that because it's a long the way from your point A to point.", " Don't be that you need to stop and get something to eat. I often did that so I knew that cutting out fast food for me was going to be a challenge, but I did it and it was really hard and every day on my way to work. I made sure that I kept my eyes forward at me and I had to make a conscious effort to not even look at the fast food places. I would see on my way to work because I knew I would jerk the wheel and end up in the drink.", " Drive-thru line before I could even tell myself. No, so I had to completely cut it out. So for three months every single day, I drove to work and home from work and kept telling myself with every fast food place that I passed just keep driving and that's what I did and in those first three months of my journey just by cutting fast food out and making some minor tweaks to my diet at home when I would cook at home. I lost 15 pounds.", " There is there was no exercise added in to my story at that time. This was purely because I was changing my eating habits. Now when I did that and I cut that fast food out I felt good about that decision. I felt good about the way things were moving. I'd lost 15 pounds. That was a big deal for me. I hadn't lost 15 pounds before so then I thought okay. Well, what else can I do? How can I keep this going? So I started taking the", " A piece that I was making for dinner. Lasagna Pioneer Woman, all of those kinds of really fatty recipes that add in tons of ingredients and bump that calorie count up. I looked at those recipes line item by line item and I would swap out things for healthier healthier ingredients. So if it called for full fat sour cream, maybe I used a fat-free sour cream. And now is that the most healthy option? No, but it was", " Better for me at that time and that's how I changed my eating habits. It did. I didn't jump all in and say okay. I'm only going to eat chicken and rice and vegetables every meal from now on that is great in theory, but it is I couldn't do that tons of people can and that's awesome. I was not that person. I was the person that had to make small changes adjust to those small changes see that those small changes were", " Producing results for me and then move on to the next thing.", " It was like it would build my confidence if I found this one thing I was doing was producing results. I thought okay, I can do that. I've got a handle on that now now let me go start this other thing now, let me go start trying to take out this thing from my diet. That's how I changed my eating habits and it has been a process and it still is a process from day one to now my eating is", " Different and I'm sure five years from now. It'll be completely completely different than it is now.", " Going into a healthy lifestyle and thinking of eating properly and how you're going to have to change. Your eating patterns is so overwhelming that we often don't even start because we know the amount of change it's going to take to get us from where we are.", " To where we want to be and we see this big huge gap. We see. Okay. I'm here. I eat this way. Now. I know to be the healthiest version of me, I need to eat chicken and vegetables and rice for every meal. That's baloney. First of all second of all you forget this bridge that connects you from the now what you're doing now to that future you because that bridge that connects you from now.", " To Future you where you're healthy and you're at a place you want to be are a million different baby steps that are going to cut out soda for you. Maybe one of those baby steps is you stop eating fast food. Maybe one of those baby steps is you pull out sugar from your diet. That's not to say that's the best option for everyone but just examples there are so many steps that get you to that place that you want to be.", " You don't have to jump from the beginning immediately to the end.", " I used to eat Lean Cuisines. And what was the other one Smart Ones frozen dinners all the time in the very beginning. And the reason that I did that is because one I didn't know how to cook healthy. I was still learning all of that and to they were perfect portion sizes for me. I had to learn portion control. I had to start at the beginning with all of those things and learn those things for myself so I could", " Implement them and teach myself proper portion control and things like that. Like I said, my eating is way different than it was 10 years ago when I started and I'm sure 10 years from now, it'll be way different than it is. Now don't feel like you have to jump all in and completely change everything about what you're doing. You can still make these minor little micro adjustments to your diet and have big results."]}