{"showID": "0a5cpbh8YLko5O9ZzhtaBa", "show_name": "X-Pac 12360 - A Wrestling Podcast", "show_description": "Hall Of Fame Superstar Sean “X-Pac” Waltman, and co-founder of AfterBuzz TV Keven Undergaro are teaming up together to bring a podcast with a full circle look at life from outside the squared circle.  AfterBuzz TV presents X-Pac 1 2 360. X-Pac has many stories to tell that may help listeners relate, inspire them in their own lives, or just be entertained. And of course, there will be guests. So plan on seeing his group of usual suspects along with a mix of wrestlers, celebrities, and comedians. X-Pac has known and shared many road trips, locker rooms, and life moments with these guests.  Support this podcast: https://anchor.fm/x-pac-12360/support", "episode_name": "X-Pac 12360 - A Wrestling Podcast", "episode_description": "Hall Of Fame Superstar Sean “X-Pac” Waltman, and co-founder of AfterBuzz TV Keven Undergaro are teaming up together to bring a podcast with a full circle look at life from outside the squared circle.  AfterBuzz TV presents X-Pac 1 2 360. X-Pac has many stories to tell that may help listeners relate, inspire them in their own lives, or just be entertained. And of course, there will be guests. So plan on seeing his group of usual suspects along with a mix of wrestlers, celebrities, and comedians. X-Pac has known and shared many road trips, locker rooms, and life moments with these guests.  Support this podcast: https://anchor.fm/x-pac-12360/support", "transcript": ["Hey afterbuzzers, before we move on to your next topic. We just want to say thanks to our sponsor. Anchor. If you haven't heard about anchor it's the easiest way to make a podcast. Let me explain it's free. Plus there are creation tools that allow you to record and edit your podcast right from your phone or computer. Also anchor will distribute your podcast for you. So it could be heard on Spotify Apple podcasts and many more plus you can make money from your podcast with no minimum listenership, and it's everything you need to make a podcast in one place download the free anchor app or go to Anchor.", " um to get started the Jericho Network on Westwood One", " Xbox One to 360 Sean Waltman Johnny lacrosse toes not here this week. Where's Johnny? He's toying with Rakesh. Yeah, where are they? I just saw something with them and Memphis.", " With lot with Jerry with the king. Oh, yeah Dancing Yeah Yeah, so we miss Johnny Steve Kaufman and obviously the beautiful Denise is I'll say those here. So yeah. Anyways, that's a little bit different way. That's a good at drawing the show today, huh? I'm gonna challenge. Yeah feels good to be back though. Yeah, must you drink so much. For more last week of my call. I missed out on the show you missed all the good stuff. Am I?", " My speakers a little loud my ear but I gotcha. Hello. Okay, great. Don't know a little bit higher Steve. I'd love doing this live on. All right, it shows the level of authenticity. Yeah. Yeah. I need to wear live pal. Apparently. I need to work on my own.", " Pretty sure your tongue twisters, you know, they say that you should do tongue twisters before show the tongue twister. It's gonna be a good show y'all. Yeah, let's give me a new show. So to 131 this gonna just give it to you guys. It was okay. Here we go. We're going to go ahead and kick it off with some news. The first thing that we're going to talk about is Cody Rhodes. So a fan asks Cody if for next year's WrestleMania in Florida if there was a possibility of a ew, right?", " Running a show and Cody Rhodes responded with he said that the atw would never be doing a show during WrestleMania weekend because it belongs to WWE where he said that for a while. Hmm. I mean, I remember about a month or even little bit longer whenever that was brought up because no that's WWE's weekend.", " And I agree because if you're running a show that weekend and you're piggybacking off of WWE and and I don't think that they're trying to be in the mark of piggybacking off of anyone it's funny because I've first I had one reaction and then I had a whole different reaction once I thought about it more at first I was like, oh, well, you know, I see Wrestlemania weekend as a community of a bunch of events, you know, and that's why I was kind of like, oh, that sounds kind of like it up.", " Kind of a bummer, you know, I would have liked something like that. But then I thought about it in terms of New Japan. So New Japan Pro Wrestling is obviously, you know large on their own granted they're making their u.s. Expansion, but prior, you know, when it comes to Japan, they're the leading promotion. Okay. So they've never ran WrestleMania weekend. This is the first time they're doing so but the reason why it doesn't seem like oh, you know, it's just a bunch of Indie promotions because of the one exception of Madison Square Garden, so because you know, they're running, Madison Square,", " Are garden that is why it's not like an indie thing, you know for them, but had they like because it's more known for independent promotions to be running and you know, getting some of that, you know, the people that are going to go see Wrestlemania Etc. But because of the one exception with Madison Square Garden, that's where it's like not seen as an indie if it was another Super Show if it was like where Russell Khan was New Japan was it wouldn't be as high as exists the first company running in the garden besides WWE. Do you think that companies will start to go to", " Cast and like like for double or nothing they did last year they and and Chicago there was like, you know other shows. Yeah, we're running like, you know, yeah, but I think this is a very strong. This is a very strong statement for aw to say everyone else piggybacks on the debit to be we where not everyone else where he that's its strong statement and it's the right thing to do. It's and you know, I mean it you get you just used to live by your own identity and your own, you know,", " Your own space ml your own footprint and the pro wrestling space not just you know, it's also smart that they established their own weekend from the start even before they were aw all in was its own weekend its own event. This isn't even all in either like I'm going to talk about double or nothing. They're not because they're talking about doing another. Well, yeah, they look there's not much difference Chicago ago. Really? Yeah then okay, they're gonna they're just running that hot, but they're going to have their own events their own.", " Against their own thing. That's the smart seems like Labor Day and Memorial Day is going to be like their thing Bloods branding, you know, like right off the bat like you want it already established yourself as like one thing. So that's where one of the things that I'm like, okay, you know seen it in that perspective. It's a good branding for them to be like, you know, we're going to stand around because you know, so many companies throughout the year. So many promotions have said we run we want to run up against the WWE we want to be their competition, but really they're obviously hasn't been companies to do that.", " At or you know some or whatever it sound delusional actually, you know, and it's okay like but it's just you're not you know, I mean, it's I mean, I understand the whole like mentality and and the things we getting our head, you know, you're fighting the good fight against the big Corporation and you know, you're providing an alternative to it, but you're no competition. It's just not it's not what it is.", " It was no I don't like in and out claiming. Oh, we're going to run head-to-head to McDonald's seems like well you need to get in every state if you're going to even bother you and there's plenty of like there's plenty of room for a bunch of different, you know.", " You know for competition, yeah and and and mean it's competition and that your boat competing for the same dollars, but come on. Let's be real. All right. Well moving on the other topic that we have to talk about here is Lucha underground has been going last few months. We've talked about them going on an ongoing battle with some of their talent who want to get out of their contracts and we've talked about it on this show while surprised they essentially settled with their talent Joey a joy Ryan.", " Believe Thunder rows that you hold in fantasma are officially released now out of their contract so good for them. But do you have any thoughts I want to know where your the phantasma is going to show up since he's not going back to trip away and thinking NXT simply for that show. Yeah. That was he was a guy that you know, I talked to them about when they asked me, you know, I think I mentioned if you know, I don't know how long ago couple weeks back about how when you were down in Mexico.", " Oh that what they ask me. Yeah, you know Canyon it asked me to maybe take a trip down there after after Del Rio left the first time and phantasma was one of the guys because I couldn't he can speak English right? He's got a great, you know, great. Look, you know, he felt most of the criteria they were asking but there was some issue where like he had a tryout down there and like he he got a lot of heat for going in there and doing a tryout and then ended up", " Getting hired for some technical reason for some silly thing like that. I don't obviously like I think they would Overlook now and I don't know what that is even but I just know it didn't work out and then he got heat down there in the loot and in the industry down there in Mexico over it. So whatever was obviously had to have made those changes to even be, you know, just change their criteria or they just got a little bit less, you know picky on you know.", " No, hmm uncertain things. I know they're looking. They're always looking for more Lucha Libre talent and he's one of the best that isn't signed right now. I have stupid always been a big fan of his they immediately as soon as I saw that last night. I'm like, okay, he should I was actually going to call and go. Hey, did you guys know that you had the fantasmas available? Like, you know, but I'm sure they know it's funny because when I spoke to him at Expo Lucha we talked about this and he actually talked about, you know, some I won't mention any names but some of the other Lucha", " Is that are getting I guess you can say the majority of the work here in the states, and he basically said like hey guys, just so you know, there is way more guys out there that can do this job. Yes, but when we did the interview, I kind of got the vibe that he was trying to tell me something other than when he was verbally speaking and from that interview when I re-watched it. I was like, I have the feeling that he's trying to tell me that he's going to be someplace like WWE granted you didn't say it, but I don't know. I just kind of felt it after", " Listening to that interview and then he even gave me like a wink thing and I was like, I guess you hear I'm not gonna push you on this but I get what you're going out with me here. So I don't know that's just weird. Let's watch that interview Denise on my YouTube channel Denise El Sayed. Oh wait, no youtube.com slash Danny Salcedo and I sure yes, we want to get fancy. You could comment below with that interview and someone could go and pin that comment. So it's the top comment. Thank you. Thank you. I think one of the other interesting things about this story is coat under Rosa / Cobra Moon kidding.", " Getting a release despite being booked as Cobra moon on wow. Yeah, didn't I just see her on who the hell did I just see on roh from Lucha underground? Yeah police possibly know your words like to have that that's happening. I was that's one of the Twisted Sisters. That's either holiday Door Thunder Rosa Thunder Rosa. Yeah. That's who I saw this morning on us, uh last night. He's had", " Thunder Rosa gimmick, but the Cobra Moon specifically was something created by Lucha underground, but she somehow got the ability to use it for. Wow. That was that was interesting to me. They might be some baby. Well now that while is being renewed for a second season, you know good for them. So that obviously says more work. I just think it's it's it's kind of pathetic that Joey and in the rest of them had had to take this to court.", " nothing, and I while you all are sitting there trying to figure out where you're going to whether you're going to do another season or not other people have to make a living, you know, and I just I think it's kind of I mean I get it because that's how they do things in TV and and maybe", " You know, maybe the talent should have been a little bit more careful on what they signed but what like when you don't have any leverage you sign whatever right? And then just hope for the best. Well, the landscape of wrestling was different probably do another Point that's changed a lot. Now that you know, it could change between now and next week. So Sean my question to you is because these stars are these guys as Talent were, you know, granted their releases and all of that. Does that signal that they're not going?", " Be coming back for a season 5. What do you think Jimbo's? Well, I don't think so. I think that was the final nail in the coffin right there. Yeah. I'm not.", " I guess they were great or whatever. But I mean, I'm not gonna sit don't feel like I'm in too much of a loss to me because I mean they're just you never know when they're going to come back. It's like okay, there's these big long gaps in between, you know tapings and it's just hard to really I don't know. I never really had never really gained any traction with me but TV TV like Cable basic cable TV, like Lucha underground show kind of they the executive make these", " Decisions on such a whim that I wouldn't be shocked if we saw season 5 with whoever was still around. That's just how they will that's just how these networks role that someone way up top will eventually notice. We're not doing each other go. Let's just do it. Let's go underground and then the next day Lucha underground back in production, they're signing people to contracts and let's write the season. Let's make it all happen. Like I wouldn't be shocked. There's a season 5 just because of the dysfunction that is cable television. I just think now there's different places.", " Are you can see Lucha guys now because so many companies are picking that up especially after the success that Phoenix and pentagon have had. So now you're seeing more Lucha Stars being picked up. Like for example, what impact you're seeing more of that, you know and Ring of Honor and you know, aw with the announcements that they made so now it's kind of like you're not just going to ask one specific place to see that type of style. You can go other places whatever happened to that thing that you went to Nashville and shut those tape. I'm still waiting. I don't know when the next", " Beans are at or the last show. We did was in Nashville. That was really fun. Yeah, huh. I mean because you see things like that and it's just like, okay and then I'm sure they'll be some more projects and hmm, you know money, you know money people come in and putting, you know trying to get in the wrestling business and hopefully, you know works out for them. Yeah. Sometimes not know what else Denise. All right, there's so many topics.", " Talk about all right. So this one I okay. So here we go. We wanted to talk about the possibility of Conor McGregor and maybe Rob Gronkowski maybe doing something for Wrestlemania just because this was this was our topic that we had settled on until we saw some stuff on Twitter about New York Times and all of that stuff. So I don't know what are the possibilities because Conor McGregor announced for the second time on Twitter that he is retiring from MMA and then obviously we do know that Rob Gronkowski is retired. So now what are our thoughts?", " all of this", " I don't know.", " There's two thoughts on that and wrestling and MMA obviously, they're they're both physical but they're a little different ones. Like, you know, we protect we could protect ourselves and it's a show and and all that but you still have to be able to go out there and you know be incredibly athletic all that but you know MMA you you know in one year like, you know, and not that long you can lose its.", " You know fraction of a second on your timing reaction time and you're fucked, you know, and it could make the difference between your you know.", " World world champion caliber and you know just some guy. Yeah, and so like I mean", " who you know part of me is like fuck. Yeah, you know, you got yours get out, you know and and do your thing and and happy for you and and another part is like, you know can only do this for so long like MMA, especially that's like we can keep on doing pro wrestling fucking forever zombie some of them carry in the ring, but ya know like", " I don't know unless she just this is over it. You know, like I don't know there's still like when you're in your Prime, you know and fighting I just", " Oh, you can end up being like, you know later on going God. What if you know, what if I would have just kept going or like, you know, like look what happened with Muhammad Ali, you know, when he had those years off, you know with all the you know, the draft stuff and all that and he was protesting. You know, those are those were his prime years lost right? So, I don't know like he I don't know. I don't know.", " Fuck it. What I'm trying to say to the point of WrestleMania. I don't think we're going to see Conor McGregor at WrestleMania or you never know about the affair. You never know. It's a pain, you know, if it's like just someone parents and you know a pay day and I could see them saying hey when you know one half a mil show up or a million dollars show up say what's up get involved in a little something you might I don't think that's big money to him. But I think it's still enough to for him to go. Oh, yeah.", " Yeah, it's worth getting on an airplane. Hmm. I'm he has that personality that you just like you want to see like even though it's sometimes you were like really Connor like you kind of pissed me off. You have to make me angry. But at the same time like he's so just like very large all the time and you know, you can't help but to be drawn to that sort of personality. I actually just got an idea. I think I can see with the fox deal. They want Smackdown to be associated with all of these athletes Conor McGregor being somehow involved with the smackdown brand by the end of the year.", " Possibly even being the authority figure if Shane McMahon is sort of corrupting the position bye-bye, you know booking him at all of these things being the best in the world etcetera Etc. They need somebody to sort of set him straight and Conor McGregor could be that name as well as that personality that could help the smackdown brand get even higher on Fox. Okay, that's actually a good idea because you eat because then you get to put Conor McGregor on the poster for wrestling.", " Without actually having that make him wrestle.", " Yeah, well, I know bully re-tweeted Ric Flair and Charlotte's Corner Rhonda's husband in her corner and Conor McGregor in Becky's corner for Wrestlemania. You never know just to have her come out and him come out. It'll get a huge eruption for sure. I just feel like it would take away from their thing. All right, you definitely agree that she doesn't need it. None of them need it. But if you're going to stick him somewhere why not there or have him come out and go nose-to-nose weird rock or something?", " They would get from a that. It's hard to pass up. Hmm. The publicity would be were you know, even though they're already getting the shitload of publicity just because it's WrestleMania that would just put it over the top the involvement there. So I don't know. We'll see. All right, we know what I always have to you know, we never do on this show. Well, yeah, we do sometimes I guess people probably want to know what the fuck I'm talking about right now, you know.", " No, we don't to figure things out, you know, this isn't show or we got to figure everything out and get all the scoops and you know, it's sometimes it's good just to sit back and see how things unfold and not try to figure them out ahead of time. Do you think ground get do you think Gronkowski gets involved or do you think sure? Yeah like me sure. I think he'd be the best way to elevate Mojo Raleigh and bring in him and have the two of them together if he wants to be involved in the ring stuff or even be like his hike man. Hmm.", " The reverse is only 29 years old. His body is already beat up for MMA. I think so I were talking about drunker. Yeah greater ground. So I would say like based on that like he can do a few matches. You know, this is anyone even talking about MMA in the first place. No, we're talking about Grunts from football. Oh wait, sorry. That's what I meant to say. Sorry. I'm so sorry.", " No, but that's what I wanted to say was that you know, he's barely 29 years old, you know, his body's not you know, he can do he can do wrestling's what I'm trying to say. He can had he has a few matches in him. Yeah. So is my head versus the security guard. I want to try you know, I mean, I would like, you know, because I you know, obviously than guys got world-class work ethic and and you know, he brings out with him and if he has aptitude then things will work.", " Out and he brings the mainstream people covering on ESPN want to see what he's up to TMZ. You never know right eyes on the product.", " All right, what's up moving on? We have some more news about more additions to the WWE Hall of Fame the Hart Foundation Bret Hart and Jim The Anvil Neidhart are officially going into the WWE Hall of Fame this year. Yeah. Well, let me we do we kind of heard about this a few weeks ago. Yeah, we I'm confused about this why because it was Jim announced at first, right? Yeah, so I thought he was going in by himself. And now the Hart Foundation announced he was never announced by himself. It was just like a okay, then that makes sense because", " I was confused if he was going to go and buy himself and in as part of the Hart Foundation. It's just the Hart Foundation. Okay. Well with the rumor the rumor very long ago like a month or two ago was that it was going to be Jimmy Anvil Neidhart Bret Hart and Jimmy Hart and then it would have meant Jimmy Hart and Bret Hart would have become two timers, but now Bret Hart's a two-timer with flair and yeah, do you think all of the Hart Foundation should go in or it should just be Bret and Anvil should it be Brett Anvil and Jimmy should it be Bulldog pill?", " Lemon and Owen Danny Davis deserves to be in the conversation.", " Because there's a lot of reasons for that but I'm not going to get into it. I um, well, I would say Owen for sure belongs and Davey work Heart Foundation. But I mean, I don't think that's the part Foundation we're talking about here. You know, I think we're talking about the Hart Foundation, you know the tag team. Yeah the tag team that had to run in the 80s and you know earned of the early 90s.", " It's not the Attitude Era no affection. No. Also, I think Owen is it's not necessarily entirely up to W. It's not at all. There's you know, I mean, it's up to Martha and she's made it clear and you know, I don't know. I mean he couldn't like it or not like him and you know, it's her decision. So yeah now I mean", " Of course. I just it's nice to see Jim, you know being being inducted. I've always been a big fan of Jim Neidhart the character of Jim the Anvil Neidhart, you know men added so much to you know, you saw The Ring to really good like when and and and especially like in and what we're talking about here the Hart Foundation like his role in the Heart Foundation. He was great.", " He was a really good like solid power guy that could he could move in there too. And just it just haven't brat. They were such a before we continue one of the ways we keep all these shows for you free is by our amazing sponsors. And today Spotify is one of our sponsors on Spotify. You can listen to all of your favorite artists and podcasts in one place for free. You don't even need a premium account Spotify as a huge catalogue of podcasts on every topic including the one you're listening to right now on Spotify. You can follow your favorite podcast so you don't miss", " Episode premium users can even download episodes to listen to offline wherever they are and you can easily share what you're listening to with all your friends and following on Instagram. If you haven't done so already be sure to download the Spotify app and search for AfterBuzz TV on Spotify or browse podcasts in the your library tab. Also, make sure you follow us you never miss an episode of AfterBuzz TV great team, you know, and", " all the little details stuff in tag team wrestling that is", " there's lost sometimes but there's a match and you know, you always hear about different matches like, you know, Tully and our inverse derocker's telling, you know, the these teams in the verses each other but the Hart Foundation versus the brain Buster's if you can never find that match it was fantastic. I think it might have been a Saturday night's main event.", " But that you know, that's a to me like, you know, obviously their matches with the Bulldogs and there was a few matches like I think even the match where they won the tag titles from the Bulldog. I think Dynamite's back was really screwed up at the time and they kind of just I think that was in Tampa. I think I was actually there for that tampon the Sun Dome. Yeah. Well here I am just kind of calm and that's what we're here for.", " Yeah, but oh my God. Yeah those matches so ahead of their time and you know, you you see a whole WWF card back then and the Bulldogs versus Hart Foundation was so out of place, you know, I mean they were out there just going to town, you know, and you know another match they might have a bear hug on for fiber 10 fucking minutes. It's being a Hall of Fame. You said you want to talk about Sue actions and", " Laughs to HSN. Yeah. Yeah. So congratulations to the Hart foundation and congrats to Brett two-ton. I didn't realize I didn't even dawn on me. Yeah, I just thought about that since you mentioned it. So yeah. Alright. This will be the Hall of Fame of two times. Yeah. All right, but I", " there's there is a Hall of Fame inductee that I'm more happy and excited about and Sue Aitchison, you know, there's been a lot of", " You know Vince tweeted about it Triple H tweet about it. Like so many different people Ric Flair Su like probably I don't think there's anyone that's worked for WWE as long as to HSN. That's still there. I might be wrong, but I definitely don't know of anyone. She was there long before I got there in 93 and and she's just always been just such a wonderful.", " Wonderful person to deal with you know, she would always she would have company soon accompany us on personal appearances. And I think that's what led to her involvement and make a wish and she's been a part of oh my God. I can't even tell you like thousands of of make of wishes being made and I'm so happy for you, too. I love you very much.", " Congratulations on being in 2019 WWE Hall of Fame with us. It says she's worked for the company for over 30 years. Yeah, anything else talks about her involvement with Make-a-Wish and how she's received other celebrity awards for all her involvement and everything being so humbled happy about it. And so we feel like we're back in the day. So used to like to have a few with us, and we always have a good time things change.", " I don't I don't I don't think I don't see her doing that. We used to have a lot of fun. Anyways, love you Sue. All right, what else so I guess can more congratulations are in order WWE has officially announced at the main event for Wrestlemania will be Ronda Rousey vs. Becky Lynch versus Charlotte Flair. So first ever women's main event at WrestleMania. Yeah. Yeah, imagine that.", " Well deserved. I think I actually imagined it Monda Monday after WrestleMania when I was sitting there.", " Next to Rhonda telling her you're going to be rain event, WrestleMania next year Tada, you know people like myself and just others that like-minded, you know thinkers you throw that out there in the universe and it's funny how things happened. So ya know it's it's it's just that the the thought of it, you know, and it was the it's a right time.", " and", " and you know, I really like what Ron is doing, you know as a villain right now because you know a lot of that a lot of the best villains are the ones that", " That think they're right. Yeah, you know that think they're the good guy.", " It's like the Bret Hart when he was you know, and he kind of was hanging right actually. So the sometimes where the fucked up once, you know, this also seems pretty close and maybe maybe she's fooling me. But like this seems pretty close to how she feels currently I think so that like that it's easy to tap into for her of just I actually do feel kind of unhappy with how the crowds reacting to me. Yeah. This is a very natural term for my character. Yes.", " And I think it's all well played and I know there are some people that are criticizing all this and you know, I just I couldn't disagree with you more. I think it's all playing out rather nicely. And and I think just some people don't like being worked. They don't like getting caught up in it and then you know,", " I don't know. Yeah, I don't know. I just think it's great. And huh. Do you think it was Charlotte and and Rhonda that was the match right and Becky Lynch came in just said fuck all that. You know, I'm here to and and fucking a man. She did a great job and", " She wasn't the chose at one and it didn't matter and and at least this time they're listening to the people. Yeah, so Shawn, you know, obviously whatever woman wins that night is going to go down in history, you know, can you just like imagine that like moment where you know, her hand is raised and all of that. So I want to know who do you think is going to be coming out Victorious that night not I don't even want those out there just", " because", " It doesn't matter to me. They're just they're out there fucking clothes in the show at MetLife Stadium in front of like 80,000 fucking people at WrestleMania. They all just one to me so I know that's cliche sounding but yeah, the last time they were at MetLife Stadium though ladies match was scrapped off the card. Mmm. So just shows you how far they've come from being taken off for the Wrestlemania card to being the main event of the Wrestlemania card in the", " Then you and that's actually my favorite thing about this whole thing is that they're not in the main event because they're women they're in the main event because they're the hottest thing going on right now on both Raw and SmackDown. They're the most talked-about thing-- Etc and that's what I think too. Like, you know, I know in the past sometimes people have said like oh this feels forced making the women do this is feel Force for some people that have said that but this one like I honestly,", " Have been well, I haven't seen I'm sure there's people out there on the internet saying this but I haven't seen people as opposed to this as if it would have been somebody else. I don't know just because I think you can ignore the fact that you know, they really really got the crowd invested in what they're doing there. Yeah. Yeah. This is also speaks a lot to Becky Lynch who was on the Battle Royal and the pre-show last WrestleMania. And then this WrestleMania. She's in the main event.", " Which is I think a feat only ever accomplished by The Miz. I want to say the MS did something similar was pre-show to Main Event, Romania Romania. I'm curious to see what they're going to do, you know for next week. Yeah on TV.", " You know, I mean just to keep the story going, you know already announced that their team's gonna be the three of them against the riot Squad. That's what that's why they had the Beat the Clock Challenge against the result was that how is that how they explain that? Yeah. I was wondering what was heard. Yeah would have really helped have we a known what that was about, you know, because you know when you're sitting there in the match is going on your turn and you're still trying to figure out why they're having it it takes away. And then all you have to do is explain in a little bit.", " And John Jets also going to be doing this reputation for Rhonda. I saw Joan Jett when when", " when she was at her hottest. I was just a little kid and yeah, so I would huge JoJo fan.", " So it's gonna be cool to be here. Would you would you say that? This is the coolest live performance from a band or does Motorhead still win that I think that's what it does for me. I just don't know what I was there for about motor had Houston Astrodome. Yeah playing AAA. Yeah. It was amazing. Nothing's gonna ever top that. Yeah. All right. My personal favorites were always saliva when they would come out and do their performance Iva saliva. I always was a fan of them. So that's my that's my my bread and butter.", " Let's take a break real quick. We'll come back talk about some more stuff.", " All right. We're back here on xpac One Two Three Sixty everyone don't everybody look at me like that. I think we were all waiting for like, okay, what's next? Hey everybody. We're back right here. And I just want oh, yeah. So yeah, we're back. We took a little break and what we're going to talk about Steve. Okay. So what had happened was now c2e2 there was a show Friday night real quick. Yes, we're talking about", " Jim cornette and corn Eric Bischoff and they had a little bit of Twitter rant. They had some each other. It's from Twitter stuff going down. So Chuck pardon like real quick. I just find all this really unfortunate because I mean, you know, it's ruins kind of doing their own thing. I don't know if you like boner pills and I mean who cares take a mean if somebody has boner pills sponsoring the show someone doesn't like", " like what who gives a fuck and and just and I know like some people can you know out there, you know on Twitter and everything like that. Love to just go like what do you call it? Twitter Twitter snit tag snitching or pretty much yeah make so jump in people's actions and then yes turn this shit up and then like just don't fucking fall for it. You guys could everyone I can say as someone who writes tweets to", " No clips and videos if I'll just say this right now if like at Pritchard show or at eighty three weeks tweets the link to a clip and I didn't tag the person we're talking about don't tag them in the mentions. Yeah, I did that intentionally. Yeah, if it was positive I would have tagged that person in the Tweet. It's just urge it that's people just fucking love to do it. And then I I think that's part of Conrad and Eric's plan though is to get kind of involved there. So tell us what happened. So what happened?", " And was Friday night there was an after eighty three weeks show or not after eighty three weeks. It was the what happened when 83 week shows Tony Shivani Eric Bischoff Conrad Thompson at c2e2. It was 300 people sponsored by Blue chew very much a car. Matt Thompson style show, which is a big tent style. Everyone come watch the show at the roughly the same time. Jim cornette had a show with exactly a hundred people and it was more or less a premium ticket. You get to see me you get to meet me you get to shake my hand you get out.", " In Greek, that's what Jim cornette was offering. Those are two completely separate offerings. Someone jumped in Eric Bischoff's mentions, Eric Bischoff got a little snipey and explained how his show was huge and great and big and bad and that Jim cornette show was in a broom closet Jim cornette responded and then they kind of got into it a little bit and it was fun to watch in the worst kind of but if you can detach yourself in the situation, it was yeah kind of just makes me a little sad though and", " I don't know. But neither of them could agree that the other just had a different product is like that because that's fundamentally what it looks like to me is that Jim cornette offered one product which is himself. You're going to get me you're going to get everything. You're going to get all of me. Whereas just right? Yeah, it's just well, it's Brian last spring but it's the Joker. It's Jim cornette is the star. Yes, Jennifer Nelson.", " That's the not grants the fucking stop. Okay, Steve. All right. All right. I mean there might be a co-star but in all of these the common denominator is Conrad Thompson. Hmm, you know, whether it's the fucking the Pritchard show the the Shivani things, you know, the are the thing with Eric hmm the common key ingredient here the secret fucking ingredient. That's not so secret. It's Conrad very true.", " Alright, so this is The Big Show, but that's a big show. That's the product you get offering is a Big Show or anything could happen where it's Jim cornette? Yes, you're offering a moment with Jim cornette. Yeah and not no one has really gotten into these weeds of like that's the fundamental difference is Eric wants to denigrate Jim cornette show by saying. Oh, it's it wasn't this big massive show and Jim wants to denigrate Eric shove. Like it's this big massive show and they were separate products. Here's the thing.", " Regardless of whether you're right or wrong there's some things I mean now and again that I see Jim cornette tweet or whatever that I disagree with and actually sometimes I'm actually depends on on what depends on what time of night it is. I'm like tempted to fucking reply to but I don't and you want to know why I don't because Jim cornette will fucking slice you nice. You verbally fucking over the keyboard or whatever.", " When it comes that word, he will fuck you the fuck up. I don't care if you're Eric Bischoff, I don't care who the fuck you are. So it's just discretion is the better part of valor. Yeah as they say, you know quoting Shakespeare. They're actually quoting fucking Gordon solie quoting Shakespeare but to paraphrase looks but they got into it and people enjoyed it. And once again, I just want to point out this all happened because someone got in Eric Bischoff's mentions in the wrong moment. Yeah.", " Yeah, and it's your snitch. That's is that what we're calling it Twitter Twitter stitching. I like this mention stitching this bunch of bullshit. It's just like a bunch of shits during motherfuckers that just love to go. Oh so-and-so said this about you remember one time someone did that with Jericho Jericho like was in the back of a limo one time. This was several years ago and someone just was asking them questions and you know, you had a few to drink or whatever. Someone was just like something about me right - he was an overrated.", " And then someone was to immediately went to me although it took Curt. Just Jericho said euro rated. It's just like, you know, what cut the shit and Chris reached out to me over and I'm like Chris. It's just a bunch of people fucking stirring shit honking fuck, you know, we're good. Like I know I get it and I get it's like this interview wasn't about me. So like yeah no rated move on and it's a knee-jerk reaction bother. Don't bother me at all because I know me I know like what I you know, I know what I've done and hmm.", " I don't like just the insecurities everyone fuck come on. I think you see that all the time though because I've seen it so many times where like somebody on a podcast will say something and then there goes somebody clipping that clip out and sending it to so and so and next thing, you know, the whole world is attacking that one person for that comment, you know, and you see it a lot over and over which is kind of weird to me because the way I see it is if you're on a podcast you're on a platform give an opinion give a real.", " Opinion even if it's not the favorite opinion at least have an opinion that is why you are you know, having this platform. Yeah, you know, yeah, so I you know, I don't know more about that. It's just that you know, I am a fan of both for both people, you know think different reasons. So, you know, alright. Alright moving on. So no Twitter snitching. Alright. So the next thing we're going to talk about is Monday Night Raw. We have a few notes.", " That came out of that pertaining to WrestleMania. One of the first things that we're going to be talking about is there's been more added to the Triple H versus Batista match Triple H has now put his career on the line. So guys, what are your thoughts? I thought he went out there and delivered quite the fucking in ring promo. It's like the Spice Girls mint Mania reference that could have fucking sticking it took in a huge shit if you don't deliver that", " I was just it was very well done. Yeah, I like this a lot. I I get into prognosticating too much. I should talk about the actual match though. I think this match is going to be great. I like the stakes were building in two with Batista and Triple H.", " I do get into prognosticating. It feels destined for Triple H to win though. Get this his career. Even if it wasn't his career. Mmm. He's the boss staying Brock Lesnar who else my fucking time. Yeah, you're all going down shit. You'll give me a good batch of for he beat you though. That's more to the match though. So, yeah.", " Weren't you know, there's going to be some people that are like, oh my God Triple H's careers on the line. So, you know, whatever may be DX will come down and help him. Oh, I'm wondering what kind of entrance he's gonna have. I know it's going to be a good one because I always look forward to Triple H's WrestleMania entrance and he never sex when it comes to Marcus. I can't hear you.", " How about now? Yeah, you want to add anything to all this shit. Well fit to specifically to the Triple H Batista. I'm very interested like as you said, he's the boss. This is going to happen regardless and but I wonder if they're going to take that stigma and use it against everybody and actually have him lose Fontenot. Well, just so that but even at the same time, we haven't had anybody who's lost a retirement match that has it.", " Wrestled again, you know what? I mean? So even even if it's like this is my final match then okay, like even we had it years ago where mankind lost his job. So Mick Foley wrestled, you know, so like it it's something was fucking the Connecticut Blue Blood on the back. No, we're going to get terrorizing back. Yeah, but it isn't that that is to say the w we can make up their own rules. So regardless of the out", " outcome of this match this may or may not be the last time we see either of these guys. Aw, this is WrestleMania. They lost last year's there. He's not losing fucking to wrestlemanias in a row. That's a good point. That's a very good point. But I think it's a very interesting turn of events. And that adds the if you bring in the history of his best friend Shawn putting his career on the line and losing and all of his WrestleMania moments. It's going it already adds so much to it. This match was already fire and this is going to", " Even better also, he's lost the last three wrestlemanias in a row who it was Roman and Dallas Roman and who Roman Reigns Roman range Triple H and Dallas is the main event than it was Seth Rollins in Orlando than Rhonda Kurt Angle who he's lost less three since sting. So he's we're looking at it that way. He's Bound for the win, but they could always swerve.", " Hmm. We'll see. I don't know. All right. Well, it is shaping up to be a real real real big WrestleMania because there's so many Max blow the fucking envelope getting stuck in the pocket. That's kind of funny. Like you can't you can't rehearse that stuff. It just happens. All right, kind of think that's gonna be a big Camden. Anyway, it's whatever tongue tied and twisted.", " Tom Joad fucking we're getting there. Well, another news point that we wanted to discuss Beth Phoenix is teaming up with Natalia and they're basically doing a woman's tag team for way. So we're going to have Sasha and Bailey defending their titles against Amina and Nia Peyton and Billy and then Beth and Bethany Talia. All right, cool. It's like the sound of that. Hmm because I different. Oh, yeah. She looked great on Raw. Yeah.", " That looks great. I part of me is I don't want to want to see worried but interested in if it was always the plan for a four-way match versus if you're going to have Beth Phoenix come back. Maybe it could be a standalone. That's because now the iconic star involved the tag titles are involved until it just feels like a lot of parts and I think they just want to include everyone in WrestleMania. There's many people can you know get some as possible? That's a very special.", " Tell everyone you know, they were we work real hard, you know all year long and then kind of you know, what happens at WrestleMania is indicator of you know, kind of like a reward almost okay, you know, you worked your ass off this year. Here's here's a good spot at Mania. That's fair so that it's not about because in my mind, I'm just seeing it as if Beth if you think Beth Phoenix coming back is a big enough deal it that could be the whole story, but I people probably do some people", " It depends on you know, the age group the buffet style of WrestleMania. I would imagine is helpful to just stuff or you got a lot going on here.", " All right. Did we want to add any other Rocco whatever you want? All right. Well, I think there was also the under the giant Battle Royal news call in. Well, Michael Che has been added and a call and also has been added as well to that and they had Vibe that's fine. You know, it's what they do in their you know, you know, I expressed my unhappiness over you know that backstage segment with Brawn and", " Those fellas but that being said like I mean, it was just my displeasure with that segment not with their involvement. Hmm. So, you know, let's see what they do with that. You know, I mean, it depends on what they do out there. They're out there trying to you know, runs Bots and now like it's", " You don't really run spots in battle Royals anyways, but some will see what happened. They also added Drew McIntyre vs. Roman Reigns that's official now. Yes, and I think people kind of care about it. Actually I liked I liked what they did last night how they heated that up rather quickly. You know, I thought you did a great job on the mic and you know,", " You know, it's barely it was was fairly predictable like, you know and talk about the family and you know that gets a rise out of them and you know, and it's just when Roman came out it was just you know, he believed he was really mad. And he really liked was you know, don't talk about my family and I believe that I believe that from him and at worked in", " I think I don't know. I mean I think maybe like some of the physicalities got drawn out a little too much for my taste because they need to fill time. I think of all the singles matches heading into WrestleMania. This one needs the least amount of build that it's Roman Reigns is Roman Reigns wrestling is kind of built in as a draw now and then Drew McIntyre is the best deal that you want to see lose. It's going to be tough. It's there are Stakes there too because", " You know to me like who you going to be journey to win and so does Roman hmm?", " Well, I don't think it'll be bad. Obviously if he loses to Roman Reigns, especially because Roman Reigns is coming back from such a high. So I definitely think like it has to be of course not but on the trajectory that that Drew McIntyre is going right now like he is on course to have a big WrestleMania when and and so that makes it even more intriguing to me, you know, okay who's going to win who's going to win if you believe if you believe the advertisements for the Saudi Arabia show, it's going to be Roman.", " Yeah, but like still gonna happen. Yeah, like that's good. But like yeah, I like it either way. Like I could see them doing that. I could see just you know, like you could you see him up there up against Drew and you go. Oh, that's just not--that's not just some guy for Roman to get a quick win over and oh, yeah, that's someone that's a real fucking match that someone they see that's a basket. They see a lot of eggs in the coming years.", " All right, so do we're moving on now. All right, let's go ahead and move on. So you're all right. Here we go taking the wheel. Alright, so now it has officially been 18 years since the last episode of nitro. How do you feel?", " Okay, I mean time just flies. I'm assuming she's I don't have as much of a you know, Sentimental Feeling or like any kind of fucked up feelings over it because I was already on the winning team when that happened, you know already came back to the winning side. And so it was a little weird like it was like, oh God this isn't necessarily good for the overall industry, but you know you happy for vents.", " you know, there was a", " you know, what's weird? What's weird? What was it? Like in the locker room that day at Raw? Well, just you know, like I said, there's mixed feelings because yeah, we're happy events one. Hmm because like there was a concerted effort to put him the fuck out of business. So anyone can say whatever they want after the fact, but that's the truth and and and you know, so at this point", " Wait, how at this point? How do you remember feeling knowing that there's going to be some guys, you know going to WWE and then some guys going out of work that was sad and you kind of knew certain guys. Okay, Vince is hearing and bring Lex back. He ain't gonna do this, you know, you know, there are certain guys, you know had heat and in there was a lot of guys in the locker room that were worried about their spots like these other guys coming in and you", " You know, oh, yeah, and and when they came in, you know, everyone's waiting for somebody to do something wrong so they can pounce on them about something that's you know, that's not the right locker room at a kid or that's not how we do things here. It's just it was so ridiculous for a while. So that tension was still kind of narrowed that like rivalry. Well, it was more of like a, you know insecure about like somebody knocking them out of whatever perceive spot. They felt like they had you know, I mean when you", " Like 50 fucking people to the roster, you know that it's like okay, where's everything going to end up because there aren't there were some serious talent that I mean there was a lot of people that weren't, you know, a lot of the big-name talent didn't come we got some of those people that didn't get brought up. I wasn't shocked at all. I knew was it coming? Yeah because they want you can't they the Smart Ones where you know they had", " Contracts there that were with Time Warner, AOL and not WCW so they couldn't just be sold and with you know WCW to WWE which honestly for selling WCW helped because they went out of business like the contracts that were under WCW wouldn't have had to been honored. So the smart guys had their contracts to Time Warner AOL. So if there was some kind of anything happen like that", " They were still getting paid to that of their contracts. And if someone like Goldberg, let's say had their contracts through WC W. WB would have never purchased it. W would have never been able to purchase WCW if it if the price tag included, oh, yeah, that's how they would have. They would have paid tens of Millions for because they only want to hang two million. Yeah, but I mean if the contract wasn't it was yeah, they wouldn't okay. Oh fuck. Yeah because then they could have put them right on their TV, which is what everyone says.", " The Monday Night War or when they bought them out. That's what they were lacking is the top stars like Sting and Goldberg not coming over right away. There were like we got Booker team. They just didn't like lot of guys. They just don't know they either had a little taste of the of the grind up there or they heard about it like Stinger heard about it different guys heard about it. And you know some I'm just we're so used to that fucking Country Club, you know, just show up and come to work once a week and then", " Go home, and maybe do a few House shows here and there but other than that, you know who work in gravy train. They just didn't want to go to work after being used to kind of sitting on there. I don't mean to sound like that that's like fucking truth and that's not to say they weren't worth what they were being paid in WCW not saying that it's just the work they were worth it. I'll say 1 million paid up the schedule. Yeah, the schedule the schedule was not what w he's was all the last card was Booker T.", " Defeated Scott Steiner for the u.s. Title Rey Mysterio and Billy Kidman beat Kaz Hayashi and Jimmy Wang Yang or Jimmy Yang at the time and Shannon Moore and Evan courageous for the cruiserweight tag titles. Yep. Chavo Guerrero beat Shane Helms didn't flare work with sting. That was the main event and he wore like a t-shirt because he was so out of shape. He said that what he said. Yeah and one of his like and one of the past WWE interviews, he's like, oh I couldn't wait for a Nitro to end. I wore a t-shirt. I didn't care. I mean", " In when he came in in 2002 like I had a couple of matches in there with him like before I was gone when I was in NW, and he look great fucking great when he came in pass guest of this hero Shawn stasiak versus Bam Bam Bigelow and a loser gets a tattoo match. Wow, let her step and then Sean O'Hair and Chuck Palumbo beat Lance Storm in my Gotham for the tag titles. All right now Booker T. When did Booker T become world the Booker T become world?", " In that shower was already world champion. He became US champion. I think yeah, he was okay. He was Idols that night because they put all the titles on him similar similar to when ECW is over. They put all the titles on Rhino at the end that they picked someone they pick someone and say this is who this is. This is where all the lineages and for this guy huh interesting. Yeah, really interesting well,", " How much do you have left to get ready for Wrestlemania, man? What else you got left to do honey? I know Lieutenant who needs a shave. Yeah. I'm waiting for her fucking poor thing. She's so fucking her hair. She needs such a hit. She needs a haircut so bad. Holy shit. It's kind of embarrassing but I'm just waiting because he got time it right and she needs to look good for media. That's more important than her feeling good like all we do not like she can see", " Burl all week that was on the she looks good for Mania. It's the main thing. Does she have her outfit already?", " Can someone please like laugh at that so I don't seem like fucking him total asshole. No, it means about waiting to shave her. Oh, okay. Got it. Sorry. I haven't had a dog. So I'm like, I've heard you've never had a dog I've had them but they were never really mine though. So I've never taken care of a dog or know a dog needs, you know, one of the great joys of my life. It's one of the great joys of my life. You're really missing out Denise.", " I just think it's crazy that you found Lou on the streets. You've told the story so many times and she was like barely surviving eating like trash water or whatever with the broken jaw and can't see and and now she's gonna be the Hall of Fame with you. She was at the hall of fame last year. I know but she's getting inducted in the Hall. Yeah, she'd be the DX mascot better than Hornswoggle. Are you gonna try to get her to come out on stage with everybody? Okay to have a strapped to your chest had to ask. All right.", " everyone", " appreciate everyone tuning then hoping everyone enjoyed the banter this week anything we mess now, nothing nothing. I think we covered it. All right. All right. Well, let's get the fuck out of here though follow us on Twitter at the real Xbox subscribe to our YouTube youtube.com slash xpac follow me on Twitter at Jimbo in the booth and hopefully I'll see y'all next week. And if not, hopefully I'll see you all at Mania. All right. All right, don't forget to follow the Twitter account at xpac one to 360 show.", " Make sure to check that out because we are posting giveaways and lots of information on there. So make sure to follow that you guys can check me out on YouTube youtube.com slash Jenny Salcedo Instagram and Twitter @ underscore Danny saucedo and I'm Steve cropping find me on Twitter almost exclusively at Steve Kaufman. That is K UF M and N. I'm involved in a lot of YouTube Pages for some of your favorite wrestling star. So if I tweeted link chances are I'm involved so support them and support me. All right. We'll see you right here next week.", " From AfterBuzz studios in North Hollywood, California from executive producers Maria Menounos, Keven undergaro Phil's feet x Sean Waltman producers Mark bead Annika Jimbo Frank than the entire Xbox One to 360 staff. We would like to thank you for tuning in like us on Facebook rate and comment on iTunes and YouTube follow xpac on Twitter at the real X pocket email us at ex Pac-12 360 show at gmail.com the Westwood One podcast Network."]}