{"showID": "0a5DJZA0NWLIGWTMasTNYq", "show_name": "Tucker & Maura", "show_description": "The Tucker & Maura Podcast", "episode_name": "Tucker & Maura", "episode_description": "The Tucker & Maura Podcast", "transcript": ["Once you want to yeah, hey waking up with energy 95 three now. Here's Tucker and Maura welcome to the take to podcast you've made it you have arrived. So this is where we look back at the week on the air the week that was so if you missed anything, you might get a chance to hear it in this podcast and if it's something you heard before in your like I", "This already then you just press that skip 30 seconds. Skip 30 seconds give 30 seconds, but maybe it'll be even better. The second time could be don't forget to subscribe to the podcast. So, you know when the new one comes out and we'll do it every week. Thanks for listening over the weekend. I had an opportunity to see somebody live that I never had any intention of ever seeing live. Oh, yeah, and I was impressed. Okay, you know a friend of mine.", " Sent me a text on Saturday and said hey, I just got free concert tickets for tonight's show to see Bob Seger perform life on a silver bullet bed. You be nice goes over Coons off to share. Yeah, Danny.", " Let me tell you people love what he played things and I was trying to think because again, I was just looking to go out. My wife was feeling kind of my grainy and the mood home was a little dark and I wanted to hang out with the elderly. Oh my God. I was among the youngest people at that show guaranteed was that nice to be like one of the hot ones?", " I was like, there's a lot of people came to the show in a pickup truck today. No offense to anyone who drives a pickup truck but I bet your pickup truck parking was at a premium and and it was jammed. It looked like it would have been sold out. I didn't see an empty seat anywhere and people love Bob Seger and then I started to realize how many songs I knew from Bob Seger. I don't know any another what you do, of course you do, you know this song here.", " You know this song because every commercial it's like a pickup truck commercial for the yeah, and then you'd be like, oh my God. I know so many Bob Seger songs. Okay, you'll know this something against you know this song.", " Like I know that song. Yeah. Oh my God, you know this song Here Night Moves. Yeah. Okay. Yeah. This is ringing a bell. We see if I can fast forward to the good parts of this is after they do, you know people dancing.", " Really embarrassingly remember this sucks. It was like an old people's kid Mansion turns out I know a lot of Bob Seger songs, and it was a fun show Dave just sent us a text at one eight hundred ninety. Five three. 2464 Turn the Page is one of the best Seeger songs every turn the page you turn the page horse. He did Turn the Page.", " Oh, no, I know this song. Well Metallica does a you know big version of this song is hard to get into the aisle because there were so many Walkers there blocking the way no, but people had to go to the bathroom a lot and lots of people that are always like making you get up so they could get by big lineup set the batter but you loved it. I had a great time because it was free. It's like one of those things like for a free show. It was perfect. Yeah.", " Don't great seats songs. You recognized and Bob Seger writes his Farewell to her. He's 74 that guy. Yeah, I know look pretty old. But still does a good job high-energy radio. Who's this Andy? How are you Tucker? Good candy. What's happening? Well, I'm like a little offended by Moira and her", " comment. No, I know I will say though it was it at the Bob Seger show. Were you there on Saturday? No, but I'm only 51 years old and I bought my first box here when I was like 15. Yeah, and you know what when you bought that old, how old is Maura Maura is a 55, but you know, what you need to know. Is that when you bought that album from Bob Seger when you were 15, he was already 45", " I'm just I'm just making fun of she's ripping on me because I was at the show, but I will say average age of the show would have been you know, 55, probably. Yeah, probably right and nothing wrong with that.", " yeah, I was just saying to Tucker it actually the", " says they say now she's ripping on you again. There you go. She talking about adult diapers. I think right. You know, I'm trying to stay on top of my kegels girl. Yeah. Yeah, it goes away. Just wait. Okay. Hey, thanks for the call breathe.", " People can give some really extremely strange gifts from time to time and we want to know what the strangest thing. You were given from a loved one from a friend. Yeah Mora got a blanket at which on the surface seem like it was a really kind of neat interesting gift from your mom. It's funny. It's just because she had come back from this trip from Ireland and I thought oh, this is like a beautiful Irish wool blanket that you're", " Giving me but it's actually one. She just found in a garage sale and Guelph where she lives and it's not even wasn't even for sale. It was on the floor of the garage and she just made a side deal to buy it prisons. Like can you believe somebody bought the blanket that I wrap Furniture in? Yes, so we just want to know what the strangest gift you got is if you want to be a part of the conversation either by text or if you want to call us. The number as always is one 895 324 64 Cory. What's the", " ranges gift of family member a loved one gave you it's a teacher gift and I got a", " it was made from", " Summerlin", " apparent be like red fur like it was like a landscape. And so that she would do a load of wash with predominantly red color so that your lid would be red. And what did she do in the way of art? Like was it abstract or was it actually like a picture that it was a landscape like a tree? Okay, and so she would glue the lint to a canvas or a piece of paper and then framed it and where is that?", " Picture today in the garbage ha ha they say you shouldn't give Art as a gift. Oh, yeah, especially just like them all like that hair and oh, yeah, that is so bizarre. I love it that makes Morris wool blanket seem like a nice gift. Hey, thanks, Cory.", " And if she does belly button lint art as well, that's gross every day. It's always a little bluish gray. Mike just send us a text one. 895 324 64 the most awkward or weird gift was a wedding gift my wife and I got portable fan a portable fan that you plug into your cigarette lighter in the car. But the second part of the gift gets better. We also got matching hats from the company the person", " Worked for so really it was free Jamie what strangest gift you got? My mom gets me really weird t-shirts every time she traveled she came back from Asia about seven years ago. And she said Jay my I saw this and I instantly thought of you and so she was really building it up and it was a bit dazzled Psy Gangnam style t-shirt.", " She said she saw it and she said there was nothing else. That was more me and I didn't understand. What is that supposed to mean I have no idea and it hasn't really improved. Then was it the still of him where he's sitting on the toilet? No, it was like the Gangnam Style dance, but completely bedazzled. Oh, that's pretty amazing. Wow. A lot of work went into that shirt, you know, I guess you just", " To the wrong person. Hey Jerry, thank you. Have a good day. There is a version of the ABC song that is throwing people off big time. Yeah, and when you hear it, it's going to sound really out of place. Okay, what's happened is and this isn't even knew. This was something that I think was made five or more years ago. And it's just gone viral on Twitter, you know, sometimes things just sit there. Yeah and people discover it and get word out. Yep. And", " the problem with the ABC song according to a lot of people is that when you get to the elemental P part, it's like, you know, you have to hijklmnop and it's like what's elemeno my toddler totally thinks that that is a word element. Oh, yeah, LMNO LMNO P. So what they've done in this version is they've slowed that whole part down and it it messes with you pretty bad ABCDEFG normal so far eight.", " I j k l m n o p q r s t u v w x y z that doesn't feel right. Does it now? You see the Dilemma that the original creators had when they came down to the", " Amen. Oh, yeah, you know what I'm saying? If g h i j k l m n o p q r XT you that's not going to work and why is it that Twinkle Twinkle Little Star has the same Melody as the a", " PCS and like a bunch of other ones. Yeah, it was because it was all based on. What did we discover the other day with Mozart's to Mozart original and all these other children's songs were derived from my daughter every night asked me to sing her a bunch of songs and it's all the exact State take Mozart for that. If you were watching the World Series Finals in baseball on Sunday night, you might have got it.", " An eyeful, if you happen to look behind the catcher during one of the pitches Tucker walk me through what was going down. Well, there is these ladies right? He's a baseball game and normally Behind The Catcher And that whole area that's always on TV. You see a bunch of rich people who look bored. Yes. They never seem to be as excited as you would be if you were sitting in those seats. Yeah. Well, if you look to the left and the shot all of a sudden these women they were standing", " Up, they must have you know event figured out if they were going to be on television or not. Maybe they had an earpiece in and someone was telling them. Okay do it now do it now, but when they were on TV, they lifted up their shirts and showed their but I asked to the world and nice Accent on breath, press my favorite part of this whole thing though. Yeah, and it's Incorporated in the video that I retweeted not safe for work.", " Yo Tucker on Twitter is the video that I retweeted is just people watching it back on their PVR and it's a bunch of dudes making like the do deist reaction. You'd imagine what it's Series game 5 millions of people watching.", " It really spoke simple are pathetic. I know.", " They found the women and they have been banned from Major League ballparks in definitely it's a shame. There should be invited and doing a tour of the major league ballpark go to Major League Baseball games not wearing a shirt and have their life chest painted with a number on it. That's a really good point can't ya they also say that we're", " Raising awareness for breast cancer. I don't believe that because that what I read is they were promoting their website that they model for. Yes. They look like models. Let me tell you that. Yeah, hereby banned from all major league baseball stadiums facilities indefinitely. So there you go. Did you try to buy tickets to see Hamilton the new Mirvish production coming to Toronto forget about it. They had record-breaking ticket sales.", " Before the show is even hit the stage. There has been ten times the interest in this show more so than any other show that they have had. I think the part of this production coming to Toronto that's going to be the most confusing is when people are like, oh, what you doing this weekend. I'm going to Hamilton and I'm going to be like, oh, yeah. What are you going to do in Hamilton going to be like no. I'm going to Hamilton. Yeah, like 40 minutes down the road or you know, I live in Hamilton. What do you mean?", " I'm going to Hamilton it makes it complicated. I never thought of that but when you're going to say that you're gonna have to say I'm going to the musical Hamilton. Yes preface it and be careful. They're saying that there's going to be a lot of scammers out there for this show in particular because people want tickets. So make sure you're buying them from somebody who's not sketchy Maura. I just bought my tickets for Hamilton. It turns out there GO train passes from Union Station all the way.", " It's Tucker and Maura with Tyler Shaw. Yeah, a guy he have often referred to as the nicest guy in music.", " Buying a song on the weekend from iTunes. Hold on. Hold on. You're buying a song. I can crazy right? I haven't heard someone say that in a long time by a song. So it's 99 Cents and you're not a for streaming services. I don't know. I'm gonna applaud you on this. There's not a lot of people buy music anymore. Yeah. I wonder to myself it. Would it happen to be a Miley Cyrus song. I wonder if Miley is going to get a notification.", " Ation that I bought a song do you get notifications when people buy your song know you don't do not know it's not like if they like a post on Instagram Alert on your phone. Yeah doesn't work like that. No look with you sold for more in the last ten. Hey, by the way, I was just watching the updated video for this song. Oh", " And you put it all out there. I did it was like it was like walk. I felt like you invited me to your house and you were like, hey, do you want to watch my wedding video Yeah, essentially. No it was it was the happiest day of Our Lives the wedding day and it was a very easy decision to piece together. Did you get any angry DM's based on the fact that you got married wasn't so much angry as it like, ah, damn. Yeah. No, no threats.", " Actually, I've come through so that's positive. We're with Tyler Shaw this morning. And what is the most common question you get from somebody who's just met you have you met Drake? Really? Yes. I'm not even kidding. You have you met Trish? I have not. Yeah it is.", " But he is at well, I mean the music industry is very small, but it's not that smart at the bar for Canadian musicians like the ones that have met Drake and the ones that have not tell you he's probably never around. How are you going to run into him? Yeah. I know. He's probably playing ball in his Bridle Path. Oh my God. Yeah. We were just hanging out backstage with The Chainsmokers and it just looked like being on the", " the road looked so much fun. It is fun. It's a lot of fun you love it. I love it. Yeah, Tyler Shaw your go-to meal when you're on the road when you have to eat at a chain restaurant. I don't have a chain restaurant that I go to you. Don't ever pull into a Tim Hortons and grab a snack. I do if it's Tim Hortons It's usually the bagel belt. Yes. Yeah. It's like the best it's the best thing to have with sausage though. Okay, I do beg your belt with ketchup. I have them add it in advanced leaving. No Tyler Shaw.", " Guide music right here. We told you you don't even have to see him perform live to like the guy but but I encourage you to come see the show. You need to see the show. Yes. You need to actually meet Tyler Sean. We can make that happen. In fact, we're going to give away a pair of tickets right now. It includes a meet-and-greet. That means I'm guessing you're going to get a picture. Yeah with probably not just the nicest guy, but probably the most handsome guy.", " How did you not make it in any of those Twilight movies? Honestly I get compared to what's his yeah, dude, of course. She do she does. Sure. No, no the other use me Edward. No, no, you get compared to the guy who had his shirt off the whole time. Whatever his name know if you guys know but I was in a film that was just released last month. Come on. Yes. It's now available on iTunes in Canada and Amazon Prime in the state's. Yeah. It's called the meaning of", " Life, I'm the lead in the movie. Thanks for coming in man. Thank you. My pleasure. Thank you. We want to know what do you do and we want to know what the most common question you get when you tell people what you do is yeah, we talked to Tyler Shaw. He's a musician earlier this morning. So what's the most common question you get he says, do you know Drake? This is answer people ask him all the time. Do you know Drake? Wow, I would have never thought of that is being the question. Yeah.", " Start with Laura. What do you do Laura? I am a travel consultant. And the number one question is how many free trips do I get every year? How many do you get? Well, they're not really free. I do get a do get a trip sponsored by my employer once a year. Mmm. Then any other trips usually get a discount do you ever get sent to places just to check?", " I'm out. That's why we go. That's exactly why we go. Yes any other questions you get where my favorite destination is. Where is it? Well about 20 years ago. I was sent to Puerto Rico and it's always been my favorite from bioluminescence. They to the spelunking to the people. It was just an amazing amazing Place. Everybody should go there interesting.", " Or Tirico not never been on my radar, but maybe now it is. Yes. It's a great place. It's a great cruise port to so thanks for being on the show Laura. Okay. You're welcome. We just got a text. I work in a mental health hospital in a forensic unit conducting assessments on people who have committed crimes and my job is to assess if they are criminally responsible. The number one question I get is do I meet them one-on-one alone, or are they behind?", " Glass and she says I meet them alone and I love my job. Wow, interesting. Yeah. Hmm. Happy challenging. Yeah, Joanna. What do you do? I'm a mystery shopper a mystery shopper. Yeah. So you go undercover and you evaluate different businesses. Okay. And so what's the number one question you get when you tell somebody that you evaluate their you know locations. Well, don't they? Did you evaluate me? Like they want to know what businesses?", " Has I evaluate the community the main? Can you tell the people at the Gap to stop saying hi to me? What as soon as I walk through the door. Give me one second to breathe. Okay. Well you can put we can put that down as evaluation, but they're not one of my life. Hey, thanks for calling Vicki cenis attacks who says I'm a nine one one dispatcher. She's got to get a lot of questions. She gets what's your worst call?", " And I'm like dude nobody calls when they're having a good day. Yeah, there are all of them are the worst the worst calls. Probably a butt dial. Oh, yeah, RC boat people who are just trying to turn their volume down on their iPhone and they don't realize they're tapping the wrong button. Like I did accidentally calling 9-1-1. Yeah, let's grab another quick one Tracy. What is it that you do? Yes, I am a social worker in town.", " Interesting. So what is the number one question you get when you tell people that well a couple things the first no pun intended. It kills a conversation. Yeah, no one wants to talk about death and dying. Yeah, but the main thing is people ask how do you do it or I couldn't do it or the other one is so", " I lost my father in law earlier this year and he spent a couple weeks in a palliative care building in Montreal and the people that work there are so unbelievable and they make it feel like it's a home. You know what I mean as opposed to being in a hospital environment. So you guys do really cool things. Thank you. Yeah, we just my daughter's that just died two months ago. So it's been tough going back, but it's nice to be on the other end now and helping people, but we are amazing. You guys are doing a great job. I", " I love your station. You guys make me laugh hysterically every morning. Well, thank you very much today. We're akka fi ya.", " Thank You Hamilton Toronto and we're I can find this morning with our friend more aw who's going to take a regular song we play on the radio and rock a Fayed more are you ready to rock if I am I was born", " Okay, here is the song identify the name of it and you win.", " I don't want to be at and I never wear a suit or tie. I'm wondering if I could speak out the back baby. Nobody's even looking in my eyes.", " Yeah, then you take my hand finish my drink and save shall we dance? Hell? Yeah, he'll do the air. Oh boy. Yeah, seriously. Was it too much? I feel like it was great. But I honestly, I think it's really hard. Is this Kelly?", " Yeah. Hey Kelly, you're gonna get the first crack at this you tell us the name of the song and you're walking away with the prizes. I don't care by Ed Sheeran. Just oh my God. Now, you're a lyrics person. I guess Kelly. I love when you guys play these games music. Junkie. Okay. Wow, I knew the song and I didn't even recognize it when more a rock if I did.", " Wow, nice job. Congratulations you ever look at somebody in your like they are living the dream. Well, that is our producer Chris Bundys. He is living the dream or did to you he's living the new Call of Duty just dropped on Friday. Hmm. I was really excited to play it. Okay, so I basically hunkered down all weekend. Yeah. Listen to his diet like, okay. So Friday night. What do you what do you have for dinner Friday night Friday night. I had a large pizza to myself.", " Okay. Now this is a guy who by the way is sometimes fast 20 hours a day, but currently is on a 16 hour schedule. I mean, that's Monday to Friday for you. Right? What was the first meal of your day on Saturday Saturday morning was pizza. Okay, and then your next meal. I got a new pizza. I went just straight pepperoni, but I went to a different place. So just change it up a little bit.", " You live your to surrounded by pizza joints, right? Literally. I have three within like a two minute walking distance on each side of them, right? Okay. Yeah, so you've had pizza for dinner on Friday Eve had pizza for kind of brunch on Saturday and then a dinner or do you have like a midday Pizza meal? No, it was like I killed the leftover hunting. It was like about four slices in the morning. Okay, and then you're a good till dinner get dinner got on Fresh got a fresh pizza and a half of that. Yeah. Okay. So when do you", " Other half of that Sunday morning, and I'm not even kidding you. Yeah, and then I went and got one from Little Caesars will hot ready little small man whom he had pizza for dinner. So you only ate pizza. I literally played video games and ate pizza all weekend long. He is living the dream or the dream to me Tucker because you don't like pizza.", " That's all my life. How many hours do you think you logged on a video on your Xbox my God, Friday Saturday Sunday at least eight a day eat a day the 24th. You crave, Bop like we're legs cramping my thumb actually little bit. Yeah look, so weird all that pizza holding or is it the video game remote control? That's cause again looks like your thumb is dislocated look at it.", " It's all that malnourishment. It's turning you have an effect on his joints were the vision of Health he did. What's your favorite place to go to for chain Place Little Caesars Domino's Pizza Pizza Pizza Ville. You know what Pizza Nova had always been my favorite. Yeah. Domino's is starting to take over. Oh, I don't know. Maybe it's just the dominoes that happens to be", " Across my street. I was never a fan of it until I started going because yeah literally right there and that's grown on me quite a bit now and they go bundle.", " Are you going to come for the party right now? Ask me what I want like soon as I walk out there like hey and they punch it in and I just now Pavarotti. He's a pepperoni pizza guy energy what's going on fundus is living the groundhog day dream of every guy from the age of 30 to 35 you starting way too late man at that starts at age 12, I think pizza and video games all day. Come on. Yeah, but when you're married,", " And you gotta act like kids and stuff and you're 35. And all you want to do is play Fortnight all week. Any terribly right? You have an appreciation for the missing right? I want to live vicariously through Congress. Oh, this is what I do. This is how I even came to find out. You know, what is Diet was is I just like to live vicariously through him said I'm at home eating quinoa turkey sausage.", " I would just add a bed of kale to that. You know. Yeah, why not? I want to spend the night on the toilet. Yeah, it's are all weekend isn't going to put you on the toilet. No, I got a cast iron gut, but you start putting healthy stuff in there and she's upset the water work. Yeah. Yeah. You don't need that kind of disturbance. No. All right. Well, I'm glad I'm glad you're enjoying living.", " Seriously to Bundys as much as I am living the dream bundesbank you thank you. Have you ever tried to sell something online and you just get low baller after low baller? Well, this guy has come up with the perfect solution after trying to sell a classic car. It was a 1970 Dodge Charger and he was trying to sell it on Facebook and he just felt like buyers were wasting his time.", " I'm coming in and low-balling him. You've been there. Right? Well, my the thing I hate the most is if you're having a garage sale and you're essentially giving stuff away for a dollar to and people come in and they'll be like I'll give you 50 cents when you thinking I'm already giving it away for two dollars. It's the fun. The barter is the fun. No, I would rather donate it to Goodwill or something like that then sell it to someone who's trying to be that cheap.", " Okay, so this guy was so sick of everybody wasting his time that he decided it would be more gratifying for him to film his friend smashing the classic car with a forklift then to actually sell it to the low ballers.", " Yeah, everybody wants to be a car guy touch time to do car guys. That's what you get. Don't bother the seller. If you ain't buying that's pretty great. That's what you guys yeah. See, my wife just had a garage sale when I was out of town and that she knows better to have me there because I would be doing stuff. I would rather smash something in front of somebody who was low-balling me that I'm selling then sell it to them.", " Well the risk, you know, what the most of the time if I'm selling something online. It's an amazing deal better. I sell stuff to sell. So again, like if it's a children's toy that was originally worth $40. It would be sold for two. Yeah, and it's in perfect shape. Give it some times P I would say because I do buy a lot of stuff online second and people are trying to make money. Sometimes that's what they do for a living. Yeah. Well, you know what the worst is when they agree", " Ritu a price they show up in yellow you take 20 less and you're like no my buddy was selling his couch and it was literally on the guys truck and then he decided he was only going to give him half the money. Yeah. So that's super annoying me then I would make the guy take it off the truck. Yeah, we're back up again. I'd rather give it away at the end of my driveway then give it to that person right trying to lowball me or get your buddy with a forklift. Yeah. That's what you guys. Yeah. That's what you get.", " The queen has royally dissed Megan and Harry apparently Tucker. She was not too pleased about that very raw TV interview. They did where Megan and Harry said it was really hard to be royal. It's not enough to just survive something right because that's not the point of life. You've got to thrive you got to feel happy. And I think I really tried to adopt this British sensibility of a stiff upper lip, but I", " think that what that does internally is probably really damaging and", " The biggest thing that I know is that I never thought that this would be easy also like Harry talked about his relationship with William being strained now. Yeah, so they went to talk to the queen about taking this six-week break. They say they really need it. The queen said that she was delighted and couldn't wait for them to leave. I'm hearing she also said she's ready if they're ready to strip them of their Royal titles.", " Take away their newly renovated home the Frog more Cottage. Take away their fifteen million dollars in financial support. The Queen's like ready to pull the rug. No problem. You got a problem with it. Hey, you happy to let you go happy to let you don't have to stay. Lots of people leave the royal family and here's something that is so interesting. And I think this is just gossip. Listen to this. There have been pictures taken in the room where the queen receives people like the British prime minister. She has kind of like a meeting room. Yeah and on", " On the side table. There's this picture of Harry and Megan at least there wasn't July in a recent photo that picture of Harry and Megan is no longer on the frickin side table Maura, you've got to be kidding. It'd be better if it was just smashed it but I mean from the glasses all shattered just sitting there. Yeah, one of those circles with the line through it.", " American in Harry, it's just so funny to me, you know, but but I looked at these pictures and sure enough that pictures been removed from the side table of the queen. Oh my god. Did the queen poo on the picture of Prince Harry and Megan Marco smeared across the globe. I really think Megan Markle came into this thinking she was gonna change the royal family in the way. They do things. I'm a breath of fresh air in this stuffy old.", " Ian and you know what Princess Diana tried to do the exact same thing she was going to revolutionize the way people looked at them. Yeah turkey and you know what? It didn't work. I'm still thinking that Mega Markle is a breath of fresh air. I still believe yeah, but it doesn't go over well there and they haven't gone all that tension just creates like this negative energy. The Queen's like stuff it down get the hell out of here then if you don't like it love it or leave it and so", " She should because this is an institution that's been around for however long you known you don't like history. And if you want to know what the queen has stuffed down you need to just watch the queen. Is that what it's called Crown the crown? I mean she had no problem for venting her sister from getting married. Yes, just because the guy was bit scandalous her uncle who is King wanted to marry someone who is divorced and they were like he had to leave the country and not be king. Yes.", " They think they're you think Megan Markle some actor from Suits is going to come in there and change the monarchy forget about it will take you back come back to Canada and just call Toronto home already. What job today? It's Kijiji prices, right? Yeah Devil's Night Maura. It is tonight it always always the Night Before Halloween now some cities are way more into Devils Night than", " Others and this morning we are going to feature all items that would come in handy. If you're going out to quote celebrate. Now keep in mind we wouldn't encourage anyone to break any laws or to vandalize anybody's places, but it happens but it happens and if you're gonna do it you might as well have the best tools available who we playing with this morning. We're playing with Peter. Good morning Peter. Hello Maura. Hey Tucker is going to tell you about an item and then", " you're gonna have to guess whether the actual price is higher or lower than what he tells you. Okay? Okay. All right Tucker. What's our first item up for sale? Well Mora lighting fires with matches or a lighter is for jabroni knees if you want to make an impression with your Devil's Night vandals, you need a flamethrower and why not buy one made and designed by the one and only Elon Musk The Man Behind the Tesla CEO Elon.", " Decided one day be fun to make a flamethrower so he did it but he only made 500 available and they sold out right away. So keep in mind we are now buying flamethrower that is a collector item. Okay, and this and it's actually called not a flamethrower. Oh clever not a flame floor playing floor and it can be yours for the low price of", " dollars. Okay. Peter is the actual price of the flamethrower higher or lower than $1,000 and keep in mind. This is the lowest price. I found for a Buy It Now version of the flamethrower on a reselling website. Let's go higher. Congratulations on that one. Yeah. Well done. How much was it $1,500?", " Is the current low price for one of these things get it. They look pretty fun. I can't imagine an application where it would come in handy for any reason other than what campfires imagine letting a campfire with one of these wines this that'd be pretty cool. Okay Tucker, what's our next item up for sale? And if you get this, right you are a winner. Okay. Well, you can't call it devil's night. If you don't have the chance to toilet paper somebody's place, but what do you do if that person?", " Lives on the 10th floor of a Condo building you buy the plans and make your own Magnum toilet paper can in Mora shoot up to 5 rolls at a time as high as 200 feet in the air take aim at that upper level condo and fire away with your Magnum toilet paper Cannon. It will also shoot stuffed animals t-shirts and unwanted laundry, including your underwear.", " And the plans to make your own Magnum toilet paper Cannon are yours for just a dollar 99? Okay. Peter is the actual price of the toilet paper Cannon higher or lower than a dollar 99. It can't get much for that for let's try higher. Wow. You would be right. Yeah, the guy who made it no selling.", " The plans once eight dollars and 97 cents for it. Oh good. We didn't even get to the container of 1,500 live ladybugs, but I guess we'll have to wait till next year. Hey, thanks for playing Peter and Tucker. Welcome to Dracula's very scary. It will give you this in Derry.", " Even send you to the mortuary Halloween challenge another way playing with mr. Bandas, Shauna Shauna. I then Shauna is someone suck all your blood out of you know, I'm here. I'm here. Okay Shauna, this is how it's going to work. I'm going to give you a very interesting tidbit of information about", " And you'll have to decide if it's the scary truth. Ha ha ha or a Dracula spoof. Meaning I just made it up. Okay, make sense. Yeah, all right out of five more for Shawna to win. Okay Shawn. Are you ready for your first one? I'm so ready.", " According to Pornhub The Adult Video website. Wait a second. Okay. I spent more time on I don't know. No, I never go there. I was just doing my taxes on my novel.", " Okay, the most searched for costume for this Halloween is our French maid costume. Is that the scary truth or a Dracula spoof? What do you think? I'm gonna I think the truth you're going truth on that one to decide The Rock You Lost Boy you got.", " but slam", " I'm pretty sure is also something you can see on Thornton of on either a move on to another one PornHub. That's good. That's good. That's good. Okay, let me get focused here. Okay for the first time in a long time Sean Michael Jackson and Elvis Presley or not the top earning dead celebrities this year number one is the ghost of Prince.", " This is now the top earning dead celebrities that hysterics word order. Dracula's full. You're going scary truth on that one as well. I am. Yes. I tell you what I want you to do Shonda for the next questions. I want you to come up with the answer you think is right and then change it because you are.", " Okay, that's okay. We got three more know your name is I didn't want it to go this long. I think if people will get very sick of Dracula's voice after a while. I'm enjoying it. Trust me. You'll be tired by question time. I'll get the lesson number three. There's a financial thing fact number three experts have figured out more on everybody the worst thing to give out on Halloween.", " broken glow sticks and candy from all restaurants free candy dish", " Is that the scary truth or a Dracula spool? What do you think Sean? I feel like raisins are the worst then, you know, that's probably the truth.", " Well, man's we heard one out of all the tracking us moves. It's probably got to be the scary truth the way I never met. You know, the topic search for costume is Harley Quinn. Oh, Michael Jackson is the most richest the dead celebrity from this year. Okay. I'm going to give a shit.", " Now we're getting somewhere. Yes. Yeah. Okay, two more right in your winner Shana think I'm waking up to a new survey 18% of people say their plan if someone comes to the door to trick or treat it is to pretend not to be home. Is that the scary truth or a drug in the hospital? How does life?", " If you're worried about you know time they get home from work today to get the kids dressed up or being hungover tomorrow after your party tonight. The good news is next year Halloween is on a Saturday. Is that the scary truth on a Dracula's back?", " I'm gonna say it. It's gonna fall on the Saturday. I think that makes the I think next year is a leap year and I've been through a lot of you'd leap years 2,000 apiece.", " What do you think Donna? Let's not make this game any longer than it needs to be. I think it is true. It is the scary truth.", " You got the PornHub the an adult entertainment website has released their top character and costumes searches for Halloween. Okay, so you'll never guess what the top two most searched for a characters are and they're actually semi related to each other. Oh, okay. They're related because of their", " They've started in the same movie together. The characters have the characters have been in the same movie together. One of them is the Joker. Oh, yeah, that's number two Harley Quinn comes in at number one Joker's girlfriend. And suicide. Is this about sex appeal I guess so because the whole Joker thing like that's more creepy than sexy to me. Yeah. I don't know who searching for it, but people are number three teacher.", " I don't know why that was just comes up in there Nurse is number. Nine made made french maid is number four. They're always French aren't ya bani cost you a kitty kitty cat. This is the number seven. Yeah princess is number eight and we've covered all the other ones number ten is Monster. What would be your thing like you more if you were going to open up the little laptop, you know, you're lonely husbands.", " Working a lot not getting the attention you deserve uh-huh and you were gonna go into the search bar and choose a costume and or character. Would you choose Jon Snow? Jon Snow Yeah you Google Jon Snow from Game of Thrones. Oh here he comes on the back of his nose Steed save me Jon Snow. Can you say to", " Insect guy he could have just hooked up with Mother of Dragons and definitely need to get all serious all the time. I'm sorry. He's got he's got standards. Okay, I would have thought you would have thought you'd be more attracted to one of the wildlings this show but I guess you're married to like a semi wildling with that big beard and everything. Your husband snow is still pretty wild. Yeah, so I would definitely Jon Snow will come to mind. Yeah. Okay. That's what you guys do when you're alone.", " And I mean there's is it in fact a search for something mixing it up a little bit. I yeah, huh. See my search wouldn't it didn't even crack the top 10. What's yours? Well, if I were to choose a costumer character in this is not something that I actively search out a lot of the time but it would be sexy librarian can't go wrong with the glasses a little pain in there. Yeah. Zach's hair back while dressed up. Yeah ever seen a real librarian who was super sag. No, never", " 0:10. Well, I have I have in movies that are normally just like yeah, am I being too loud? What are you gonna do? I may have come across the greatest news ever for people who like to binge drink and also smoke weed. It's so great.", " Great that I'm almost afraid to share the news because I'm worried about sending the wrong message. Right? I'm afraid to sit because people are going to go out and start smoking and drinking more. Okay, but aha people who drink and smoke weed they believe that the marijuana could help prevent liver problems in binge drinkers. So the mayor", " I wanna protect your liver. It looks like that could be the case. If you believe the study now keep in mind these studies seem to come and go. I mean think of how many study said it's great to have a drink a day, right and now it's like don't drink it all. Well, all I know is that if I was a part of this study as opposed to like some weird drug testing to study down the hall I do like, how do I get in on that study over there? How do I make sure I'm not in the group that's getting the placebo.", " So high and drunk right now, actually, it was non-alcoholic beer and you're smoking or oregano. Oh, okay, like great 9 all over again. Imagine because scientists working on that like how annoying would it have been dealing with the participants? Oh, I need you to focus. Okay. Now they just look like the health of the people and you know, the more I dug into it. I was trying to figure out like, how could it be possible that marijuana could protect your", " Ever from the damage of binge drinking now keep in mind still totally healthier to not do either right but is it possible? If you're a binge Drinker you should be smoking weed as a form of protection. If you looked at the study, you might actually think so their theories have something to do with the relationship between and I thought originally was going to be like, oh when you're super high you just drink less. Hmm because you don't realize mmm, but it has to do with the relationship between", " Marijuana and insulin production and they say that the insulin ends up serving to protect the liver from accumulating too much fatty tissue. Like it's a whole chemical reaction thing not just a psychological thing, which is what my guess would have been when I originally read the headline that is so interesting. They also say that cannabis has well-known anti-inflammatory properties and that could have another effect on your liver.", " You know to help defend itself from the effects of binge drinking the effects of binge drinking the worst, right? Uh-huh the world but they're not talking about being home alone. I know if that's what you're talking about. Can we got my God? It's the word. Can we get a freakin study about how to cure a hangover creddie? Yeah, don't drink so much and then they also say drink more if you're really hung over and feed your body. So you take yourself out of withdrawal also known as the hair of the dog. That is a study.", " That I have proven in research. That's why they invented the Caesar. The Caesar was invented for that. Perfect. And the Mimosa. Yeah. Thanks to you. There you go. It's a little bit of potentially good news. Enjoy it while it lasts because it probably won't last that long before they overturn their study and they come up with another one right? But again, let me stress two things. First of all shouldn't smoke weed until at least you're 25 because your brain is going to be permanently damaged. Yeah. The other thing is it's still healthier to just skip", " Drugs and alcohol. Thanks, Dad. Okay Cooper. Okay Boomer by the way, that's the expression. You're supposed to say when someone old is giving you advice and you're just like okay Boomer. He's a buzzkill. You're not gonna believe who everybody's favorite Sesame Street character is", " Now give him a keep in mind. This is all based on adult both votes. Everyone voted was over the age of 18. Okay. Elmo didn't win. Yeah, but it's all based also, unlike your experience growing up watching a show like Sesame Street and what you remember I don't know how many parents or how many people would watch it as an adult unless you were a parent. Oh God, it is, not Elmo. Elmo is not number.", " One on the list. So now that you're saying it's adults who voted I gotta go with Grover then because he's funny Supergirl and another way to look at Ya another way to look at it would be, you know to me if you were at a dinner party and you had to sit next to one of them. Yeah Who you gonna want to sit next to her over I would agree with you 100% Grover is the best. He's like caring he's cute. He's funny. Yes it R. We write it used to", " One choice, it's not Grover. Either. Really? Yeah Oscar the Grouch Oscar the Grouch is incorrect want to spend time with that guy to I want to say with just about everybody. That's true. He might be fine here. If everybody apart, right so- it's like wow, sometimes being around that negativity can be pretty funny. As long as you don't get too much of it. Like you would a down you wouldn't want to live in the bin with Oscar and", " Have to deal with it on a day-to-day basis, but for an hour and a half probably pretty funny guys have the siding. Yeah. Let me tell you about more a ho my God, what's hurt? You know what? I mean the person who topped the list Big Bird, it's not big bird. You did. Well though, it's cookie mod topped the poll my favorite Sesame Street character. That guy's just too messy though. The way eats like you wouldn't want to be around that.", " Have much depth to he's pretty much just like very surface like he wants cookies and he wants them to look up one note character. Yeah. Elmo was second. Okay, and I can't believe how does Big Bird beat? I mean so many others on this list including Grover big bird is third. He's like a big dork more like it. Hey everybody, like he always annoyed me a little bit. Whiny to yeah. He's always dealing with", " Something he's lost something he's upset about something. He's like the ER of Sesame Street little bits are always seemed to be going his way. From what I remember about bird Ernie. Well Bert no one's picking Bert because a stick in the mud birds the guy who's always reminding you how many calories are in something. You know what I mean, you're gonna have that are 43 grams of sugar in that coke Birds the guy that brings a toothbrush to a dinner party. Yeah. Yeah. Yeah.", " Yeah. Yeah, Ernie did better than Bert and Ernie's the best. Yeah, Ernie's pretty great. He's chill. He's got a great laugh, but Ernie's probably the one who's more likely to be like your husband is he's the guy who's hiding tallboy beer cans under the couch when he's done because he doesn't want to see them in his line of sight. So what are you saying? I'm you're married to Ernie. You're the Berks and that relationship. You're Burt would better eyebrows. So it was basically a three-way tie between Snuffleupagus Ernie.", " And the count I'll count to me would be annoying you counting how many drinks you're having announcing every time I pour myself another drink. That's a lie. Nobody needs that and the game this morning.", " Inge is Emoji or fo G sexting addition explain how this is gonna work Maura? Well Tucker Apple just released 400 new emojis, and now that Instagram and Facebook won't allow the eggplant and the peach to be used together anymore. These are the new emojis for sexting Tommy. You ready for emoji or fo G. Number one, you have to decide if this is an actual emoji that people could use for their romantic Commerce.", " Stations or something that Maura just made up and right. Let's do it more on. What do you got for us? I want to let that casual hookup know you're ready for an after the bar booty call send them the new booty call Emoji. It's to cantaloupes and a clock next to it that reads 3 a.m. That an emoji or boji.", " That's a tough one. I think I think that might be an emoji. That's a real Emoji more. I is Tom's answer how many right does he need to win? Three three? Okay, that's a fo G buddy in a clock that says 3:00 a.m. Are you dreading that off?", " Awkward conversation about getting tested with a new lover be blunt about safety and use the new STI tests Emoji. That's a a doctor holding a Q-tip with the thumbs up for the thumbs down. Okay, Tom the STI Emoji is that an actual Emoji that's coming our way with the new release from Apple or is that a fo G something?", " Not just made up. All right, I think it maybe this one might be a full G8 also Maura that is right. Yeah good one though. I still think I'm like the booty call one better. But you know, hey, look both great ideas. We got what do you got for us? If you want to experience a hook up in a dangerous place. I know that's you Tom.", " I see like that send your lover the getting caught in the act emoji that is to buck naked people emojis running from a police officer. Is that an emoji or is that a fo G? I'm gonna go with 4G again.", " You're right. That is a phone. Well, you've got to write you need this one. Let's make it happen. Okay, you want to tell your partner that you're interested in a group session. Oh, yeah you selling you gonna trade gold for cash.", " Oh, yeah. Yeah, you're interested in a group session. Okay, why not send your partner the plate of falafels Emoji. It's one giant plate piled high with delicious-looking Falafel balls interpret it as you will is that an emoji or fo G. I'm going to guess for Gia Gunn.", " It's a it's a new Emoji action. And some people are suggesting that that is going to be a great one to get a group session going. Yeah. Okay, they say it's going to be a sexting emoji and I'm like, how is a plate of falafels sexy maybe groups Ash? I don't know. What do you got for us Maura last chance to win here. You're on the verge of a nasty breakup and ready to tell your partner. What's on your mind?", " Like how small they are, maybe nothing paint a clearer picture then sending them the pinching hand emoji. Very small. This is this big wafer-thin wait for thinning. Is that an emoji or a fo G you need this one for the win? I don't know. I did. I don't know if if if I were a betting man I'd say that's actually an emoji but hmm, you gotta decide.", " I'd for yourself Tom on this one. I was kind of leaning that way too. So I'm going to say that's an emoji. Yeah, let's see if that's true for the wind Maura. Yeah. Well done. Look forward to using some of those emojis in the near future an upcoming iOS release, I guess haha, and some of them probably should exist. Yeah getting tested Emoji great idea great idea Earl.", " This week we were talking about how Facebook and Instagram can now flag your account and even kick you off the app. If you use emojis like the eggplant and the Peach together, which is so funny because it all it means is a vegetable and a fruit. You know, this is I make an eggplant Parmesan and peach cobbler for dinner. Are they gonna ban the okay hand symbol with the finger point symbol, which you know what that means, right? Yeah. I mean look at that, okay.", " a sign", " Exactly. Yeah, look it over there. So, you know apples releasing 400 new emojis and everybody's kind of scrolling through them going. Okay, which ones are going to be the new sexting emojis. Okay, these I get some of them I don't really understand what's sexy about them. So you're going to have to help me. My mind isn't dirty enough clearly. This one's the most popular. There's a person kneeling. Okay, that's pretty obvious.", " There's a Speedo Speedo there. Okay, there's a noise. What does it the speedo? Probably looks like you're just wearing skimpy underwear guy in a speedo. It's just a speedo. So I guess you would use that with something else like oh, I can't wait to look at your Speedo. We have the speedo and then maybe have the finger pointing down like yeah, you could do that. Well the speedo down. Oh, yeah. All right. Now I'm fair enough the oyster. Yeah.", " I love Buckeyes shock fingers pinching. I guess that's only if you want to rip on somebody a little bit. Yeah, I don't get why these ones are considered dirty though the plate of falafels we were talking about this people are like, oh, yeah played a falafels send that to someone and they're going to know what you mean. Well don't falafels kind of insinuate fun. And then you have a plate full of falafels. See fun. No. Yeah. No, I mean I enjoy a Falafel don't get me wrong.", " I'm I'm all over Lebanese. Yes and Mediterranean style cooking. But yeah, I don't know. I have a I have trouble believing that anyone would know what that meant. Unless they were told what it meant in advance the flock if I said, oh it means it's group activity. Yeah, but that was just my guess. I don't know. Oh, so you don't know what they're what the connotation is. Well, you know what it is. It's like it's late a Falafel the plate of Falafel balls, right? So don't you think it must be great if you go back and you just", " The Falafel part of that. It's a plate of called. Yeah, so thank you. I was trying to be a little discreet about it, but it is like sometimes we try and be a little discreet. I know your life is a giant adult video but coconut I don't know but if you put two together, maybe yeah goggles and a snorkel.", " I'm afraid of what's gonna come out of his energy 95 three."]}