{"showID": "000HP8n3hNIfglT2wSI2cA", "show_name": "Morning Cup Of Murder", "show_description": "Ever wonder what murder took place on today in true crime history? If so, sit back and grab a cup of coffee as you enjoy your daily dose of TC goodness. Your host, Korina Biemesderfer, guides you through history with tales of murder, abduction, serial killers, crimes of passion, cults and more in this short form daily true crime podcast. Support this podcast: https://anchor.fm/morning-cup-of-murder/support", "episode_name": "The Goleta Postal Facility shootings- January 30 2020 - Today in True Crime History", "episode_description": "See something, say something. It’s a mantra many live by. If you see something strange, call it in or make someone aware, even if it seems innocuous. Jennifer San Marco had strange behaviors. It was clear to many that the woman suffered from mental illness that was being untreated. But, many wrote it off. And, on January 30th 2006 her strange behaviors bubbled over and the Goleta Postal Facility shootings began. Jennifer San Marco Kills (2006) Become a supporter of this podcast on Patreon: https://www.patreon.com/morningcupofmurder Follow Morning Cup of Murder on Twitter: https://twitter.com/cupofmurder @cupofmurder Follow MCOM on Instagram: @morningcupofmurder Have a Murder or strange true crime story you want to share, email the show here: morningcupofmurder@gmail.com Morning Cup of Murder is researched, written and performed by Korina Biemesderfer. Follow Korina on Instagram: @kbiemesderfer  ---   Send in a voice message: https://anchor.fm/morning-cup-of-murder/message Support this podcast: https://anchor.fm/morning-cup-of-murder/support", "duration": 6.019383333333334, "transcript": ["There were two more murders 15 miles away arrived. They found the tell me how the investigator as reminiscent of see something say something. It's a mantra many live by if you see something strange call it in or make someone aware even if it seems innocuous.", " Jennifer San Marco had Strange Behaviors. It was clear to many that the woman suffer from mental illness that was being untreated but many wrote it off and on January 30th 2006 her strange behavior is bubbled over and the Goleta postal facility shootings began. So if you like your coffee hot, but your bones chilled sabacc and start your day with a morning cup of murder.", " On January 30th 2006 a woman entered the US Postal Service processing plant in Goleta California with a plan. She tailgated the car ahead of her and passed through the gate while in the parking lot shot and killed see Fairchild then turn to Malika Higgins and shot her at point-blank range. Next was Nikola Grant upon hearing the shots many of the employees ran to the window to see", " See what was happening what they saw was a woman. They all knew Jennifer San Marco. In fact, the shooter worked for the company for many years before being asked to retire for health reasons when she made contact with her scared X workmates. She smiled Jennifer then gained entry to the building by taking an employee ID badge at gunpoint. This employee was told to leave and was able to escape others weren't so lucky this building houses around", " 80 employees all of which were now sitting ducks. She then shot supervisor Charlotte Colton. She was dragged into a room by a fellow co-worker and was able to be transported to the hospital where she was died. Just two days later Jennifer headed to her old workstation and shot Guadalupe Swartz as she tried to flee next to Parish was Air Force veteran Dexter Shannon who had headphones on and did not hear the shots. The final victim was Jennifer, San Marco.", " Herself as she turned the gun around and pointed it at her head after the dust had settled police found another victim Jennifer's former neighbor whom she had had an argument with Beverly Graham have been shot and killed in her home before Jennifer moved on to the postal plan.", " So, why did Jennifer do it? Why did she go to a place where she worked where she found friendship and take the lives of six coworkers? Well, the answer lies in the reason Jennifer was asked to retire and in the stories of those around her Jennifer born December 6th, 1961 in Brooklyn New York went to work at the postal plan after leaving high stress job of police dispatcher in the mid-1990s in 2003. There was an incident at the plant.", " But that required her to be removed by police. She was found alone in the parking lot kneeling on her car and speaking to herself when her manager Darlene Haynes asked her if she was okay. She replied they pray before they get in Darlene who had worked for mental health clinics in the past called police and told them she needed immediate psychological attention. She was asked to retire. She then moved to Grant's New Mexico where she was known for her strange Behavior. She would", " And speak to herself strip naked in public shouting to herself ordered food. And we flee the restaurant before it arrived and once tried to obtain a business license to produce a periodical known as the racist press she was known as The Strange neighbor and other than the call made by her former manager. No one seemed to report or try to help Jennifer see something say something according to writings found later in her home Jennifer believed. She was a target of a nefarious conspiracy.", " Rassee that centered around the postal facility. Thank you for joining me in my morning cup of murder. Please join me again tomorrow. Do you what terrible thing happened on January 31st. Don't forget to rate and subscribe and let me know how you like it. If you want to help support the podcast there's always patreon or just sharing it with your true crime obsessed friends. I remember stay safe.", " Guys, I want to talk to you today about Spotify because not only can you listen to all your favorite artists, but you can also listen to all your favorite podcast in one place for free Spotify has a huge catalogue of podcasts on every topic including morning cup of murder and on Spotify. You can follow your favorite podcast. So you never miss an episode premium users can download the episodes and listen offline wherever you are. So it's", " perfect for travel and you can easily share what you're listening to with your friends on Instagram. So you guys can chat about your similar interests and what you like if you haven't done so already be sure to download the Spotify app search for morning cup of murder on Spotify or browse podcasts in the your library tab. Also, make sure to follow me. So you never miss an episode of Maureen cup of murder. Thank you for listening to morning cup of murder. This is a daily podcast that tells you what happened on this day.", " In True Crime history in short easy to listen to episodes that you can finish on your commute or while you enjoy your morning coffee. So make sure you check back every morning. My name is Karina. I am the Creator and host you can find morning cup of murder on Twitter Instagram and Facebook. I have also set up a patreon where you can donate a small monthly contribution to the podcast. All those links are in the episode description. Thank you again and have a wonderful day."]}