{"showID": "00APTUqFgGqIgcdRz0G6Gg", "show_name": "Dr Berg’s Healthy Keto and Intermittent Fasting Podcast", "show_description": "Dr. Eric Berg DC, age 53 describes the truth about getting healthy and losing healthy weight. His area of expertise is in the subject of the Ketogenic diet, Intermittent Fasting, weight loss and overall body health. He is the director of Dr. Berg's Nutritionals and author of a best selling book on amazon.com, The New Body Type Guide. He has conducted over 4800 seminars on health related topics. Dr Berg’s YouTube, Facebook and Instagram channels have close to 3 million followers worldwide and have generated over 300 million views.", "episode_name": "How to Get Faster Weight Loss Despite Having Hypothyroidism", "episode_description": "Take the Free Keto Mini-Course:  https://bit.ly/2Cpb03l Download Keto Essentials https://m.me/drericberg?ref=w2128577 Take Dr. Berg's Advanced Evaluation Quiz: http://bit.ly/EvalQuiz Your report will then be sent via email analyzing 104 potential symptoms giving you a much deeper insight into your body issues. It's free and very enlightening.  In this podcast, I talk about how to lose more weight despite having a hypothyroid condition. If you have hypothyroidism or a slow thyroid—this video is for you.   Researching weight loss and hypothyroidism can get complicated. You'll get overloaded with advice and still have no idea what to do for your thyroid problems.    I'm going to simplify all of this, and give you only the most important information, and the very best tips for thyroid problems and weight loss. This includes if you have Hashimoto's or just regular hypothyroidism.  Dr. Eric Berg DC Bio: Dr. Berg, 51 years of age is a chiropractor who specializes in weight loss through nutritional & natural methods. His private practice is located in Alexandria, Virginia. His clients include senior officials in the U.S. government & the Justice Department, ambassadors, medical doctors, high-level executives of prominent corporations, scientists, engineers, professors, and other clients from all walks of life. He is the author of The 7 Principles of Fat Burning.  ABOUT DR. BERG:  https://bit.ly/2FwSQQT DR. BERG'S STORY:  https://bit.ly/2RwY5GP DR. BERG'S SHOP:  https://bit.ly/2RN11yv DR. BERG'S VIDEO BLOG:  https://bit.ly/2AZYyHt DR. BERG'S HEALTH COACHING TRAINING:  https://bit.ly/2SZlH3o Follow us on FACEBOOK:  https://www.messenger.com/t/drericberg TWITTER:  https://twitter.com/DrBergDC YOUTUBE:  https://www.youtube.com/user/drericberg123 Send a Message to Dr. Berg and his team: https://www.messenger.com/t/drericberg ", "duration": 6.2291333333333325, "transcript": ["Welcome to the dr. Berg healthy Ketone intermittent fasting podcast. Now your host the man taking your health to a whole new level. Dr. Eric Berg. So today, we're going to talk about how to lose more weight having a type of thyroid condition. Okay. So if you have a slow thyroid this video is for you. Here's the big problem when you do research on a hypothyroid, it's a bit complex because you have", " Hashimoto's hypothyroid condition you have non Hashimoto's hypothyroid condition. You're given so much advice. It's almost impossible to know. What is the absolute important things to know and what is the trivial in this video? We're going to talk about the absolute most important thing you need to focus on to get results with weight loss. If you have Hashimoto's type thyroid case or just regular hypothyroidism a few Basics. You got the thyroid right here. It's located right in the", " Part of the neck two and a half inches wide. It produces a hormone T4. Okay, the four represents the number of Iodine molecules, so you got four and then you got this T3 over here, right? So T 4 T 4 is an inactive thyroid hormone. It's not active. It doesn't really do much. It's a pre hormone your body strips off this one of the iodine molecules and it converts to T3 T3 is the active form of thyroid hormone. Okay, it's the thing that", " It goes into all the cell's and speeds up your metabolism as well as weight loss and here is the most important thing to get from this tea for two this T 3. It has to be converted. Okay, 80% of the conversion happens through your liver and 20% happens through the kidneys and this is really important information because so many people that have a hypothyroid condition have a fatty liver. I mean, it's almost one for one.", " If you have belly fat chances, are you have a fatty liver you can get an ultrasound to find that out but a fatty liver decreases the capacity for that conversion. So this will be your focus to get the fat off the liver and improve the function of the liver. Now, it could also be a problem with your gallbladder. It could be a problem with not having a gallbladder. It could be cirrhosis. It could be inflammation or some damage in the liver. But usually it is a fatty liver now you would think that", " All I need to do is cut the fat out of my diet and the fat will go away. That's not how it works in this not which one to do. You do want to cut the carbs out. Okay, that's why I'm going to recommend keto and imminent fasting but you don't want to start cutting down the fat in your diet. Okay, here are a few things to speed up. The process choline is one of the most powerful nutrients to strip fat off your liver very,", " Actually, you can get it in a powder. You can get in the supplement. I recommend you get a high quality choline and start taking that on a regular basis that's going to assist this nutrient is lip atrophic. It's basically dissolves fat and guess what food has the highest amount of choline eggs egg yolks interesting, right? So you don't want to start giving up those foods that are high in kolding. In fact, if you have a coaling deficiency you could", " Ali get a fatty liver next thing is selenium. Okay, why selenium selenium is also involved in the conversion from T4 to T3 people that have a fatty liver are nearly always deficient of selenium as well as think we'll get to this in a minute but selenium is an antioxidant so it actually gets rid of the excess hydrogen peroxide in your body that's generated, especially if you have", " She Moto's hypothyroidism. So selenium is essential if you have Hashimoto's this is really important because it's it's going to help your immune system. Okay, so if you have Hashimoto's you want to take some of this as a supplement and you also want to do more strict intermittent fasting that's going to drop the inflammation because Hashimoto's is more of an immune issue. Okay, but it's also involved in the conversion of T4 to T3. Yes, there's Foods", " high in selenium like Brazil nuts and seafood but I don't recommend trying to get all of your selenium from Foods. If you're deficient you want to take it as a supplement now, I don't want to get into the brands or dosages. I would just look online for something that looks like it has a lot of good feedback on other people that are getting good results with it. Okay, and then follow the directions on the back of the bottle. Alright, next one is iodine. Iodine is part of the raw material to build a thyroid hormone and a lot of people are deficient in", " Iodine so I would get this from seek help next one is zinc. Zinc is really really important taking zinc will help you in almost every single side effect that hypothyroid produces, like for example loss of hair thinning hair fatigue constipation. Zinc is good for that. Zinc is very very very very good for the thyroid. It's also good for the liver and if you have a fatty liver,", " You are going to be deficient in zinc. Okay think it's an oysters meet pumpkin seeds. I recommend getting it as a supplement. So these are the key things in addition to Quito and iif as your primary focus the target inductance Patty liver to improve the thyroid function. Thanks for watching.", " Hey, if you're liking this content, Please Subscribe now and I will actually keep you updated on future videos.", " Hey guys. I just want to let you know I have my new keto course just came out. It's a mini course, it covers all the basics and how to do it correctly. You can get through this in probably 20 minutes at the very most. So if you're interested, click the link below and get signed up now."]}