{"showID": "00b1ZswBvK0ZH3XMbmTfqi", "show_name": "The Forever Woman Podcast - Matthew Coast", "show_description": "Dating and relationship advice by Matthew Coast, founder of Commitment Connection. Matt is an author, speaker, and relationship coach who has worked with hundreds of thousands of women, all over the world to help them create relationships where they feel loved, seen, and cherished by the men they're with.", "episode_name": "Say THIS To Him To Make Him Want You Even If Things Are Cold Between You", "episode_description": "How can you completely change your interaction with men? I talk about this today...  ---   Send in a voice message: https://anchor.fm/matthew-coast/message", "duration": 4.523533333333333, "transcript": ["Welcome to the forever woman podcast. I'm Matthew Coast something that I call Force Framing and this is kind of a sneaky technique. But what it does is it kind of frames conversations. I have a whole program about framing it's called The Love Fringe toolkit. And this is it's about like setting up or setting a precedent for a relationship. So setting the underlying meaning for some kind of interaction or something that's going on.", " Between you and another person is called Framing. And so the idea of forced framing is setting it up so that you kind of like throw this meaning onto something that he's doing and it's it's like you misinterpret it, right you you kind of take something and you interpret it in the way that you want it to be interpreted and it's kind of like a flirty fun kind of exciting thing to do and so I'm just going to give you some ideas on how to do this with him because", " It's a lot of fun and when you start doing it, it can completely change the interaction that you have going on with a man. Right? So it's like, you know, think about it one kind of thing that happens a lot with men and women in terms of framing is like sometimes a guy will like check out a girl right and you'll be like looking at her and she'll like catch him checking her out and she'll be like, hey were you checking me out, you know, and he's", " Like hot red handed and kind of like embarrassed and he's like, oh God, you know, I don't know but it but it's setting up this precedent that he likes her and he's you know looking at her and hitting on her and so that's one of the ways that you can do that and you don't even have to catch him checking you out. You can just have him you know, he's looking at you and you're like are you checking me out right now or like if you're like hanging out together and you like walk in front of and you like turn around and look at them. You might be like, well were you just checking me out right now, right?", " And if he's like, whoa, whoa, whoa, no, no. No, I wasn't you can say something like it's okay. I like it. Right and so what you're doing here is you're basically setting this Frame where you're saying you like me. I just caught you liking me right looking at me in a way. That's more than friendship and it's okay, right you're giving him permission. You're like, hey, no, it's cool. I like it, which is basically saying I'm interested you're interested in me.", " Me and I'm interested in you and it's kind of like this fun little flirty way of having a conversation right or another one might be like stop checking me out. Right like you just made it doesn't matter if he's actually checking you out or not. Right? Because a lot of times what we do as human beings is where life walking through the world completely in our subconscious mind. We don't know what's going on. We're driving. We don't even remember getting to where we got to or walking and you know sudden we're suddenly were", " Where we get on the Subway or something. We aren't paying any attention. We're listening to music. And so we're most people are just walking through their lives totally unaware of anything. And so if you tell somebody that you're you caught them checking you out right? It's it's almost like they're not even aware. Maybe they were you know, they're like wait was I checking you out wasn't, you know, did that just happen? I'm not even sure right and so you can kind.", " And of do that and kind of have this flirty conversation going on between the two of you by just being like God. Hey, stop checking me out checking it, you know just doing it in a fun kind of flirty kind of way. Like, oh my are you checking me out again? Like no. No, it's okay. It's okay. I think it's cute. Now, I think it's cute. You know, I like it. I like it. Right and you're doing it and you're just making it fun. You're making it flirty. You're making it playful you're framing the interaction so that it's moving out of this. Hey, we're just", " We're just friends and we're having friendship conversations to this sexual realm this romantic realm of like we're actually interested in each other. If you want to attract a man who loves you and sees you and cherishes you make sure that you go to the forever woman formula.com and check out getting my program there for free again. That's the forever woman formula.com."]}