{"showID": "00bQYCFm5Xfzn6RSUEBS9m", "show_name": "Political Scandals ", "show_description": "Discover how fast controversy can move up in the polls in Parcast’s new limited series, Political Scandals. From greed and lust to deceit and cover-ups, we’ll unpack the most shocking events in American history—all leading up to the 2020 election. Every Tuesday, join us as we breakdown the rise and fall of our most infamous elected officials, measuring the impact it had on the country and history.", "episode_name": "Scandal 53: “The D.C. Madam”", "episode_description": "In 2007, Deborah Jeane Palfrey was indicted for racketeering and money laundering. Her escort service’s client list included men from the highest reaches of the U.S. government, stretching all the way into the dark halls of the White House. ", "duration": 42.51603333333333, "transcript": ["Due to the adult content discussed in this episode. Listen or discretion is advised this episode depicts sexual situations that some people may find offensive. We advise Extreme Caution for children under 13. It was a beautiful DC morning in the spring of 2005 before the weather turned muggy and the streets lethargic.", " Clare had just gotten her nails done and she still had an hour before class. Might as well run up to her apartment and phone Julie she needed to vent about last night. She picked up the phone barely glancing at the Post-it tape to the wall. Beside it. She knew the number by heart Julie comma Pamela Martin and Associates as soon as Julie's calm. Hello answered the phone.", " A launched into her Saga last night's John had been a strange dude. He looked as respectable as they all did in his perfectly tailored suit in Italian shoes. But what he'd wanted to do in the bedroom when they got back to the hotel Julie cut Claire off right there with an unusually Kurt voice. She admonished don't talk about that stuff on this line. This wasn't a game Julie or rather.", " Regine palfrey knew that all too. Well, she'd been to jail before but this time she wasn't going to let foolish mistakes compromise her Empire this time if the feds tried to topple her she'd pull down all of Capitol Hill in her wake", " Welcome to political scandals a park has two original. I'm Richard and I'm Kate in the lead-up to the 2020 election. We're counting down the 54 biggest scandals in US history every week until November 3rd 2020 will look at how each of these moments shaped American politics and culture and what we can learn from the failure.", " Of the past you can find all episodes of political scandals and all other Park asked Originals for free on Spotify or wherever you listen to podcasts to stream political scandals for free on Spotify just open the app and type political scandals in the search bar at podcast. We are grateful for you our listeners you allow us to do what we love. Let us know how we're doing reach out on Facebook and Instagram at Park cast and Twitter at Park cast network.", " If you enjoyed today's episode the best way to help is to leave a five star review, wherever you're listening. It really does help in today's episode. We're exploring Scandal number of 53 the mid Ott's prostitution Saga that rocked Washington DC in 2007 Debra Jean palfrey better known as the DC Madam was indicted for racketeering and money laundering her escort services Client List included.", " From the highest reaches of the US government ranging all the way into the dark Halls of the White House and her death by hanging in 2008 two weeks after her guilty verdict called into question. Just how far the corruption ran.", " By 2006 50 year-old Debra Jean pelphrey had been running Pamela Martin and Associates for 13 years. She had a good thing going her client list included everyone in town who mattered from Pentagon advisors to Senators to the deputy secretary of state. She'd served as many as 15,000 clients around 80% of whom were repeat customers. She had built up a great group of gals.", " She called them to they were almost all college-educated women older than 23 and ranging up into their 50s. They all had day jobs or were in school. And while many of them were pretty What mattered more to Deborah was their Poise their slim figures and what she called there and Taylor style sophisticated women for sophisticated clients. It was a very different kind of operation than the one she tried to set", " it up in San Diego in the late 80s. She'd started in good faith after trying out escort work herself to supplement her income as an interior designer. She was quote appalled and disgusted by how CD lazy and incompetent most escort agencies were but her first foray into running her own escort agency was a failure. She made little mistakes left and right police had caught on to the fact", " That her operation stumbled across the Thin Line separating legal escort work and illegal prostitution an escort could pedal sexual fantasy and stay on the right side of the law. But as soon as she engaged in anything considered by local courts to be an illegal sex act she could be prosecuted the mistakes of Deborah's first escort agency. However, Were Far Away by now way back.", " back in 1992", " Now Deborah had experience as well as her college degree and excellent work ethic and she had a better playing Ground while she ran her operation by phone from Vallejo, California. All her business took place in DC and DC. Unlike San Diego was chock-full of her Target clientele those clients appreciated that she never asked for their real names the so-called.", " Al's meanwhile like that, she never forced them to take more jobs than they wanted and that as long as she got her 50% of their official fee. She never asked for a cut of their tips in short things couldn't have been going better at least not on the surface, but this was Washington and Washington under a conservative president to boot George W bush had been in office for the past six years and his administration was", " Exactly friendly to sex workers Randall L Tobias at that time. The United States director of foreign aid and a deputy secretary of state was one example, although he didn't create the policy that said in order to receive us Aid you had to denounce sex work? That would be Congress Tobias is background wasn't in policymaking at all. He worked in Big Business Pharmaceuticals and at AT&T.", " T until George W bush nominated him to be the United States Global AIDS coordinator in 2003 Tobias was a Christian Midwestern Republican the conservative anti-prostitution requirements that Congress had tied to the foreign aid fund were in line with his own values in an interview with PBS Tobias explained the Congress. I think very appropriately has put into the legislation.", " That organizations in order to receive money need to have a policy opposed to prostitution and sex trafficking. I don't think it's too difficult for people to be opposed to prostitution and sex trafficking which are in fact to contributing causes to the spread of HIV/AIDS Tobias and is office weren't alone in there publicly negative view of sex work DC in the mid oughts was a risky environment for running an escort service.", " Deborah in response was careful. She never explicitly referenced anything illegal on the phone with her employees or the John's she talked exclusively about sexual fantasy never specific sex acts and it was specifically exchanging sex acts for money that was illegal according to the DC laws regarding sex work Debra hoped making sure her business never referenced them should be enough to keep", " Keep her safe, but she had a backup safety net to.", " Deborah was reassured by the fact that Randall Tobias like many other lawmakers across the political Spectrum was her client conservatives like Tobias might be condemning prostitution on the political stage, but that hypocrisy gave them all the more reason to want their illicit extracurricular activities to stay in the shadows a sex scandal could crush a political career instantly.", " And not just because sex work was for the most part illegal. It was all so embarrassing and for conservatives elected on platforms emphasizing traditional Christian values infidelity in general and prostitution in particular were ungodly moral indiscretions voters were unlikely to excuse them. So Deborah hoped if all else failed and law enforcement started to pursue a case against Pamela Martin,", " Associates her John's would step in and bury the case. If not to protect her then to protect themselves because they were everywhere the judicial system the Army government agencies of every kind as well. As of course on Capitol Hill Debra may have been right to hope that her many powerful John's would keep any investigations into her business from getting very far case in point.", " meat being the trajectory of the investigation launched in 2001 or rather the lack thereof the Postal Service noticed an unusually high number of money orders being delivered to Debra's PO Box in San Diego in 2001 coming from about 25 women, but it took the federal government all of three years to start investigating this Oddity then even after the investigation launched", " In June 2004 it moved slowly if it was the protection of some powerful Washington customer that's slowed down the investigation. However, his power eventually reached its limits in October 2006 two years after the investigation launched law enforcement got a search warrant for Deborah's Vallejo, California home. They raided her papers and seized almost half a million dollars worth of assets.", " 51 year-old Deborah was on vacation in Germany when the warrant was issued and the raid carried out but she didn't stay away. She was confident that this Saga was only just beginning and that when it finally ended she would win she had several reasons to think that first of all there were her precautions. She'd never explicitly spoken with the girls about sex and her contracts with them actually forbid both.", " Iterative and oral sex which were what the law most regularly defined as sex acts. There was absolutely no proof that she knew about illegal activities occurring under her auspices if some of her girls were having sex that was their own problem not hers. Then there were her phone records investigators had failed to seize them out of her Dusty basement when they searched her home and she felt sure these records", " Would prove to be an important bargaining chip. Meanwhile the prosecution was assembling its own Arsenal in exchange for immunity from prosecution. They got 15 Jane Doe's on record saying they had sex with clients while working for Pamela Martin & Associates these women admitted that they never discussed sex explicitly with Deborah or Julie as they knew her, but they were all confident that", " I knew what was going on and her euphemisms about sexual fantasy were simply to protect her from prosecution in exactly a situation like this investigators also found copies of Deborah's newsletters, which she emailed to her girls regularly, these newsletters detailed tips tricks and guidelines the women should follow while at work. They shouldn't drink or do drugs. They should always lock the door.", " Double and triple lock it when with clients they should let the men undress first precautions like the triple door locks certainly hinted the Deborah knew something untoward was happening while the girls were on her clock and the references to undressing certainly sounded like precursors to sex statements like the following looked particularly damning quote adult service or fantasy escorts command a substantially.", " Greater fee usually $200 an hour this of course because of the risky and sexual nature of these appointments. Obviously the more liberal the booking or act the more money one makes therefore if anyone thinks that fantasy prices can ever be charged for purely Social Services. All this writer can say is that the person is a damned fool this past weekend this new escort no longer.", " Amongst us thought she could go there collect the $200 and just talk her mere presence being justification enough here for the big bucks wrong. It certainly sounds like she's encouraging her girls to have sex with clients. Although it's notable that she never explicitly says anything about penetrative or oral sex and sexual can cover a whole range of legal activities to Deborah also,", " Sighs these kinds of statements in her newsletters by explaining quote the misogynists get a real kick out of surprising shocking you and we're not doing anything wrong, but they sure as heck try to make anything we do into something wrong whether or not she was referring to illegal sex acts Deborah made it clear that the moral judgments of wrong in this industry came from a misogynistic perspective law enforcement hated.", " To see women using their sexuality for personal gain and would do whatever they could to punish them for it first and foremost by labeling the woman's Behavior wrong while ignoring Men's Central role in The Exchange how moral versus legal wrong fit together here is unclear, but Deborah was sure of one thing. She knew how easily those definitions could be and were manipulated by people in power.", " Regardless of the nuances in these texts on March 1st, 2007 Debra was indicted and she was right to speculate that misogyny as well as the Privileges of power would dictate how her activities were perceived by the public and treated by the legal system, but she was more than ready to fight back.", " Coming up we'll delve into the dramatic battle between Deborah and the courts now back to the story on March 1st, 2007 51 year-old Debra Jean palfrey or the DC Madam as the papers dubbed. Her was indicted by a Washington DC grand jury, the case included charges of racketeering and money laundering, but Deborah was ready to meet the courts challenge.", " Legal strategy was to maintain that if her employees did anything illegal during their appointments. It was without her knowledge, but she also had another strategy. She was going to convince Washington and all of the US that if there was anyone to blame here. It was her powerful clients who abuse their status as elected officials and policymakers by breaking the laws. They were meant to uphold and the conservative family.", " Values Republicans amongst them had hypocritically abandoned the Christian morality. They were trying to force on America to boot that should be enough to ruin a few political careers and take the attention off of her and any crimes she was accused of if they'd had sex with her girls. That is meanwhile, if they maintained like her that her service wasn't meant for sex, but rather for legal sexual fantasy.", " Then they could serve as Witnesses for her defense. It was a win-win either way. All she had to do was find a way to make her clients names public despite the fact that she didn't know many of their names, but she did know their phone numbers Deborah announced to the press that she would sell her phone records to the highest bid in news agency. These records contain 10,000.", " To 15,000 clients phone numbers and while she didn't know the real names behind all of those numbers. She knew a news agency had the resources to find out but she didn't stop there. She also in court documents outed one client whose name she did know Harlan K Omen. She chose this candidate carefully all men was an academic whose claim to fame.", " Name was a scholarly paper. He wrote on Military strategy coining the term shock and awe a term later used in the US war in Iraq. Thanks to his prestige in Washington circles Ullman demonstrated. The caliber of Deborah's clients, but she also chose him because he was in her words an unpleasant man. She didn't feel guilty about exposing his indiscretions to family and friends as well as the", " Can people Omens response was dismissive he stated that the accusation doesn't deserve the Dignity of a response, but it's certainly had the desired effect of getting Washington talking.", " According to Debra's lawyer Montgomery Blair Sibley five other lawyers contacted him asking whether their clients names were in Deborah's phone records and some Sibley claimed asked if anything could be done to ensure their identities State private. Debra's plan was working. She was in control of the narrative and the public was listening when in late March she handed her records.", " To ABC the entire city was on edge breathless for the results of the news agency's investigation some because they knew their numbers were on the list. But everyone else wanted to know to this was a salacious drama and one that washingtonians understood could have very real consequences on the government Washington in the spring of 2007 was no stranger.", " Jerr to sex Teenage Drama less than 2 years before a major Scandal had rocked the capital in the form of corruption charges against Republican Congressman Randy Duke Cunningham. Those charges had focused on monetary Kickbacks the congressman received from defense contractors, but there were hints that he'd been paid in escort services to a black mark against a Christian in a case that was already", " Extremely Bleak the result of the Scandal was Cunningham's resignation and a tense runoff election that almost cost Republicans the seed and of course, no one could forget the 1998 Bill Clinton impeachment Scandal. It wasn't just Family Values Republicans who are vulnerable to censure for sexual misconduct. The Democratic president was almost removed from office after lying under oath about an extramarital affair.", " R. A good sex scandal could bring down almost any politician thanks to the genres Perfect Storm of immorality and at least in cases involving prostitution illegality. The city was anxious to know who this new drama might take down in part because of the gossiping nature of the information but in part because it had the potential to shift around the key players in Washington's high-stakes political games.", " April passed slowly in the capital as ABC's researchers slogged through 46 Pounds of phone records, but finally in late April events started to pick up speed.", " ABC announced that amongst Debra's clients were senior business Executives NASA officials, and at least five Military Officers then on April 26th, the network called Randall Tobias deputy secretary of state and a married man and asked him to confirm that he used Debra's escort service mortified. He admitted that he had but just for massages in fact, he added", " He had lately been using a different service for massages one, which provided Central American gals as he called them that little detail did nothing to help his case and the massage bit in general fell flat few people believed him plus his record of withholding foreign aid from countries with legalized sex work made the whole Affair look even worse. He was a hypocrite on top of breaking the law.", " The day after ABC called on April 27th. 2007 Tobias resigned Debra's plan wasn't working perfectly. It didn't look great for her case that the public dismissed tobias's massage claims out of hand, but her other angle had worked Tobias was the bad guy and by handing over her Client List. She was starting to look like an avenging Angel fight.", " For rule of law over dirty politicians her quotes to that effect circulated around the nation's papers including I abhor Injustice on any level and in any Forum, I frankly persist despite life's barriers, and I never could stomach Injustice social or otherwise, she was the feminist the woman prosecuted for tiny errors where men got away with murder.", " And in the fall of 2007 with President George W. Bush's conservative government struggling to keep approval ratings above 30% that more liberal mindset was getting decent traction.", " But then ABC stopped naming names they announced that no one else in the phone records was newsworthy and they weren't quote going to out low-level analysts in the Pentagon. This is 20/20 not the Pentagon times on top of that the US District Court for the District of Columbia issued a protective order blocking the release of the phone records to prevent the potential.", " Intimidation of witnesses. This was not the plan if more men weren't named Deborah might not get any John's to testify. They certainly wouldn't come forward of their own accord to save her. But if they were outed, they'd have a reason to take the stand and corroborate her claims that her agency didn't provide any illegal sexual Services doing so would clear their names as well as hers and on.", " Top of that without more hypocritical government boys to point at the public would forget her message the bad guys here were the men Deborah Furious determined that ABC was bowing to pressure from the government. She knew there were more newsworthy names on the list at least a hundred she told reporters. She just had to get it out to other researchers, but thanks to the court order. She couldn't", " With the help of her lawyer she did everything possible to get that court order lifted and on July 5th. Finally she did within an hour of receiving the judges revision Deborah and her lawyer had 50 CD-ROMs in the mail on their way to journalists around the country each one containing the entirety of her phone records. Then she listed the same telephone numbers publicly on her website. It took only a few days.", " Is for journalists to turn up another name that they deemed newsworthy, Louisiana Senator David Vitter.", " Elected on a conservative Family Values platform Vitter like Tobias before him was an ironic figured to appear on Deborah's list. He responded. However with more Poise than Tobias had sending out a well worded statement on July 9th. This was a very serious sin in my past for which I am of course completely responsible several years ago. I asked for and received forgiveness from God.", " My wife in confession and marriage counseling out of respect for my family. I will keep my discussion of the matter there with God and them but I certainly offer my deep and sincere apologies to all I have disappointed and let down in any way this statement and an ensuing July 16th, press conference helped Vitter Garner support from other Republicans enough support that he wasn't pressured to resign from his", " post like Tobias had been in fact, he kept his seat in the Senate until 2017 when he retired from public office vitter's success marked a turning point in Deborah's campaign against the government when journalists failed to turn up any more names they deemed newsworthy. She started to shift her angle of attack to another aspect of the case the fact that her escort agency and only her", " Agency was being prosecuted the government Deborah announced was conspiring against her.", " Coming up. We'll hear about Debra's final fight with the courts and the dramatic aftermath of her trial now back to the story.", " In the fall of 2007 Debra Jean palfrey decided it was time for a new line of attack against the courts and the government they were Prosecuting her for running a prostitution ring and the case wasn't about any single client as she explained in an interview. This case is not about Louisiana Senator David Vitter rather. It was about the fact that she could and did list over.", " Atdc escort agencies in her court filings, but none of them were under investigation why her she demanded of journalists and of the courts what had brought her agency to the attention of the government when they were so uninterested in the other escorts servicing Washington's Elite some journalists felt. She was losing her grip as she repeated these questions again and again sounding more conspiratorial with", " Every complaint her agency just happened to be the one that investigators received a tip about unfortunately Justice was never universally evenly applied, but the questions started to feel more relevant as Debra's case dragged on and the parallel case emerged in, New York.", " Starting in October 2007 Federal investigators were in fact investigating another escort service Emperor's Club VIP the investigation which the New York Times announced to the public in March 2008 caused a media flurry not dissimilar to Debra's likely because it too involved a prominent political figure Eliot Spitzer or client number nine.", " fine as The Emperor's Club called him was at the center of the investigation but there was a major difference between the Emperor's Club and Deborah's operation Debra's service charge $300 an hour compared to the upwards of $1,000 an hour build by The Emperor's Club while Deborah cleared around two million dollars over the course of 13 years running her business The Emperor's Club made 1 million dollars in just", " for years, which is to say while Debra's hourly rate put the minimum wage to shame her operation was in the world of high-class escort businesses comparatively modest.", " So why was her little operation one of only two escort services under investigation? She demanded surely the government had other bigger fish to fry fish that were in the league of The Emperor's Club this emphasis on the modesty of her operation was certainly a different tactic than her earlier defense which focused on just how prominent and Powerful her clients were but one part of her original defense remained unchanged.", " The courts were treating her case misogynistic lie Deborah railed against the fact that while many of her former employees were called to the stand convinced to testify with Promises of immunity. None of her customers testified and going public with escort work was incredibly difficult these women faced stigma and shame in the public sphere and for many of them in their personal lives.", " One of the former escorts Brandi Britain was so devastated by the process that she died of suicide in 2007 before she could be brought to the stand. Deborah wasn't particularly sympathetic about Randy's death. In fact, she told the Press I guess I made of something that Brandi Britain wasn't made of but the death was just another example proving her Point as usual while men were", " getting off scot-free the women were paying a terrible price, but the jury in the end wasn't convinced by Debra's claim that the government was persecuting her nor were they interested in her high-level arguments about the gendered application of Justice? They didn't buy her argument that she had been blissfully ignorant of her employees illegal sexual Services either on April 15 2008 the jury found", " D 2 year-old Deborah guilty of money laundering using the mail for illegal purposes and racketeering. Her maximum sentence was 55 years though. Sentencing guidelines would likely put the final number closer to six years. Deborah was devastated. She was immediately taken back to her 1991 conviction and the Terrors of her time in jail, one of her fellow inmates would punch you", " Her throat and face everyday 18 months had felt endless. She'd lost her spirit and her gumption now remembering that experience with despair. She did a 180 on her comments about her former employee Brandi Britain suicide. She told her friend and journalists Dan moldea. I'm not going back to jail. I'll kill myself first. I'll commit suicide.", " Side first it was in this state of Anguish that Deborah traveled from DC down to Tarpon Springs, Florida where her mother lived while awaiting sentencing. It was late April already warm and sticky in the Waterfront town a world away from Washington and the chaos of Deborah's last year how this change of scenery affected Debra's mental state remains one of the biggest mysteries.", " Is of her story it may have proved steadying her despair at the jury's guilty verdict may have started to fade and her determination to survive. This Scandal may have strengthened things had changed since she went to jail in 1991 after all she'd run a successful business for 13 years. She'd made a respectable amount of money for herself. She'd come into her own and remember the vehement some of her comment.", " Her former employees suicide. I guess I made of something that Brandy Britain wasn't made of she was proud of the strength. She'd one for herself and dismissive of what she deemed to be weakness. Plus she was still highly suspicious of government forces conspiring against her that kind of Injustice and mystery was motivational for a fighter like Debra Jean but despite all that on May.", " First two weeks after her conviction Deborah was found hanged in a shed behind her mother's home.", " The police report deemed the death a suicide but immediately suspicions erupted in Washington and around the country Deborah after all had said that she was made of something that her former employee. Britain wasn't made of plus. It was odd for two women involved with the same case to both died by hanging especially considering its a less common suicide.", " It for women Deborah had kept the most private secrets of many powerful men Skeptics wondered if there was some secret that was too dangerous to let out something bigger than Ullman Tobias and Vitter but there are some issues with this speculation. First of all Deborah left to suicide notes in her own distinctive writing style and second of all, it's difficult to hang someone else.", " Else and make it look like suicide but it's certainly possible to coerce someone into writing a suicide note and hanging himself. There is a bigger issue with the idea that Deborah was killed to ensure her silence. However, if she was still sitting on some enormous secret why had she kept quiet about it, not only through her trial but for two weeks after her conviction, it could be that she had no idea the information. She was sitting", " On she didn't after all know the names of all of her clients, but if she didn't know what until she had then killing her was a bit premature we have however had a recent suggestion that perhaps there was at least one more piece of important information buried in Debra's files in February. 2016 Montgomery Blair Sibley Debra's former lawyer attempted to lift a", " seven restraining order that bars him from releasing more of Deborah's records. He claimed that they contain information relevant to the 2016 presidential election the Supreme Court, however, rejected Sibley's request whatever information he wanted to share stayed hidden during the 2016 elections and so the fascinating final mystery of the DC madam", " remains unsolved", " whatever secrets are hidden in Debra's grave her impact on a particular cultural moment isn't debatable her case captivated Washington during an era when family values and morality were at center stage of conservative politics in 2008 the same year of Deborah's death Sarah Palin would represent the religious right and tea party sensibilities on the Republican Presidential ticket, just like Randy do", " Cunningham's corruption Scandal Debra's case sparked discussions about the hypocrisy of lawmakers who fell far short of the values. They preached it also spurred conversations about gender power and the uneven application of Justice. Well one out of the three men Debra's case publicly implicated to bias lost his job. The other two were largely unaffected by the scandal in the long term Omen can't", " Continues to write books his most recent was published in 2017 and work in the private sector Vitter retired from the Senate just two years ago and now works as a lobbyist the men are doing all right, the women on the other hand didn't fare as well. Deborah is as we've discussed dead along with Brandi Britain one of her employees another woman outed as an escort during the case lost her day job.", " in the military in the 11 years since Debra's death American politics and cultural norms have shifted enormously but questions of corruption powerful people who behave like they're Above the Law are still Central to National debates sex work meanwhile remains illegal in most parts of the United States, but some sex workers are actively trying to change that and their fight", " Is gaining momentum we can see the legacy of the DC Madam refracted through all of this 2008 wasn't after all very long ago.", " Next week coming in at number 52 on our countdown. We'll look at a scandal involving some of the very same issues back in the 1790s. The Hamilton Reynolds Affair was one of the very first sex scandals in American political history at first Alexander Hamilton tried to hide his indiscretions by paying up his blackmail money, but eventually as other dark corrupt secrets were tied.", " With that hush money the affair blew out into the open.", " Thanks for listening. We'll be back next week with number 52 on our Countdown the Hamilton Reynolds Affair. You can find all episodes of political scandals and all other Park asked Originals for free on Spotify. Not only does Spotify already have all of your favorite music but now Spotify is making it easy for you to enjoy all of your favorite park has two Originals for free from your phone desktop.", " Or smart speaker to stream political scandals on Spotify just open the app tap browse and type political scandals in the search bar. Will see you next time.", " Political scandals was created by Max Cutler is a production of Cutler media and is part of the park has Network. It is produced by Max and Ron Cutler sound designed by Michael Langston ER with production assistants by Ron Shapiro, Joel Stein and Carly Madden this episode of political scandals was written by Nora Battelle and stars Kate Leonard and Richard Rosner."]}