{"showID": "00CoLqpC5J4vqYzGa7SDkS", "show_name": "unsigned podcast", "show_description": "A music business podcast for artists and managers that are looking for a how-to resource.   Powered by Studio Talk", "episode_name": "#8: John Vincent Salcedo - Director of Digital Marketing, Columbia Records", "episode_description": "“How do I find the right audience to listen to my music?” “Someone told me the only way to start getting a buzz is to buy fake followers, is that true?” “Man, there are too many social media sites to keep up with, how do I choose which ones are most important?” — Everyone is trying to get popping online these days but few actually understand how to make the internet work for them. In episode 8 of the “unsigned podcast,” we talk with the Director of Digital Marketing at Columbia Records, John Vincent Salcedo. Back in April, we were able to sit down with John to talk about where to find your audience and how best to engage with them. We also chatted about John's journey to the US and how in the beginning, he himself wanted to be an artist. John's story is a great one on how to find your way through the music industry by working through different disciplines until one starts to pay off. Enjoy!  P.S. - Are you an artist or manager interested in growing your music career? If so, click HERE to schedule a 20 minute 1:1 call with our team to see if you're a good fit for our new program! ", "duration": 39.61905, "transcript": ["This week on the unsigned podcast with my good friend Jean Vince marketing director at Columbia Records John and I go back a few years when we were both working at Sony stayed in touch just overall creative genius guy really sharp when it comes to the image and what the strategy for Beyond should be for small projects big projects everything in between just all-around great dude. So this is one of our favorite", "Sodas as well. So make sure to check it out if you guys are looking for more information on Studio talk you can visit us at Studio talk.com. Oh, but for now, let's get into the episode. I've been since all Seto. I'm currently a digital marketing director at Columbia Records. Well, yeah. Well, yeah, right but yeah just kind of jumping, you know into the music stuff. Give us a quick little kind of background like how you got into music and you know,", " Oh how you made your way over to Columbia for sure. I'm I mean like going all the way all the way back. I came here from this country. Right when I was like a teenager like 10 11 years old and um, I actually fell in love with wanting to make music. So I was chasing to be an artist right is that want to be a rapper have this story fell in love with the culture save my life coming here from like a different country. I was like, I think I have something to tell so but you realize is an indie artist super quickly that you're like broke and then you don't have it.", " Like a big deal, right? Yeah guys are doing you don't have helped. So things start figuring things out. So you start realizing like I gotta learn how to Market myself but it's like even a smaller things like I can't afford a graphic designer. So I got to actually design this thing. Now, I got to learn Photoshop to all the way down to like I can afford a videographer. So I got to edit these videos myself what you don't realize is like years and years of doing this you're like, oh wait. I'm picking up a skilled on a typical like immigrant story. Like it wasn't going to happen 18 19 years.", " Sold to hit me chasing to be like an artist was just something that wasn't realistic for where I was in life. But then you you start helping other people out because we learn how to do for sure. You learn how to create a banner on Instagram you realize the artist path isn't for you. Same thing. Like I realize rap wasn't it? But I've by the time I realized rap wasn't it? I'm like I'm writing for other people. I'm right. I'm helping other people with my space design and like helping them to set up Studio sessions and like sitting and you like you find that like you're finally like your acutely too.", " To manage or if not managed to at least be a day to day for someone in to help kind of direct traffic and there's wait. Yeah, I was gonna say in there's ways to still be creative. If you can't be the guy you can still help the guy out with all the creative stuff that goes into it. Yeah, you're coming from an artist perspective you get. Yeah. I think that's what you already knows connect. Yeah. A lot of people have on go industry and business side is they've never step into the shoes of an artist. Right? Right. So they don't know how to speak to them don't know how to get things through the line because you never been in that in that.", " Situation richer or so. Yeah it started from there. You start freelancing for other artists since you met him as an artist like yeah, I'll help you make a website and I'll help you kind of create your logo. I'll help you pick your color schemes and you start with these small, you know branches of how to get them get a song out our project out and next thing, you know, you're like wait hold up. I'm fully involved with management now. Yeah involved with your strategy on on how you are as an artist and how you're about to grow and develop luckily enough. You know, how it ended up in Sony.", " Prior to even joining Columbia was just one of the artists. I was helping freelance got signed. However, yeah, you don't go through cause I want to Pace, right? Yeah, you realize there's no like I was going to say pace cars over here. Love it down downtown. Yeah. There's only one is that we acknowledge. There is only one case campus. Sorry. Sorry Pleasantville. Yeah doesn't that doesn't get registered. Yeah, but there's no music class like there's no like music.", " - course or music marketing course, but you're deeply immersed in everything. Like I was I was same deal like I'd worked I'd always been around music like I'd always done and like so I didn't have studied business. Yeah, great for business but didn't have music business or but you're in the you're in the heart of New York. Absolutely. So I'm like, I'm at the source.com and turning like I have all these like I pop up like my had friends that were working at label. So I pull up to their internships. I'm like doing like you", " Are doing a little odd jobs, you're going to open mics and doing all that stuff. So like you're getting a practical internship just by being knee-deep in the scene of like in the kind of the burgeoning seen that you want to make a lifestyle out of her makeup make a way of life out of course. So yeah, that's just how we end up exactly dad like you go to these spaces you need people because you are a music lover at the end of the day. So you're sure for the new thing you're looking for who's hot your yes. It was to discover Talent. Absolutely and you", " Are you know meeting more and more people you start meeting more and more artists. And yeah, one of them looking enough got signed to a label under Sony music. I was helping with creative Direction on the website and the - yeah, and I'm like, what do you mean? This is a job? Yeah, right. Oh I can get paid for this I get paid it. Yeah. Yeah, hold up you telling me that I can get like Health Insurance Dental to be here.", " Consistent check is yeah. Let's check what you chasing right 60 right right arm with this bills and buy a metro card. This is that like him like Dart is getting signed to me like you. Let me just go with you do it like a meeting. Right? Right, then from there. I was just like hey, I'm in college. Yep. I'm about to graduate like what's up? Can I get like a freelance job and internship? What? How do you guys do this? Yeah. What's the next step? What's the next step Yeah Yeah from their II intern for like half a semester.", " Graduated was just freelancing for the artist. Yes, typically because they went to bathroom. You looked out like not that's our creative guy from day one. He's been helping so what can we do? So then I was getting like a freelance check waiting for an opportunity to open underselling music as far as like a head count, right? That's the first time I've learned that that's like we can't just hire you, you know numbers got to be there. Every Super intern. Yes, really good in a label like you can be the best thing as a in turn free worker, but if that head count is an open for stay the course.", " Like getting it. Yeah, I had to learn that. Yeah, and it's something that I share with active and here I mean, I'm sure this will ya Murph when he was my intern I was like look it's it's unfortunate. But you learned like I saw people get gigs before me. Yeah, and he's just because they were in a department that was like where they said that an opening held by choice not always like its first person up is not always the best person up. She has that it's something that you have to really kind of Steel yourself for and just stay the court like it's difficult because you", " at things like a negative balance in a bank account like a rumbling stomach. Yeah, you know taking three buses because you know, the Long Island Railroad isn't necessarily an option, you know, like you look at all these things and you're just like, all right, I could really use like a consistent salary and some healthcare. Yeah sharp a lot of to Growers license out of two Bros. Oh man. Yes a lot of dollars and but like you look at that and you're just like, you know what I it gets rough, but and then that's the test to that's", " Real pressure test like do you want this I do you really want to and if you can just like you were saying a minute ago, John walczyk State Building, but it's about staying the course like you were saying in like yo, it's gonna it's gonna test you just like anything else in life. It's gonna test you at times and if you really want it, you know, just keep working at it. And and and I mean, that's it. Right. I mean that thing is like you hustle because you realize it's like a weight if this labels willing to pay a freelancer to do this, there's a hunter who's got a bit. Yes, but not everybody realizes that see", " See, that's the thing. If you're freelancing it one label, you're afraid is like, all right, let me stay here. So you kind of have to find that balance and when you understand how headcount Works, you're like, all right, I can step back and just let them like keep doing what I'm doing keep killing it and let them come to me with an offer but a lot of the initial inclination like and that's something I had to learn because I was so loyal. I was at Def Jam and I was like sitting in the back of the Boiler Room freelancing coming in five days a week first first one in last one out for my like freelance shackles.", " Freelance Jack until I you know till taxes like but like you do all of this and like you don't like you're staying look and you don't realize you can take on outside work. Absolutely you can answer an email you can do some other like you can diversify. Yeah and pick up these checks from elsewhere. And then you're also putting yourself on the relay on the radar and that's that's the one. Yeah, you start putting your name out there you start putting your work out there you start creating more and more relationships because then it's building starts buzzing because if you're really good, they'll run into each other the industries so small.", " What they'll do like, wait, what do you mean? Oh, no, I got a guy. Oh, yeah, that's like that guy. Yea though, I use them to and then that changes HR all of a sudden becomes a step that superstar in turn. The industry is poorly built high school. It's all poorly built high school Everybody Talks. It's like fomo is like the number-one thing is everyone just hates missing. Yeah, man, it's both like Talent on the music Side by Talent on the business side as well. Sure. Like they go for it for sure do the best by you. Just want to make sure nobody else can't even see ya. So get it.", " Into a little bit more some of the specifics you got a quick story. Unlike your most favorite moment working in the industry. Thus far like was it working on a really big project? I mean you've worked on some of the biggest in recent years or was it like something small just starting out that like really, you know kept that momentum going. I mean, so two stories one at confine is like humorous. So I feel like this is like super important. I was in international marketing for like a year.", " And a half so we were in charge of you know, telling the story making sure that we were properly representing the project xus outside of the United States. One of the things that I went through was really funny was bringing a project from like the country to a different country because of leaks you can't just like email it. Yeah. Yeah. It's ironic in a working 2090. You gotta fly over there like iPods no shit like old-school iPod to go to a different like label. Wow for Sony music. Yeah it did.", " Yo, here you go. Right. Wow, hilarious story. I was there with like an artist manager. We were delivering this project and the game plan and the whole marketing company, we're doing display back to invite every single press in that country got stopped by TSA. Oh shit and they were like, hey, like what are you here for? Like we need to open like this bag. I'm like I cool. You can open the bag. Hey, what's this and it's this iPod is my first time like being in this role before. So yeah this like,", " - Hallie to like I can tell you that you don't press that button. Whatever you do don't like. Hey, just let it go. Yeah, so they were likewise like well like it's I can't I can't play you two. Like I can't tell you what's in it, right? It's just private confidential do thought I was like just a complete asshole because of that. Yeah, so I held me for like two hours. Oh shit, like wow the artist managers waiting outside. Oh my God, like the story here is like this artist this", " Bull management relationship and how big does become I was freaking out. I was like, oh man. Sorry smashes been waiting there for so long. I know whatever I get out and I'm like other they're hot. They've waited here for like good 2 hours and 20 minutes at this point as the TSA member goes. Hey, why did you why did you held him back? He goes getting want to tell us what's in this iPod and the Martin the manager was like, let's go out. Oh shit. He had that night and spoke to me about how like you were willing to go.", " They're that far. Yeah, an artist is confidentiality and they took that to heart because it was like the explain to me like if this did leak, yeah it is game over is this is where it gets to be right for your but it's like think of it from the artist side. It's something that they've been working on for year right thing. You're holding. It is your own like you're keeping it close and they were like that's amazing like you like that. I've never liked that you were willing to go to like extreme limits force and I was and I'm sitting there and I've", " I was like, oh, yeah, you were just doing it out like like like Goodfellas. It's like it's a you tell nobody got anything. Yeah six-month campaign and it was easy for us to get through the line from the label side. It was here first because they trusted me would any decision. I was hoping you've already faced off against the government like maybe that fell in love because I was like, I never experienced that before in terms of like changing a full relationship First first day we met wow. I told him you had some um,", " That had a nonprofit organization.", " It was fighting for a change that was happening. So, you know within the United States but mostly globally that like that meant a lot because that was more than about music but we're connected to the music at the essence of the songwriting. But it we were hiring people that don't usually get that type of Love. Yeah that are really like have gone through unfortunate events and situations and found inspiration out of it and was like, I'm going to I'm going to get up and make a change just the impact. It sounds like the impact of the music was just like I was that was", " The incredible that's what music is all about the right person. What can you really do for people and how can I really uplift people in some way shape or form? Yeah. I was highlighting and tying that music back together with people that you know have been doing this for years and giving and giving them some sort of highlight is a beautiful thing for sure. So yeah man want to get into some of the specifics right now to help those those people that are coming up and kind of get super technical a little bit but one of the big things that a lot of people", " Of trouble doing is defining Their audience write an artist or a manager that like, oh shit, who is this music really for that? We're working on so, you know, what's the best way to go about doing that? Is there an exercise that you like to use? When when you start working on a new project that you know helps you define what the fan base is going to be in the audience that you're going after is there anything in particular, you know, just kind of over time you start to just get a better understanding of where?", " Music's going and where something might fit. I think it's both I think for front up-and-coming artists your base is so small whoever gravitates to it is your audience and it's on you to learn that like you should definitely learn them not to sound weird. But like go through there you don't you have a lot for understand all of them go through their Instagrams see what they're into have an understanding who are the people to gravitate know who you're speaking to so, you know how to speak to them right now and I think your best way to do is literally go through comments on Instagram. Yeah your comments on", " YouTube, you know if you're selling stuff on iTunes you will see feedback on iTunes to just like go on Twitter and like research yourself and what p and who these people are speaking about you and then go into each of them. You'll start realizing there's a Common Thread. Yeah between like the people you're clicking on on Twitter and the people you understand like we hold up. They also like these artists. They also like these brains you start seeing those things, right but then for artists are established you kind of realize you open this up. You're like, are you", " Do have a base now right have a foundation. We have to get you bigger or we want to be bigger. So we're helping you get bigger and then becomes understanding the artist. What else are you into because each pocket of a lifestyle is there's a niche online that's living there. And all you need to do is just tap into them a message to them. Right? So it's like understanding the artist is the second thing. It's like what are you into as an artist outside of musically into video games and sneakers into fashion, whatever food, whatever may be and you", " Are identifying those people and then you start hitting them and kind of like the two ways. I look at it in terms of just to piggyback off that for a second for the people that are just starting out. How did they even get that like is the best way I mean, we've talked to a number of people where it's like when you first start now it's about quantity over quality. You've got to start just putting out a ton of music to like get that feedback to see what people are saying and to like not necessarily hold back on everything, you know, is that something that you think people starting out should do is like, you know, just", " Just let it rip go just go because it becomes a part of your artist development story right as a part of your process story. If you're documenting that online on socials, which is like the legitimate point of why the internet even exist you're giving people this behind-the-scenes look of how you are getting better and better and when you bring someone that in-depth into the creation process they fall in love with you more in my opinion. I think that they feel like Derek dare with you. They want to see you grow. They build a vested interest you letting them track with your trajectory.", " And feed them you got to feel whoever's listening feed your fans and your fans. I think people try to cheat that not realizing that you can't like they just want to get to the point of deepest impact as quickly as possible. And I think that leads people to a lot of things like buying an engagement. So buying likes buying followers buying views buying streams. I guess I always talk about like the detriment to that anytime somebody talk brings out in the conversation. They're always talking about the downside but it's something that's widely practiced like", " So do you see any pluses Sandy part of that? And do you see any - has to that? There is no pluses to buying anything. That's not real. The I can't even like although say that because when I was in high school, no, sorry when I was in college, I was a sophomore I bought a fake Louis bag and it was a major plus because I pulled up with its campus and I look like that dude. Yeah, then you pulled up outside of campus. But know what a real Louis bag looks and then I never made it that far. I was running down the subway steps the strap broke, so", " That was the end of it. Yes, and I carried myself in my arms. This is the sad story. I could write for Disney. These are yo harrowing Tales depends that depends on editing and the way yeah someone in Rotten Tomatoes with like a breakdown paragraph about how would it allergies? Yeah, print hit the pavement. So we go positive. What are the drawbacks the drawbacks is?", " Is like right we and mm become super transparent the way you make money as an artist in or at least a majority of your pie of your profit and your revenue or Revenue at the end of the year comes from touring and merge no matter how we shake it. That's just what it is Faith followers does not equate to real hard tickets being sold. So that's just where it is. Yeah, right. So that's one from like when you actually made it standpoint, but the other part is like you I just mentioned it. You have to learn your fans you have to be able to click on", " The comment on Instagram go through their Instagram and be like, oh, yeah, they all sweet there into the shit that I'm in right at that time, acquiring the people that want to acquire a fake followers going to get you nothing. You have ever gone down select photos. Yep, big biolink doesn't it's not even if there's if there's no value. There's no real value yet. But I think what they're going into is thinking that if they are going to somebody or they're trying to appeal to somebody like a complex or they're trying to catch the attention of a brand or a label or anything like this. Yeah, they want to", " Have at least the optic of you know, I have 750,000 people following me. That's arrogant as hell. It is super arrogant because that's you assuming that these like 4500 fashion brands and these top media companies like a complex and fader don't have social media management teams in the building features a baseline word. That's not even like don't go there if you're up and coming artists put it out. Don't even look at the number go to the next day. Like Let It Be just concerned with you.", " Be concerned with just getting it out and got like 100 percent and in your music out is like important. I think that's it. And for sure, I mean there's we continue to ask people that same question because we want to reiterate that point like over and over and over again so that you know, if you don't understand that from the first person that we talk to you get it from the second or the third or the fourth person because it's like it's really about trying to build value no matter what in the fake shit that plays the streams of whatever.", " You know these companies to fill in your middle of the road stream. Yeah, it's just it's not going to work. There are other growth hacks out there that provide real value and it's about you really doing the work exactly. It's about really putting out a bunch of music. You may find that like, oh you drop a song every Friday for a month like you're seeing a lot more real traction from that. That's the growth act. So then the hack becomes our every single Friday for the next year. I'm going to continue to drop music message that you write in the build-up to eat it you could on Discovery, right?", " Right you doing? Yeah, and that's where changes. Yeah, there is really no shortcuts to this like at all. So then that's like a perfect segue into the next part here. Like it can be overwhelming for people just starting out with all the platforms. Like there's something new popping up every other month, you know, it's kind of leveled out where there's like, you know, three or four really big ones, you know, but do you think that artists starting out should just narrow in on one or two?", " Two platforms that they love or that they're really good at as opposed to like being on four or five and being like average across everything. I mean, I think it depends on one like what you're capable of as an artist. So if you have a team like you should be able to put content up in every single. I'm assuming it's all about social platforms are we talked about DSP? Social platforms? Social platforms? Yeah. Yeah, you should be able to at least mirror everything you're putting up in one, you know in one platform that you're focusing.", " And across all right presence there, right? Even if it's just to own the name just to even start their right to have it on the name, right? And then it becomes you can literally connect your Instagram in your Facebook. I'll push lets you know, there's is 2019. Yes waste of you everywhere. Now as far as where you spend your time on an engagement level like when you start talking to fans when you start use you figure out your flow, right? What are you really good at? Like if are you a very visual artist?", " So he's understanding you right you as ours you have to understand yourself first. Your team has to understand how you move first and foremost, but if your visual artists and you live and die by photography and system and good visuals and good videos, then you ewbank on Instagram right Bank on a much more visual platform. But if you're an artist where you're really good at one-liners and you know how to like snap back at fans unlike a positive, right? Yeah, we're Snapback. I was happening culturally then you yeah you", " Saying on Twitter. I think you understand yourself. But yeah, you could put your focus in one but it doesn't mean you completely just desert the others. I think you have to get smart with just you know, reusing your content right begin, right? It's on which one you feed most consistently and how ya like you can check in on Instagram if you are good with the Snapbacks and what them like the one-liners you just turning into a caption. Yeah pick and just let that be it like you don't necessarily to be on stories doing that Jim you'd like on Twitter firing off and yep. Yeah agreed and", " I think that's like the biggest Point there's like knowing yourself, you know, because people just starting out there. There's always that case of fomo, you know what I mean? Like you're missing and it's like just bring it back to yourself. What do you love doing and and then work from there? Yeah, you know and be like, all right, cool. My main focus is going to be Twitter and then I can just reproduce this the shit and then if you have a manager or you have someone else that's working with you a graphic designer on your team, then like that's some stuff that you can offload to them exactly.", " That's like the alley-oop a man take this thing off Twitter, you know copy and paste exactly what weird other way around whatever's on Instagram copy and paste and put it on Twitter. But that role until we can get, you know, smarter weed how we use each platform, right? But these be present have a presence in each one and time will tell as far as like you having more hands to hell right now having you know more people around you that can potentially completely take that load off for that whole platform off your hands so they can just run it themselves. I think that will happen as you", " Philip as an artist the next layer of that then becomes, you know metrics to look at so like what are some key metrics that you look at with some of the big brain or the big acts that you work with is it like alright obviously engagement is huge. But is it more so common it's over Lex. Is there any one thing in particular that shows like? Okay you can you see it in this really small space and because it's happening here, you know, it's going to just like Skyrocket and I look at comments a lot. I even more specific. I look at people's comments.", " For the tag their friends, like let them know that this is happening because you can you can buy fake likes comments. You learn so much. That's a good point comment. And that's a that's a actual effort from a person if you can get someone a comment they will like yourself because you're like it. Yeah, I appreciate our Instagram is kind of adding that layering now where they're making comments, especially transparent because now you can like a comment as well. Yeah. So if somebody's tagging people are like that comment at like you can reply and you can like you're adding another depth to it of", " Amen to that, so you really are making comments or true or metric you're not just putting it out there and just saying, okay. This picture has 200 likes but it has a hundred ninety-seven comment. So clearly there's like some action happening on the doctors. Like you have a comment that has 50 likes on it and it has 25 responses of its own and you know, it does make it a bit makes it a bit more of an intuitive metric and and I have like a theory this didn't come from like Instagram or anything like but actually like just from studying each platform. Especially Instagram. I've come to realize that", " Since things don't isn't on an order anymore by time and is in order by like the comments like will float you up. So the more Christ you tend to be the first two or three on another person's timeline, right? Yes. Sure. It's fun. Because like hey, this is Pop. Yeah. I'm waiting for like an official like statement from missing them all. That's you're actually correct. This is just me. I just a theory of mind. Yes works. Right? Right, right more comments. You have you will float above everyone else on it. So then", " then how does how does an artist take that metric and then apply it to something actionable going forward is is like it's really about mining that being like, okay cool over the last three posts. I got x amount of comments and then it's about trying to reproduce that that same sort of content and but in a new way right and talk to your fans, right if you engage put it on your stories say new post go like and comment like you kind of have you kind of have to constantly double back. Yep and Hammer in that they need to be engaged.", " Each other with this in some way like you can do a call to action. I think that's something that people have gotten too proud for where those of us who have worked in and around media particularly digital media when it was New Media. Hey, right like you call to action. That was all we had. Yeah, go listen those stream click here, right? That was what you had was that call to action. I think now everything is so in line whether it's a tweet and you just put a link in there you like", " Like all right. Now you two were now everyone is to absolutely ask their fans to do right? No cute might delete later goes back to engagement. You can't be too cool to want to connect with the people you want to connect with you and with right and and to spend.", " Money, right you want them to spend their money at some point you're going to ask them to come to a show or buy a piece of merch if you're not going the extra mile to talk to them. If I'm see you in the class. I'm gonna send you a bottle. I want to have a shot with right exactly. I want you to actually a cage with you. I don't want to look at you on high right my tribute to you about my tithes and offerings. Yeah, no meet me at the bar. Yeah. Let's have a glass of the shittiest vodka they connected so that as you build", " and as I build we can come back dirty because little bottle. Yeah, they're honking. That's exactly that's because it's backwards now like social existed for people to have one-on-one connection, right absolutely was designed for this. Yeah. Yeah artists don't do this yard is don't speak to their fans artists like not even the fuck the by now like asking what do you think of these drums right really into that conversation for you by tell me how you feel about it? What do you like about?", " - change introduce them to a premix. Yeah, I put this link up. Give it a listen. I'm going to keep it up for the week. Let me know what you think of your back in the studio end of the week. I'm chain. That's an excellent point. You're such a jerk people into the creative and I've what I've managed like I've we put out premixes or we do you put aversive when IG stories or you do like these little things and you say you know what, let's get their input. Yeah, like let the fans executive see if it hits ya because they are investors and you know, they just familiarity. That's not other say yeah, just like you heard them seven, who are those women?", " Bars War they can fall in love with her - so then you hear the final you're like it immediately as human-like nature. You're like wait, I heard that before. Yeah exactly. We've got away from because I mean this is there's a separate old-ass debate that we're going to have we're going to bring this back for a conversation. We just complain about the state of rap but quick it's hum, like I think rappers like when they went to radio when they did mixtapes. Oh, yeah. He really is a freestyle. Yeah that verse ends up being your favorite verse from a song on the record, but you know it inside and out because you've seen", " That show job because you've heard it on a freezer because like uh Spanish and it's literally 100% And they know it's that verse that's why they go out and say it and every fucking that's why they say it on the DVD another Noble wife DVD exactly and you can ad-lib the shit out of it. So when you put a beat behind it and put a curse on it, it's not your favorite shit. Yeah, and you can't escape it being your favorite shit and people get away from ship. They're so concerned with shit being new. Yeah. It was shit being shiny that they forget about shit being loved. Yeah, and it's just it's what we fully", " got away from again engagement. We they don't care about engagement anymore. They want to play like they absolutely to back in my day. But I think there's two people that have done that really well somebody like gambino from like jump. If you go back you can see shit. You can see videos of him at NYU doing freestyles. Like I think the one cool thing about him is that one of the cool things about him is that you can see that progression of like", " He was just like really trying to wrap and try and figure this shit out and like, you know, what was super quirky and then you can see all the themes that he was talking about in like how he got better and he was doing it in front of us, right? And then I was like, okay rapping then I'm going to act then it's I'm gonna do stand up then it's I'm going to write then it's you know, and to see that progression is what people fall in love with right and now you're like, oh my God, that's amazing. That's transparency. It not start, right? No. No that's parents you dies what allows him to absolutely yeah because", " He never opened that up that curtain up. Yeah didn't know he was capable of all these other things. He came out the jump as a rapper right right breast and up. I don't know if we would have fully exploit like accepted that I'm not a hundred percent. Sure. Yeah, that's everyone who's stumbled upon the explore page. Do you know why the food Instagram pages and all those videos and shit do so. Well, it's because we love the process. Yeah more than we love the final product.", " And that's just human nature. So if you give people a glimpse into that process show them how it's coming. It can be the most tedious should ever but if you show them that process they will absolutely he could be the most likely they were I need food shit. They were not even started. Sorry to cut you off but it's going right where I was going. It's like they'll forgive you as well you're looking at Kanye is perfect. But I saw it come together Kanye is is the prime example that right now obviously all the crazy political stuff that he's been saying over there.", " Last right says slavery was a choice. I was like seriously, no. No, but but it's been like that crazy where it's like people that have always loved him and fought for him because of what he represented. He just completely went back on that's a whole other conversation. But just to put a button on on this part about being transparent showing people behind the curtain a little bit the Sunday service stuff, you know what I mean? It's like for better for worse, whatever you think about it, like there's a bunch of people a few weeks ago when he had that.", " One record that dropped and he's out there like stomping on the ground there were like, oh shit or forgiving because the rock right see here like long as well. Okay into yeah Collective Grace's Sprite. You're absolutely and and then I mean, yes, I can't no no, I mean it's hard. It's for real, but it's like but it's also like it hurts to say that those who because you're like, you don't want to say that but it's like man, but for the people here in this room, there are forcing her brothers who were talking who were talking around like you", " know what he's trying hears him yelling up like yeah, like for those of us who see it as pandering are those who and you know, hopefully they're listening but there are those who see it as him like bringing his way back into forgetting because our processing his weight. Right? Right is that word again to processing his way back into forgiveness into being? Okay, right? It's being okay with him and hopefully that's the Kate. Hopefully, hopefully hopefully exactly exactly but um, I remember before we get you out of here though with everybody would kind of", " At the end we kind of want to make it super simple for the listeners. Like what are your top five tips for, you know up-and-coming artist when it comes to building their fan base with the marketing that they're doing is they're like, it doesn't have to be five. Maybe it's just like tricks and doesn't have any financially the bike just some things to look for like if there was a short list on the undeniable. Yeah, so maybe that's better instead of typing. What are your undeniable sense in terms of what you need to be looking for and what you need to be doing to build your audience is one I think understand yourself.", " And yourself as an artist understanding what you stand for understanding where your music stands for understanding who you're trying to acquire as a fan base who you're speaking to as far as like your writing as a songwriter. That's one. I think that's like has to always be the started because that's the foundation Foundation, right? Then second is like consistency just like consistency and not being and being confident the work you're creating but be consistent like just continue to put stuff out because that'll help with the confidence to yes.", " It's but stuff get those reps and put this put your reps in put your stuff. I get your shots out there like this stuff out on every platform that you can if it's just sound physics. Just put your music out there post on socials, you know, put yourself out there as much as possible. That's to write talk to your fans has three or and engage with them and speak to them and for just like get don't hold back man. A lot of artists really are like waiting for the perfect moment to put stuff out and the next thing, you know, two years flew by yeah.", " Or what you were working on that was of the moment. That was great. Yeah is no longer its dated. Yeah, you you took you to all of it actually. Yeah, you might have been ahead of it. We have decided to wait to get like the perfect situation instead of just letting it out in your waited for the perfect. Yes Ted of creating the perfect. Yeah absolutely get creative get creative. That's both from a visual standpoint and the music standpoint and then like on a budget", " Stretch $100. We write the best out of 20 bucks. Yeah, really, like get creative with everything that touch such a gem because like people think you can't do anything. Oh, I only got a hundred or two hundred dollars. It's like, you know instead of buying those Jordans, you could invest it back into you know, a photo shoot or you know paying somebody to do your artwork for your Instagram page or whatever. Like that's an investment. That's how you should be thinking about the little bit of money that you have when you're first starting out and don't think that you need a lot.", " Not to like make ya best product like yeah, I mean five six music videos off the top of my head right now. That was less than 2 300. Yeah. It's about being creative. Yeah, it's just and it's you make it you make it work. Yeah, and and and I think the coupled with that it's about paying attention to what's going on on the networks that you're on so Instagrams your thing pay attention Instagram. Look at the accounts that are Poppin read your comments everything that you were saying and then take that and be okay. Those are your creative like pillars that you could", " Just a framework for how you should be thinking about it. It's like okay. This is the guy that could use how can I what can I do with a hundred dollars? That would get me X Y and Z, you know, whatever those things are. So yeah, I think those are those are super clutch. So yeah, man, I appreciate you appreciate you coming through before you get out of here. You know, what are you working on that? You're super excited about now, and you know, let the people know where they can find, you know that good stuff. I mean there's a lot happening right now. We're about to drop the fifth episode of the can just preach series with John Legend mm that's coming in.", " The next two weeks were knee-deep in like little nausea X stuff. Yo. Yo yo Billy Ray Billy Ray. Absolutely. It's been a it's been a song of the century. I remember you telling me about that a couple of weeks ago. And at first I was like, you know what and then captures I think was going on in 2019 and was happening in Iran was happening in youth culture. Yeah - a perfect definition of that and then it's a few up-and-coming are like Dominic", " Ficus someone that like were you know where heavily investing in and as far as like work and love goes and we just want to see the next step of that because we think he's really, you know, he's Amish Opus fucked Elm. And Dominic's is what's up, and I'm little TJ Polo G on The Hip Hop side of Columbia Records. So there's a lot man. I think that were were good for the rest of of the next 2-3 years because we covered. Yeah, imagine the side man called The Rake all the rage.", " Is going to be a gem coming out 2019 at this is gonna be a good one. Nice man. I'm where to find me John Vincent south side of the name Chuck underscore don't like the weird. Social medias. No. No, it's all good. Oh good hit the Google's hit the Google's sure we'll run into each other and thanks for having me. Yeah, man, I appreciate you guys are doing is absolutely needed for a lot of up and coming artists managers and people are trying to get into the business is needed for them to get these types of conversations in gems in front of the learn I think is super important.", " Tell Rich appreciate it, man."]}