{"showID": "00cpOS24Y5536ZbzDirP3K", "show_name": "Girl On Top: ShallonXO ", "show_description": "What happens when you mix Carrie Bradshaw with Dr. Phil? You get me, Shallon Lester, an author, editor, NYC It Girl and YouTube dating coach with almost 1 billion views! On this podcast, I’ll answer YOUR burning questions about love, lust, life and lip gloss—and everything between. Are you ready to join the #Shallontourage and take over the world? Time to get on top, ladies... ♥️Got a love quandary? Submit a question at www.shallonlester.com ♥️Instagram & Twitter @ShallonXO ♥️YouTube https://www.youtube.com/user/shallonlesterFor advertising opportunities please email PodcastPartnerships@Studio71us.comWe wanna make the podcast even better, help us learn how we can: https://bit.ly/2EcYbu4", "episode_name": "Anxiety Answers & Besties Behaving Badly", "episode_description": "This week I’ll tell you how to fix anxiety without medication, tackle friends who are in trouble… and ones who are MAKING trouble, whether or not a guy is just “being nice,” and what to do when a first date conversation goes flat! . . 💜ENJOYING IT? 💜 please rate and review this podcast! . 💜BINGE💜 4 new videos a week https://www.youtube.com/user/shallonlester . 💜FOLLOW💜 Insta/Twitter @ShallonXO   Learn more about your ad choices. Visit megaphone.fm/adchoices", "duration": 36.24446666666667, "transcript": ["Welcome to Girl On Top shall anexo the podcast. I'm your host shall in Leicester and you might know me from my YouTube channel where I analyzed celeb relationships and Scandals for the lessons. We can take into our own lives. But here in the podcast. I answer the questions you submitted over the past week. And today we're going to be talking about anxiety friends who need help friends who are making trouble flat first a conversations and why guys pay so much attention to the", " Skank and just a reminder that if you want to chat privately with me find me on the instant Go app by user name is shallon XO and click chat to get connected. Also. Be sure to rate and review this podcast if you like it and find me on YouTube for for new videos a week.", " So Brianna asked me this question. She said I'm in a really good relationship with my boyfriend except that he's diagnosed with anxiety and takes medicine for it to help and this affects his sexual life. And sometimes he has erection problems. And for me sex is really important in a relationship. But once in a while like I have to cope with this issue and like we can't have sex and I get sometimes angry or frustrated which causes us to fight. So what do you think is this a deal breaker or can this be improved and how because right now?", " I'm like at the end of my rope. So you guys might have seen the video I did on anxiety. I actually took it down because Zayn Malik was not happy that I called him the thing that I called him, which I won't repeat but hmm anyway, but in that video I say that anxiety is basically two things. It's self-absorption with the perceived sense of powerlessness, right because when we get anxious we go into Spirals and there's", " Spirals about what's going to happen to us what's going to happen when it gets going to happen to me was going to go to the world and how with what's happening to the world. How is that going to affect me me me? And then the powerlessness is the key component because it's natural to worry about ourselves and the world around us, but it's the aspect of like I can't do anything about this. I'm on a plane and I can't fix it if it crashes and I can't stop it and I'm going to die things like that. And so I have kind of a different", " / radical approach to anxiety which is stop fucking medicating yourself. I mean, yes, of course, there's situations where people you know, you need medication to just kind of take the hysteria off so that you can think more clearly but I think we are being way over medicated for things that are like normal life events. I hear you guys say like I've been diagnosed with anxiety because I'm going away to college like girl what you're dealing.", " Dealing with is life its life. Of course, you're going to be anxious making a major life shift. You're going away to college. You're leaving a marriage. You're starting a new job. You're in a new town. Someone passed away. You broke up with someone. This is life. This comes standard on human. And we need to develop coping skills. We can't just put a pill in our mouth and just because we can take a pill for something doesn't mean that we should because look we're finding out a lot about drug companies lately right these", " Side effects are oftentimes built-in I is I know that sounds crazy. And I know I sound like a bit of a conspiracy theorist but this is like a proven thing drug companies will make a drug with a side effect and oh wait a minute. They also just happen to make Viagra. Let's write a prescription for that. Like that's just business practices and we can bury our head in the sand or we can be like, okay, maybe Western medicine isn't good for every single problem we have don't worry. I'm not an anti-vaxxer.", " Anything like that, but like we owe it to ourselves and our bodies and certainly like the people around us to explore things in a more holistic way. So like I told Brianna like obviously don't tell your boyfriend like go cold turkey and like I don't know his medical history. I'm not a doctor but I just play one on TV, but like look for more holistic options and look for things that are cognitive behavioral shifts like he needs to be seeing a therapist because cognitive behavioral therapist can help.", " You come up with real-world coping mechanisms for anxiety, like one thing I do because I get anxious to I get really socially anxious with people kind of don't assume because I'm very socially fluid but so I like anesthetize myself with food and alcohol, like I'm always eating something or drinking something if I'm like the center of attention in a group because it's I'm anxious. So what I do is I give a name to my anxiety and I used to literally say it out loud. I would sit there be like anxious anxious anxious bored bored bored.", " Bored bored anxious anxious anxious and for whatever reason just naming it helped like even me just saying that now like made me feel a lot better. It's like this pause. It's a deep breath and it's a recognition of what's going on because monsters live in the dark, right and when we don't give a name to someone or it's just this free-floating thought we're like how it has all this power over us and even just naming it can kind of help demystify it and take away some of its power and then we", " Take a step back and be like, all right. I'm bored. I'm anxious. I need to leave this party or I need to get out of this conversation or I need to go take a walk and eat some fruit and be outside for a little while, you know, we're more easily able to evaluate things. So look at some holistic shifts meditation probiotics, which is incredibly crucial to your body and because probiotics they mimic and they help create serotonin. They regulate serotonin levels. They regulate your immune system, you know, it's", " You got to be taking some goddamn probiotics. I really liked by. Okay, I'm not this is not like a paid endorsement. I just really like them. It's bi o - Kay and you can get them at Whole Foods or health food stores or whatever just make sure the refrigerated like any sort of probiotics that you take have to be cold. If they're not they're dead. So don't believe these like, you know, unless they're super fermented but like the ones you get on the Shelf at Target. They're not going to do anything for you. So invest in some good ones take them every single day and like they", " Early have changed my life. Like I used to have debilitating asthma and allergies and I don't anymore. I used to be on antidepressants and I'm not because I was able to regulate my serotonin levels, you know, so let's say though that this this like sexual dysfunction kinda is what it is with him. I mean, he's going to have to make the decision about whether or not he wants to look for remedies that don't have these side effects or not and like that's his life and that's his deal and", " Sex really is the glue that holds people together. And if you've ever been in a relationship where you don't have that sexual chemistry, you know how true that is. It sucks. And especially when you're young like who wants to be in a sexless relationship when you're young like come on and I also think it's like this is my little feminist tangent. You know Lube is like the worst thing to happen to feminism because oh she's not wet. Oh, I didn't warm her up. No big deal. Let me just squirt some lube on there and keep going.", " But if a man doesn't get an erection the world comes to a grinding halt, you know, like you don't just tape it to a popsicle. Sip stick and keep on going right you stop the whole thing stops. There's no more sex life. He's not just going to go down on you for two hours and not have sex like it's a whole shift and so I don't really Advocate that. You know, it makes me mad. I don't even know if I have a point for this it just it just makes me mad but there are some things you can do to boost the sexy kind of mode. One thing I like to do is have like", " Sexy book club with my boyfriend were we each like read like the same like erotic novel and if you're new to the whole erotic novel thing because it is like silly and cringy but that's also part of the fun, you know, but if you're new to it start with 50 Shades of Grey, you know, it's easy, it's Dom you can laugh at it together, but you could also act out some of the scenes together. You can roll Swap and it'll just get you in a sexier frame of mind where you're talking about it and you're thinking about it and like that could help a lot.", " Not because right now what has medication is doing is just dialing everything down right? Because it's it's kind of like how chemotherapy is just kind of like a bomb that goes off in your system and it wipes out everything good and bad to try to kill the bad the same with anti-anxiety meds. Like it's not so specialized that it only dials down the main it dials down every single aspect of your personality your creativity your sex drive but like also, yeah your temper and your Mania I like my sex drive and", " Like my grid tivity and I even kind of like my temper. So that's why I look for Holistic Solutions to stuff like this. So if you're in this situation either with yourself or with a partner really really explore your options acupuncture Eastern Arts and Sciences herbs and spices like Kentucky Fried Chicken, like there are answers out there because everything that we're experiencing now is humans ain't nothing new Under the Sun baby people in the Middle Ages. They had anxiety to people in the time of Confucius they had issues as well.", " And they came up with Solutions. So look around the answers are out there and it might have like such a benefit for your mind and your body and your relationship.", " This next question comes from a Nicole and builds kind of on our last question about anxiety, which is how to help someone who's in trouble. So she says I have a situation with my best friend Jen from high school that I need help with she and I have been friends since eighth grade and we're juniors in college now and our Dynamic has really changed as most people do when they grow up. However her family moved from California to Georgia. So we can't see each other during school breaks and she had a really hard time last year which resulted in her losing like literally all of her friends at school. She's struggling with an eating.", " Sorter, which honestly I have as well when I'm still working through it, and this whole summer. I felt like a crutch for her. I visited her last month for a 21st birthday in Georgia, and honestly, it was terrible. She was throwing up her food after meals and lying about it. She was comparing herself to me, and honestly, it just wasn't the same with us. Nothing terrible happened on the trip, but I left just feeling gross. I live in LA and I live a very fast and exciting life like you do. Thank you, and honestly, I don't have", " Like I have my own problems that I have worked on this summer and I feel like this is setting me back and honestly, I just don't have time to be her only virtual friend. It's like I'm only friends with her out of pity and guilt at this point because I don't know what I'm getting out of this relationship and I feel like a bitch because I don't want to abandon her but I have literally been the best friend to her and she hasn't always been for me. I've done everything in my power to help her and I just resent her to the point where a even tried to pick a fight with her so I could have", " Time to not speak with her and that's just not who I am at all and I want to do the right thing help also. Love you. So yeah, I get this and I'm so sorry that you have to deal with this kind of dynamic especially since like you're tackling this issue on your own you're dealing with these own things and I understand the feeling and I think the reason Jen keeps leaning on you so much is because you're dealing with this too. You're an easy target. You have a huge amount of empathy for her and honestly, probably not a lot of people", " Do at least not in the long run, you know at your age everyone is dealing with something and nobody really wants to play therapist. Nobody really has that kind of elasticity and honestly like at no point in our lives we want to play therapist for other people. I mean, I guess I do it for a living like in my own life, like nobody likes that kind of one-sided friendship. So sometimes I think it's helpful to pull back and and to get some objectivity to reframe circumstances in a different light like if she were a drug", " You would not feel guilty about giving her a little bit of tough. Love you would absolutely not tolerate her shooting up at the table dragging you along to see a drug dealer mocking your sobriety, right you would sit her down and say this. So here's your script. Look. I understand that you're suffering believe me, but I can't be the one to fix you. You have to be the one who wants to fix themselves and I understand that this is not an overnight thing. It's a journey, but I don't see", " You taking the steps on that journey and until I do this situation. I need to step back from because my involvement at this point feels like enabling you and since I'm going through a lot of these things on my own. I can't sacrifice my progress for yours and she will probably rage and she will get mad and call you a bad friend. You're abandoning me. But remember the people who don't want you to have boundaries are the people who benefited from you having none at all. She's pulling on your heartstrings because she", " She'll respond and there's a reason she doesn't have any other friends people actually don't like to be manipulated. They don't need it. They're going to look at her and be like the fuck am I sticking around for what? Why do I need this dynamic in my life, right? It's exhausting and it's fruitless and tell her that you will be by her side if she wants to get help in a healthy and constructive way. But if she's not going to do that, you are not going to sit here and watch the car crash.", " Any submitted this next question and she's going through something that I know a lot of you guys have experienced. So she said I've been with my first boyfriend for a month now and I've noticed that my best friend has acted super weird ever since we became official. She's been really distant and ignores my texts that have anything to do with him. I get the feeling that there's some jealousy there since she's single and she's the type of person who is always talking about wanting a relationship and constantly needs attention from guys. I'm just frustrated because I wish he could just be", " Happy for me, but she has just been really judgmental. Honestly, do you have any idea what's going on or how I could address this with her? So yeah, basically you're exactly right. She can't be happy for you because she feels like she either deserves this kind of happiness more or she just plain wants it for herself. So I would sit her down and be really real with her. Tell her basically exactly what you told me.", " I really would love it if I could talk to you about my relationship, but you seem to be really bitter and honestly, it's putting a huge divide in our friendship and I don't know how to fix it apart from breaking up with the guy. I like which I'm not going to do because this friendship shouldn't cost me other relationships. I wouldn't ask that of you and I don't think it's fair that you potentially tacitly or overtly ask that of me.", " She's probably not even aware of what she's doing or certainly not to the degree. So give her a little bit of reality because yo, this is life. People are going to have boyfriends. They're even going to marry. They're gonna have a husband's one day. They're gonna have children grandchildren. She needs to learn how to deal with it and reconcile that other people having something that she wants doesn't mean she doesn't get to have it. She has that potential there's enough seats at the table for everyone.", " You having a boyfriend doesn't mean she's doomed to walk the earth alone forever. You know, if anything she should be learning by example on how you manage to find a healthy relationship, but this could just be another example of someone who prefers to be a victim they like their victim narrative and if that's the case, she's not your problem to solve you might just have to kind of put her on the back burner as someone who is now just a tangential friend versus a main priority, but talk to her and see what she says and most importantly see what she does from there on out.", " And it also might be helpful to like because maybe she's feeling like logistically slighted like maybe you guys would get mani-pedis every Friday and now you're with the boyfriend so set up intentional time for just you girls, you know, whether it's a sleepover or a dinner or a binge watch or whatever let her know that she's a priority in that way. But like I said, this could just be some weird pathology she has and she just might straight up not be happy for you. And if that's the case, you don't need someone in your life who wishes you ill.", " Even if they're not connected to that feeling if anything then like not connecting to it is more dangerous because then they're going to do things and like with this plausible deniability of like well, I didn't mean to I didn't mean to DM your boyfriend. It's not it's no big deal. Like I want an enemy with an agenda. You know what I mean? I don't want a snake in sheep's clothing. I want to know who I'm dealing with because like intentionality doesn't really do much like so", " Why didn't mean to hurt you? I didn't mean to be mean. All right, well drunk drivers probably don't mean to kill anyone. It doesn't mean it's not possible. So sit her down talk to her about it. She might have a Moment of clarity and Awakening be like, oh my God, you're right. I've been such a jerk or she just might keep entrenching herself into this victim narrative, and it's only going to get worse.", " This next question comes from Annie. She said I'm 20 and the guy I like is 25 we met through a friend at a party. He got my number from that friend and a few days later. He texted me. He's been texting me regularly for two weeks and this week. He started calling me every night. He always is the one to initiate contact and we have plans to hang out in a group next week. How do I know if he's just being socially friendly or if he's interested in dating me Ciro. Well guys, don't do things just to be nice like", " That's not what they do. They it's not in their nature. It's not in their inclination and part of the reason they don't do that is because Society doesn't expect that of them Society does expect women to be nice be polite all there's this weird girl. You should take her out for lunch. It's like no no one asks that of men so they don't do it and that just goes to show that that's Baseline human behavior, you know, and that we act like that because we're conditioned to so no, he's not doing that if a guy is talking to a girl it's because he's interested in her.", " But what kind of interest is a whole other story? I think it's a really big red flag that he's five years older and I know that five years on paper doesn't look like much and it isn't if you were 30 and he was 35 or you were 27 and he was 32 but 20 and 25 years old. It is a really big difference in terms of what I call Life Arenas like when I was 20, I was a virgin in a small college town when I was 25. I was an editor of a magazine in New York.", " That's a huge difference in my life Arenas a huge difference in my sexual experience Arenas. I mean just a difference in like living on my own and how I dressed completely changed and 25 a guy should not feel like he emotionally has a lot in common with the 20 year old girl and it has nothing to do with how mature she is because like obviously and is a very mature person, you know, I mean, we all are women mature so much faster. So maturity-wise. Yes. She's maybe more on his level. It's the issue of", " him not being on hers because it's about those Arenas if he's going for girls in a different Arena than his that means he can't keep up with girls in his own sphere. He's doing things that they would maybe call bullshit on or not actually be impressed by it all or the tactics he's using, you know would be a red flag to them guys who chronically go for way younger girls do it because they like the control. They don't want someone who's going to call them out. They want someone who's going to be easily Bamboozled and easier to manipulate and you being less", " Actually experience is also a huge plus he might not be able to compete with people his own age in that category either, you know, so that's why I see some red flags in terms of his intentions if you guys met two weeks ago, he should have seen you by now. If you're in the same town or reasonably close and I think that's why he's keeping so much communication and escalating this because he knows he's going to see you in a group setting and he's going to try to have sex with you. Basically if he wanted to pursue you in a legitimate way, he would be setting legitimate dates. He wouldn't wait for a group hang out because", " His men are hunters and a hunter doesn't want to get the girl. He likes around other Hunters who might catch her eye. I mean we get so confused about a guy's Behavior. But sometimes we just need to put it flip it and reverse. It's like if I had a guy who I liked who was talking to me and seemed in to me. Would I wait two weeks to see him in a group setting with other chicks fucked? No, I'd be like, let's go. Let's hang out tomorrow. I want to see you ASAP, right? You don't bide your time that goes for men and for women.", " So I would be really really cautious. So he wants you to know that you're interested in him and only him and he would do that by asking you on the solo date so he can have all your attention, you know, if he's a quality dude. So yeah be cautious. He's probably going to pay a lot of attention to you at this party and it's probably going to give you a few drinks and then maybe you know what I'm just not feeling this. Let's get out of here. Let's get away from this crowd. Let's go back to my place girl and if that's all you're after okay fine, but I bet it isn't because", " cause who wants to just get humped and dumped, you know, who wants someone that's paying all this attention and leading them down this road of like meaningful connection just like oh actually I just want to stick it in by because texting isn't hard if you can do something on the toilet. It doesn't count as courtship bold statement hot take if you can do that while pooping hate using that word.", " It's not a grand gesture whether it's texting whether it's liking your photos on Instagram or dming you or even posting a pic. It doesn't count. I want to see IRL things if his internet without if Wi-Fi went out across the world. Would you still have evidence that he liked you right? I have to ask myself that. What's he doing IRL?", " Because yeah who wants to be the Goodtime girl who wants to just have a guy pay all this tension and then dropped them once I've hooked up no one and you're better than that.", " Okay, this question is a wild ride so buckle up. Okay. So Kim is like I've been dating this guy for like the better part of a year. We've been a little bit long distance, but like, you know reasonably close and recently we broke up because I found out surprised he has a whole other girlfriend in a whole other city like a years long relationship and basically she's also like kind of famous", " I'm like dying to know she has but she won't tell me it doesn't matter and I don't know if I should tell this woman that like yo your boyfriend had a whole other girlfriend like part of me knows that she's going to freak out and like lash out at me, but I don't know like I just feel like it's my duty and I also just really want to like fuck him over. So I mean, I think all of us have been in a relationship or a situation ship where we realize that the person we've been devoting time to surprise actually has either", " a whole of the girlfriend sometimes a wife sometimes a wife and children sometimes a wife and a different girlfriend and children like men's capacity for duplicity knows no bounds no bounds whatsoever. And you know, it's I was actually kind of in the situation recently like my high school boyfriend is getting married and he's a monster like he beat me up when I was like when we got back together at like 25 and I went through this same kind of debate. Like should I tell his fiancee", " What kind of person he is? I reached the conclusion that like no fuck her like they're getting married at the Trump Golf course. I'm like, you know what? No. No, but like either she knows and she's like fine with it and it just also not a situation I need to wade back into I have moved on. I don't need to dip my toe in that kind of toxicity and like I said, you know after they've been together for a few years ostensibly like she I guarantee she knows what kind of person she is and she's either", " Thinking she can change him or just doesn't care or maybe she's just as crazy. I have no idea and I don't care but in this situation, I actually think Kim should confront the check because look I would want to know right all of us would want to know because the thing with cheating the thing that's so difficult about it is because that means you've been making decisions based on a reality that doesn't actually exist. You know what I mean? You're making plans you're prioritizing someone.", " This reality. This world simply isn't there. So I you know, I believe in Walking in the light of the truth. And sometimes we have to kind of shine a light on something. Somebody else's truth and look, of course. She's going to hate you. She's probably going to blame you but you're not responsible for someone else's reactions. I think he deserves a little bit of what's coming to him. I am big on Revenge because in the end of the day, he's just a liar and an asshole and he's absolutely not about to dump her. Oh, yeah. That's what she said. Like. Oh, he said that he's about to dump it.", " Horseshit horse shit horseshit. No chance never believe a guy when he says that never never never never.", " It's just a lie, and when you walk out of his life, he's just gonna look around for a replacement and he's going to keep doing this and having multiple girlfriends for as long as anybody lets him because he's an asshole. So yeah, I would tell her if I had a boyfriend who had a hold of the girlfriend. I would want to know and of course maybe going to hate you. She's maybe going to blame you but like again that's not your problem. So I would get in touch with her and tell her in the most neutral way possible. This is the script. Hey,", " Woman to woman I would want to know this if I was in your situation, but your boyfriend has been dating me for the past several months and not telling me he was in a relationship with you when I called him out. He said you were crazy and he was about to dump you. I know that I deserve better than this guy and I guarantee that you do too. So I wanted you to walk in the light of the truth about who this person is and she freaks out and call you crazy. Fuck it. That's her funeral. You did all that you can do and all you can do is all you can do just block her and keep moving on with your life. Don't try to get", " Further involved but if you don't think that like confronting her will be like a one and done situation if deep down be honest with yourself. If you're kind of doing this to keep the dynamic going because you want to provoke a confrontation where they break up and you get him don't do that. He is never going to stop cheating on people never you're just going to move up into her slot and then he's going to go out and find another you.", " This question comes from Kelly and she's dealing with something that I know a lot of us have stressed about before going on a date. She's like shallon. I have a date coming up with this guy and we've been texting for a few weeks but like his texts are really dry. Like I get flat answers one word. I feel like I'm the one moving the conversation along and so I'm worried about the date and like I'm literally thinking like do I have to have like conversational topics ready? I don't know and we've hung out before and had really good chemistry. So", " Maybe he's just a bad texter. I'm honestly not sure and I'm kind of freaking out so I used to stress about this too. And sometimes yes, I would literally go into dates with like prepared conversational notes and topics basically like on my phone and now I realize that that was really working against me long-term relationships and stable situations. They got a lot of downtime a lot and I need to know that someone I'm with can carry a conversation because Let It Be", " the the guys job to keep the chitchat flowing. I mean, I don't sit there and like silent is a hostage. Obviously. I'm pretty chatting myself. But I also don't put the burden on myself anymore to jibber-jabber the entire time so that there's no awkward silences for one. Like I said, I need to be dating someone who can carry their share of the conversational load because if you can't that is a crucial data point also I tend to get panicky and anxious and just mama no, I'm like a turkey. I just talked and talked and talked which means I'm not effectively", " Evaluating who this guy really is. I'm missing signals and I'm missing red flags because I'm just tap dancing as fast as I can from across the table, you know, and like most importantly guys don't want a girl who can't handle a little bit of Silence because like I said relationships have a lot of downtime and if a girl was on a date talking talking talking nonstop, he's going to assume that she needs constant entertainment which translates to high-maintenance dramatic and always,", " Looking like I mean for a fight, you know, so let the conversation unfold how it unfolds and remember if he can't think of anything to ask you a virtual stranger.", " Then why do you want to be with this person? I want my boyfriend to really be curious about my life. I want him to Delight in my stories and finding out more about me. I want him to genuinely. I don't know give a shit. Are we really asking too much for a guy to want to speak to their girlfriend? Wow Pie in the Sky crazy crazy goals. So if it's awkward,", " That's not something you need to fix but rather observe and Note and maybe he's only good over text. Anyway, you know, maybe his texting is as good as it gets a lot of guys are like that because we can curate like our texts and we like this is how online dating gets us into trouble because we have this amazing banter and Rapport on the text in the message Bubba and then we meet up and it's like who the fuck are you? It's like either the chemistry doesn't align the attraction isn't there or like? Oh did you?", " Have a co-author for those texts because you were boring AF in real life, like maybe you're nervous or whatever but this just like isn't working. So don't stress. You always got to go into a date with one attitude. What is he bringing to me? I don't care if he likes me. I mean, of course I do. Yes, but I lived so many years of my dating life just like I always say like a dog chasing a car. What would I do if I caught it? I was obsessed with them liking me it literally didn't occur to me to", " Stop and be like do I like him? I evaluated that in terms of like sexual tracks doing a fucking movie hot. Is he cute would he make like a great guy to flex on Instagram, you know, but in terms of like interpersonal connection, I mean, I look back on the people. I got super Twisted on I'm like, I can't tell you one thing about their personality. They certainly weren't funny. I don't remember them being smart or just, you know, interesting diverse quirky.", " Even even weird is better than flat but I was like they have to like me why girl why it comes back to that core of self-esteem that I always talk about and being okay being single because if we're going to let someone in our life and waste our precious energy and time and are good boob years and are full face of college in years. They got to be bringing something to the table. So go into it with that attitude. You're here to impress me.", " This next question comes from Olivia and she's dealing with something that you guys ask me about all the time. But she's seeing it from a different angle, which is really interesting. So she's like, okay, so I hooked up with this guy Fernando back in 2017, and I'm like, you know, we were dating for a little while and then when we were on a break he hooked up with this chick she was like 18 and just trash like she post all these slutty pictures and about Raves and like she's wearing nothing and like she's just she's got a ho Evite.", " But online right see what I'm talking about with what you post on Instagram and like I see the he still keeps in touch with her and then in 2018, we were like kind of back together but basically on and off and he's a douche and he's out of my life, but he's still lurking her Pages. He's typical common is like goddess like emoji with the heart eyes emoji with the heart eyes, and he's a douche like I know I know but it just always made me feel so insecure that he was giving this girl who was like trashy.", " She and trampy all of this attention that he never gave to me and like I have a good head on my shoulders. I'm smart. I have a good job. Like I'm an adult and I just I'm so irritated and I hate myself for being irritated that I care that he's giving attention to someone who just seems so lame.", " All right, so don't envy this girl for one her social media is a goddamn mess. I looked but the larger issue is that yeah, I hear from girls in this position all day all day every day. I got hooked up with like I hooked up with this guy. He creep my Instagram. He leaves flirty comments, but he doesn't actually pursue me or have feelings for me. That's because he views this girl as a possession a fuck toy a means to an end when he's horny or board and him leaving his little", " Hence, that's bread crumbing classic bread crumbing these tiny sporadic trickle of attention to Keep Her On the Hook to reminder that he's there. So when he's bored and wants to bang she's an easy layup, you know because it's not like, oh I haven't talked to you in two years. It's like no you have I've been leaving emojis. Remember what I said about if you can do it on the toilet, it's not a gesture. Yeah, and he doesn't do that with you simply because he knows it won't work fuck boys can sense a quality girl.", " They have a radar for weaknesses and low self-esteem which he has and they know that that kind of girl is going to be easy to manipulate and hook up with with the absolute bare minimum of effort toilet effort, but for someone like her that's kind of all she requires. She has set up that persona for herself. She has made the bar that low. So that's who she's going to attract low bar. Men you require more and for that reason he doesn't even want to get involved because he doesn't have the capability.", " T to be the kind of person that you would allow in his in your life take it as a compliment.", " That's all for this week Challengers. Thanks for tuning in. And like I said, if you have a love question of your own that you need some help on find me on the instant Go app and click chat to get connected right away. Also find me on YouTube Shaolin Lester click like And subscribe for new videos every Friday in a bunch in between and be sure to follow me on Instagram Snapchat and Twitter at Shaolin EXO. Stay Savage.", " The podcast you just heard was made using anchor ever thought about making your own podcast. Anchor makes it really easy for anyone to get started. It's a One-Stop shop for recording posting and distributing podcasts. Best of all, it's a hundred percent free sign up now at anchor dot f m / new that's anchored FMC new to get started."]}