{"showID": "00eo6cCvQbPvesSzZ18Vnm", "show_name": "Back To The Theater", "show_description": "Movie reviews on newly released movies!  Instagram @backtothetheater  Have a movie suggestion or message and want to be featured? Send it over!   https://anchor.fm/gilbert-diaz6/message", "episode_name": "Throwback Thursday - Back To The Future", "episode_description": "When Doc Brown invents a time machine, Marty McFly travels back to the past. However can he return to the present before it’s too late? ", "duration": 26.27338333333333, "transcript": ["Good afternoon, everybody and welcome to the first episode of throwback Thursday. This is a new segment on my podcast where we kind of go back in time for a little bit and we talked about old movies whether it's in the 20s the 30s were talking King Kong. We're talking The Good the Bad and the Ugly doesn't matter where it's from. It's like I said before I take many submissions.", " It's daily and I like to talk about these movies possibly every Thursday if I could and after careful consideration, there were a lot of great movies that you guys submitted first and foremost. Thank you. And there was this one submission that stood out and I figured you know, it was a it was a clever choice because a lot of people do ask for example. Hey, where do you get that name from?", " And I figured it's only best that I talked about 1985's Back to the Future which was recommended by none other than muscle Bob buff pants himself. I'm over here with a host for today. And that is Tristan wall oven. So for starters. I met Tristan about two years ago. I was roughly about two years ago, and he was pledging for Sigma Pi for most of you guys that don't know me too. Well. Yes, I was a frat boy, but now retired", " so now I like to play golf and walk on the beach all by myself in my free time. So without further Ado before we go into this review, I'd like to introduce muscle Bob himself and that's just in wall oven. So Tristan, go ahead and do your thing man. How are you doing today? I'm doing good Gilbert. Thank you for having me on your on your coveted podcast. I was very very very excited when you invited me to come on here and talk about Back to the Future which is", " You know a classic it's a one of those one of those Timeless movies where you know, regardless of what age group sees it or regardless of when you see it in terms of your own life, whether it be child teenager adulthood. It kind of just transcends through that and it's it's just a comedy for the ages. Literally, you know Back to the Future. So again, thank you for having me on here. No problem and and", " tell us a little bit about yourself. What's your what's your background? How did you get the name of muscle ball? So I came here after two years of playing college football and I decided I was a was time for me to give up the sport which is hard and but it really kind of built the foundation of of of my mindset and drive to sort of to train and to be be stronger.", " Just kind of improve on pain myself. So when I came here to Cal State Fullerton, the one thing that was missing from leaving football. And then the one thing that training was lacking by myself was a Brotherhood. So I joined Sigma Pi and I don't mean to brag or anything but I mean like it was it was a one of the best choices that could have made and from Sigma.", " II got got these these nicknames muscle buff pants all these all these all these crazy nicknames and so I just kind of stuck to my training entered and then dropped a couple bodybuilding competitions because they were sort of drop in my grades a little bit. But now, you know, I'm still training but now I'm focused on the bigger picture, which is a want to be being attorney. So I'm going to be going to law school next year and I'm going to take a", " What clerk office job and the coming months? So, you know got that in the works that was beautiful. So ladies and gentlemen, that is mr. Muscle Bob of pants himself. If you guys ever need to get out of a speeding ticket do not blow the cup you want to call Tristan wall oven and we will definitely take care of that. Alrighty now before we get into this review, what's what's one little fun fact that you wouldn't like our fellow listeners to know about you. It could be anything it could be.", " Be like me. For example, I've broken my arm twice in the same place. It was my left radius and it was within the two-year span and you know that second time that I broke it. I definitely knew that it was broken unfortunately, but I'm here now, you know, I'm still thriving I'm still with my left hand, but what's one thing that you would like the audience to know about you one interesting thing. I'm trying to think about a really good fun fact here.", " Something that not a lot of people I guess would really know.", " I mean if I if I could bring it up back to you. You said you broke your arm should for three times twice twice twice. Okay, still shit ton of times. Um, I've I've broken every finger in my right hand because I was a center when I played football for Oak in my nose three times. Let's see.", " I've broken my back trying to PR on cleaning power cleaning for those who don't know that there's Olympic lifts. But yeah, I'm sure there's another interesting fact, that's a escaping me now because I'm in I'm in front of Gilbert right now. And so I just had to bring it back and you know compared to compared the scars. I guess, you know sounds good with me. All righty, ladies and gentlemen, we're gonna get into this review really quick. And first I'm going to list down some positives. I", " Add with Back to the Future. So for those of you that don't know Back to the Future is directed by Robert zemeckis. He did direct Forrest Gump as well and welcome to Morrow and I believe and it stars Michael J Fox as Marty McFly and the way that it goes is Marty McFly's just the guy in high school just like we all were at some point and he's best friends with Doc Brown and one day Doc Brown creates this beautiful invention. That's taken up most of his.", " Life and his life savings and it's it's a time machine. It's a time machine where if you wanted to go back to the Great Depression, I mean, I don't know why you would but just saying if you wanted to you could definitely go back to that and witness that stock market crash or if you wanted to see Neil Armstrong land on the moon. You could definitely do that to two opposite ends. And it's it's in a DeLorean to it's not just in a refrigerator or whatever. It's in it's with style. It's", " The DeLorean and together him in Doc embark on this journey where he does go back in time. But like time goes you gotta go back to your set reality otherwise consequences start to happen and it's just all about the Race Against Time while also visiting familiar faces on Long the way. So this movie came out about 30 34 years ago. I might be mistaken maybe more", " But to be honest, I barely saw this film for the first time. I believe it was junior year of high school and it was in my physics class. I remember thinking okay, like I've heard a lot about Back to the Future, but I've never really delved into it. Like what's the hype about so thank you to George piroshki by the way for for showing us this great movie because to be honest that viewing was amazing. I think the story is very", " Very creative but also has a lot of heart and it's very funny. I love the chemistry between Doc Brown and Marty McFly. They have this kind of father-son relationship or kind of like that. Cool Uncle like you have at the family Barbecue and the way that doc has all these inventions you could already tell just from the first five minutes alone that this man may be a lunatic but let me tell you he is the smartest being and", " Seen Marty McFly go through this journey. And yeah, we're going to talk some spoilers here because like I said, this movie has been out for about 30 something years these throwbackthursday segments are going to be a little bit more spoiler filled because these are older movies that people should have seen by now, but if you don't want any spoilers, I'd say skip ahead to about maybe a couple minutes from now, but Marty McFly has to travel back to the present because otherwise his family", " in the present will be vanished. And the reason why that will happen is because when he does go back in time, he meets his dad he admits he meets his mom, but then his mom starts having the feels for him. It just gets kind of messy. There's no I mean nothing bad happens thankfully, but that provides most of the comedy there and just seeing how I mean think about it. How how would you react to seeing your parents back in?", " The 80s or the the 50s or you know, whenever they were born. It's insane and you wonder how that connection would be. Obviously you can't tell them or else they'll have a funny feeling and that affects not only your future but their future so seeing that Dynamic was great. And also I really like the set pieces in here. It's very simplistic Steven Spielberg did no no. No, I'm sorry. Robert zemeckis did use part of Steven Spielberg.", " six sets from a universal so that little town area that you see in the beginning that's from Gremlins and definitely other Spielberg films, but it's all some kind of revisiting this movie too because of the historical impact its had, you know, 1.2 gigawatts and 88 miles per hour and it's amazing in every sort of way possible why it's definitely my favorite 80s movie of all time and that's a statement because the 80s", " Not only had the best music in my opinion, but they also had some of the best movies in that era. Now. Those are just my quick thoughts, but I'm going to turn it over to Tristan really quick and he's just gonna talk about you know, what are some things that he likes and also maybe if it's had an impact has definitely movies out there that have had an impact on people for example, this channel is directly inspired by this film. So I'm going to turn it over to uterus to know what do you like more about this?", " Movie and if you have any negatives to towards the end, you know, I'd love to hear those as well. So I guess I should start with the first time. I saw a Back to the Future. Um, I it's I it's funny I distinctly remember the first time I washed it but I don't remember the details the movie. So I was in my friends mom's minivan. We were going out to eat.", " Not to dinner out Newport and we live in Mission Viejo. So they was the the Mini Van de that OG minivan with the the movie screens on the back and they were playing Back to the Future and you know, obviously they've been watching it for a while because I just jumped right in the middle of and I'm like what the hell is going on here. I must have been maybe 9 10 maybe 11 years old and I was watching and I was just kind of drawn in by by the acting and I wouldn't really like culminate in terms of my", " any of the movie in my my thoughts on it until much much later when I re-watched it at age 16, I believe and then again like it's like, you know every year. I just I guess I just kind of end up watching it and then I've seen it just last week. So it's really fresh in my fresh in my mind. If I got to say one thing to kind of like kind of build from like a smaller standpoint to like a bigger standpoint.", " You know you brought up the town. I was like used Steven Spielberg's used to use it a few times. I got to say, you know, the town is probably one of the best parts of that movie. It just it's it's own little world, you know, like aside from the the scene where Marty first uses the DeLorean the time machine and crashes through that that barn house and it's got the the alien all the alien shit on and and you know that dude shoots at him with a shotgun which by the way like if you look at where the", " Like that Marty should be dead. That's the little that was a little little nitpicky point. I'm like, oh, you know what he was right behind that. There's no fucking way. Um, so but outside of that little seen the town it like it had its own little life, even in the beginning when Marty was was skating by on the back of that truck. He's waving hide all these people in that Fitness class. He's going by the diner the the park the clock tower, of course and then like, you know right across from all those things.", " The school and like all these events that happen movie take place in this like in maybe like a two-mile radius like outside of again the barn scene so that town really is like a it kind of came alive like you were like, oh man, this is real the 80s. Oh man. This is really the 50s kind of thing. So that was really stand out aspect to me to me another really good aspect if you just start small as the acting come on like the the acting was so", " So outrageous and over the top and it was so very clearly like a movie, you know, and sometimes it's a bad thing. But in this case it was a it was a good thing. You know, you're like, okay, this is this is just something fun to watch like this is something fun to watch course Doc is like you said Gilbert. He's he's crazy while I was out there, but you can tell he's real smart kind of thing Marty's this this over the top, you know high school kid, who's who you don't really can't can't really tell if he's cool.", " If he's the you know, the stereotypical the cool kid ya the cool kid or the or the kind of like laid-back dude, or you know, you never really know because he's you don't really learn so much about how where he liked how we got to meet Doc and all this kind of stuff. So Marty's girlfriend who just doesn't really doesn't release is really do too much until they and the beginning and the very end and and then of course", " Marty's dad played by Crispin Glover who was who was hilarious the entire way through the the when he's eating peanut brittle watching these his little his laugh. His laugh is like man, it's Poindexter all the way. This dude is a fucking nerd like there's no there's no way like, how did he conceived this child? You know Marty's Mom Lorraine. She was obviously a pivotal character in the in the series.", " Um, not a series. Well, yeah in the series bend the the first movie, you know what that opening scene where he first meets his mom in the future not gonna lie. Oh, yeah Lea Thompson Lea Thompson played the rain. So but that opening scene Gilbert when when he woke up in the bed, and he thought he thought, you know, he was back and just had a crazy dream Calvin Calvin Calvin Klein. Oh my", " Oh God, you know it's funny. I didn't even get that fucking joke until like oh, it's underwear. I'm so fucking stupid people, you know, like people people put it on their underwear back then I don't why why I don't know. Why did they get lost often back then? 1985? Yes. I do not have a pair of Calvin's expensive. Yeah, they're pretty expensive. Honestly, just threw them we'll do it. Anyway anyway,", " Marty's Marty's mom. I remember first watching that when I was younger and like the way she behavior on Marty that like dude that that that sort of like next-level thirst kind of thing and I was watching that on his kid. I'm like, there's no fucking way girls act like this this cannot be fucking real that scene really like it set the tone and of course all the events that followed and you know, we're going to get into it, you know a little bit more.", " But this is just the the characters in the sets that really it just you know, it took the film to the next level as they shouldn't have film like that but just because how outrageous they were and how well the the actors performed I think was probably the best interest, you know, it's what keeps me coming back to watch it. So definitely the best thing there. Do you have any negatives with the film or is this just a film where no matter what time of day?", " You put it on you're attached to that couch, no matter what and you're watching it just from start to finish. How do you feel I feel like that again. The film is timeless and I've been I'm so I'm I know a lot of people are they say, they're into movies and Gilbert you're very clearly in the movies. But I'm I'm also very very into movies to the point where like the soundtrack was like, you know, pop out to me if it's real good arrival, which is one of my all-time favorite movies the soundtrack there was", " Was Unreal to me, but anyway the point being of so with that movie background. I kind of like I dug deep a little bit into it and there was a couple couple things. I was just kind of wondering like okay. I know they're not going to address it in the movie, but I'm gonna dress it in my in my head. I'm going to figure out why this is happening. So you remember a lot of things change when Marty gets back.", " From the past and goes back to the future and he he comes back in his life is infinitely improved, right? All right, you know", " but there's the scene when he comes back and he schedules right before he schedules right before he comes back. He's like, you know what I want to go back in time to warn because in the movie Doc refuses to know anything about the future so he goes back as I got my said it before so we pops up, you know in in that timeframe right before doc is killed. So Doc is killed in the beginning of the film spoiler. Sorry, I should have said that he's Kiya Hai if you haven't seen it, you know shits on you, but", " So in the very beginning he watches dot get blown away and then he watches himself almost get blown away and then a little I guess chase scene ensues how you know, he hops in the DeLorean and takes off and then he's he's back in the past again. So here's my question. How long has that been going on has this has the whole Back to the Future movie you take it as like an exclusive thing is Marty's life. Just one Eternal Loop is", " just always going to be a Marty because we're breaching some some existential shit right here. We're getting real deep into this Gilbert. We're gonna we're gonna figure out what makes this movie tick. I know they weren't going to answer in a little comedy. But Marty I mean is it is that just destined to happen forever? And also if Marty made it back to save Doc how come doc isn't with the prior knowledge or is this the first time this happened? You know, I got a lot of questions. I got a lot of questions and that's kind of one thing that stuck out with me.", " Because it's you know, it's just a feel-good movie and no one's in there. Like okay, but think about this what if it was a separate reality and it no one's in the movie theater, like think about this. They're just enjoying themselves, but I'm fucking thinking about it. So I'm coming here to tell you what the hell just happened. Well, you know you bring up a great Point actually and it kind of revert back to end game in a sense. I'll go where yeah, but that's a discussion for another day. Absolutely, but", " I can definitely see that but also I think this is one of those movies where you do have to use your imagination and I'm going to draw inspiration from 2009's Inception. Okay, so spoilers below for Inception if you haven't seen it, but again if I mean, what are you doing man director directed by Christopher Nolan? So Leonardo DiCaprio is a dream stealer, and I'm just going to go into this pretty quickly and he has to do a mission in order to see his family again.", " So at the very end after all this stuff goes down. They have this little object that the thief essentially has to distinguish. What's real and what's a dream Leonardo DiCaprio spins it while he sees his kids at the very end and that last shot is the totem and it's still spinning and then it just cuts so you're stuck wondering. Oh, is that a dream? Is it reality? So I", " I like to personally just use my imagination. I saw it kind of twist a little bit and I'd like to assume it is a dream and this is a little different though because it was confirmed later by Michael Keaton that ended up being reality, but I do understand that concern though because yeah, you do wonder you know McFly does see himself go back to the past essentially again. So you're stuck wondering is this just going to be a timely well, maybe not right?", " Or maybe it could go into a different time parallel. I mean time is inevitable and it's it's almost Infinity now to wrap this up. We're going to go with the rating and honestly, I'm going to give it a 9 out of 10. I I like Tristan said it's literally a Timeless classic my all-time favorite 80s movie confirmed, especially after seeing it last month at a screening at Park. I think it's one of the most iconic films.", " Yes, and yeah, you got honestly could never go wrong with Back to the Future. I mean, maybe the other two aren't as good they're still solid but not as good as the first however don't let distinguish the fact that this first one is an absolute Gem and you know real quick Tristan before we depart of what would you give this movie? Um, I'd have to give it I'd you know, your nine was good. I'd have to give it an 8 out of 10. The only reason I gave", " I'm giving it an 8 out of 10 is you know, I really like the are pretty much everything in this movie was I can't say it's perfect because that's completely subjective. But from my point of view is a everything was on point. No one seemed even though the acting is outrageous. No one seem fake don't seem fake now the set seemed fake either. They didn't seem like they were something that was like just kind of conceived in the backstage.", " Again, the only thing that I'd have to say based on that is not anything that's do with the movie itself in terms of like the making but like some of the concepts in it, you know, they get they'll get a little muddled in there. Like honestly the whole butterfly flat but it Butterfly Effect like how much does he does? Does he really change and how come how come everything that he's changed? His only given him a like a good outcome like, you know, I know it's just like feel-good movie. I understand that completely. So these are", " Obviously very nitpicky, but other than that fantastic movie if you haven't seen it, I recommend going to see it tonight if you could and I definitely agree remember guys, you guys have your own opinion my good friend Tristan here just because he says some negatives or nitpicks that doesn't distinguish the fact that I like the movie. You just got to have an open mind that other people for other people some things just might not fit well and guys, this is just", " Like a little bit of advice to for not only this podcast but you know take take my opinions with the grain of salt too. So just because let's say I like a movie maybe you might not just because I didn't like the movie doesn't mean you may not that's why I try not to look at Rotten Tomatoes or any sort of critic scores prior to seen any movies because I do want to develop my own opinion as an honest truth to you guys. Otherwise this defeats the purpose of speaking my mind and being my own.", " Critic, but yeah, we're going to wrap this up sewed up. I just want to thank Tristan again for coming on board with me and you know, thank you for making time today. Thank you. Absolutely. This was this is awesome. I hope to be on the show again and his great time. Oh, you will be we do have some recommendations that we do want to get into later. Yes. Yes, but no no, no, I can't sing. Okay. All right. All right. Okay, but yeah guys a thank you for tuning in to the first episode of throwback Thursday. This will be a every other week or", " or possibly every week basis depending on the submissions that we get and I'm looking to hopefully launched another episode in two weeks, but you guys will not know the movie up until that Monday of the week is just to build up the anticipation and yeah, just thank you. Thank you again for tuning in to another episode of back to the theater reviews. Don't forget to follow us on Spotify Instagram and now Apple podcast. This is me signing off."]}