{"showID": "00gQxUFKCvFhYQfZNFofo6", "show_name": "Adulting With Friends ", "show_description": "Orla McConnon aka @TheOrlacle brings you weekly chats with her best friends in a quest to understand why adulting is just so hard.   Looking to the past for answers, Orla and her guests reflect on who they were at 17 and where they thought life would take them. The result? A side splitting podcast that proves definitively that life is what you make of it.  ", "episode_name": "Adulting with Simone Gannon", "episode_description": "Simone aka @simonescribes is a self proclaimed makeup, skincare and wine enthusiast. This week she and Orla chat about passions, careers and travel.   ", "duration": 75.2268, "transcript": ["Hi, I'm Morten Makonnen and you're listening to adulting with friends. So over the course of this podcast. I'm going to be talking to some of my best friends and some of our Islands biggest influencers and I'll be asking them who they were when they were 17 who they are now and why adulting is just so harsh today. I am here with one of my favorite instagrammers ever. She's my go-to when I need to be told. Yes. It's okay to buy any makeup at all.", "It's Simone scribe. Yay. Thanks for having me. Thanks for coming. It's exciting 12 o'clock. We're drinking Rosie very young brother living the dream. So we're going to talk about adulting. Yeah, you've lived in know the place I have so I'm so interested to hear your thoughts your favorite places here. You're finding living at home again. Yeah, let's not really home, Ireland. Yeah, not home.", "Yeah, so, okay. Tell everyone what you do know and like a bit of babe you okay? I'm from Galway originally and but I've been living in Dublin for the last two years before that. I lived overseas for 10 years with my husband and my son and we've obviously just come back in the last two years. So we lived in the Middle East for seven years and we lived in Southeast Asia in Singapore for two years before that and for that we were in England, so it's", " been a bit of a I don't know. It's been a bit of a shock coming home because it's not really home because we're in Dublin and neither of us are from Dublin. So but we're two years in now, so we're getting settled. It's starting to even out a little bit for us. So work-wise. I used to be a makeup artist many many many moons ago, and that's what got me into the beauty industry. And and that's where that all be gone. I started a Blog that's it's still alive, but I have enough time.", " Started a Blog I think it's eight years old and I are not eight or nine years old. Yeah, so I did that. I worked as a session makeup artist in Singapore and then a little bit of the Middle East and then I went into writing Beauty writing at first freelance and then I just went and house. I was working for Gracia and then I decided I want to stay in publishing long term. So I stayed in that for a few years and then we moved within the Middle East and I ended up working for timeout and I worked for them for a couple of years and at that point.", " Digital was really starting to pick up in the Middle East is a little bit behind compared to here but it was something I was really into and obviously I'd had the blog for years and I had friends who worked in digital and so an opportunity came up for me to go out on my own and start doing you know copy for website social media management photography and all that kind of stuff. And so that's what happened. I went into that and I've been working for myself and I'll for I would say five years almost what your main lead.", " Not in the Middle East still or do you do you do that in Ireland? Yeah, I do it in Ireland as well. It depends on the project or if it's a rolling thing or if it's a one-off project. I would work for some people sort of on a rolling basis and then others I might do one month for them or three months or or even just content so I might be approached by a brand who would say we need 30 images of this product or they might want images and copy to go with us or just", " Depends it's really varied. Right? Yeah, so when you were doing the writing you didn't do journalism though. Did you know I didn't know my degrees in Psychology. So yeah, so it's a lot of obviously there was a lot of writing psychology like, oh my God, all I did was write essays. But yeah, I don't know. I think it's kind of it's in our family like my brother is a journalist. My grandmother was a writer so there is a lot of that. I don't know. I just kind of fell into", " I've always thanks. Thanks, you know, it was funny. I was showing a post that I did to my mum ages go on Instagram and she says to me. Yeah, you're always very dramatic, you know, and I know and she's like no no even a traumatic writers that I remember when I was in like 5th class or six class. We had to write some essays about something and it was the most dramatic like I was creeping down a hallway and suddenly in the distance. I heard a door creaking and all this like, it's just pure drama, you know, so yeah. I don't know it's always been", " In our family. So this does a lot of writers on my mom sites. Okay. Did you consider doing journalism? No, not really. No it just kind of yeah, it was it was what I wanted to do for a while. I thought I was going to be a counselor. I thought I'd be great at that. I think I'd be too like, you know, like if it was relationship counseling I'd be like he didn't do that yet. I just don't think I would she like I'm really into human behavior and why we do what we do and", " I think that's why I thought I would like to do it. But I think ultimately I don't think I have it's a very Niche skill set to be a counselor to be with her. But I just don't think that I have it and really have to divide yourself away. And yeah, so but I always enjoyed the writing and then just because I was in the beauty industry. It kind of just merged into doing a little bit of writing and then more and then more and then mainstream and then yeah and that's what happened. Okay? Okay, so I'm gonna ask you a few questions about your", " Seventeen-year-old cell go ahead. Okay, so you're gonna answer these. Okay a seventeen-year-old Simone. Okay, first one easy fish. What's your favorite makeup product? You know, I don't know. I think I know when I was 17, there was a lot of rumor. I think there was a lot of room and products but also I have really clear memories of using a lot of meself Rich makeup, you know, the stackable Parts. Yes. Yeah. I used a lot of those.", " I'd like a metallic like duck egg blue eyeshadow. I still love that. Yeah, so they were my main I don't think we even had highlighters then it was just eyeshadows and it was all cream. It's all cream. Yes. I used a lot of those and I used a lot of room. Oh, I'm pretty sure as well. There was a Max Factor pan stick in there. I think we all use those some point, but just you know, heavy and a lot like Bryce that was my main makeup by back then so did you wear makeup from like", " Ikuo, yeah like to it was fine. Yeah, I don't know. I think I just broke my parents down. Eventually. They were like just let her off. You know, I remember being in the bathrooms and secondary school before we get the bus home just slathering it on my friend and she a blonde a the ways to be in the bathroom together putting it on our Miss Selfridge docking pots. And I don't know it's just I've always been into it. I yeah, I watched my grandmother and her makeup and my godmothers a makeup artist and so I was always around makeup from a very young age and it just", " I had this babysitter. I remember when I was really young Jillian and when my parents used to go out I'd be like did you bring your makeup bag? And she said yeah and she's to do my makeup for me. I'm assuming like 11 or 12 or 11 or think or even younger. Oh my God. I still look in the mirror and be like I thought I looked about 20 so great, you know and then we take it off for my parents came home. And yeah, I just I don't know. I've always been really into it not I don't think I was very good for a long time. But the passion was there and what you can into skincare. Yeah, it was a little", " a bit but not out of kind of passion. It was more out of necessity. Like like I said, my godmother was in the industry and she was actually the first person to give me skincare. She gave me the clinic, you know, the three style. Yeah. Yeah and I use that and she's always say to me like you need to look after your skin and and my mom and my grandmother always used ponds cold cream. And so I kind of just did it. Like I always cleanse tone moisturize but I didn't really understand. Yeah just made us a new Sammi saw them do not and so I don't I think my skincare Obsession came in sort of", " Early early to mid-20s and when we were driving away, we're in Singapore and I just started get pigmentation and I was started panicking about the Sun and yeah, I cream and like, you know, all this kind of stuff and and I think that's when it really like I'd always use skincare was kind of sporadic like what was it? What was in what was new whatever. Yeah, but I started to really get into it and read about it and I'm just a little bit more than Indian. Yeah. Yeah. Yeah, I gotcha. Yeah. Yeah. Okay on a weekend. What time do you get up?", " When I was 17, I was living in Spain. I was actually working as a rep just gas at the time of my life getting someone into it. No. No, I used to work at the airport.", " Falcon at the time Falcon JWT and then they were bought by somebody else years later and I would and what the hell they are. But yeah, that's what I was doing. So at the time work days, I was up at like 5:00 or 6:00 a.m. Every day. And then we had one day off a week and I don't think I got up basically until nighttime, then we went out and pass it. So yeah very early and then very late on the Joseph. So unwrapping would you have been like the person getting people off the bus and then bringing them to their hotel and stuff? Yeah. We did a lot of those are ya so we had some airports you", " I swear we just worked in the airport. So we would like Greek flights bring them to whatever coach they were going to and then you might go back into the airport and do it again and do it again and do it again or else you might be the one that also gets on the coach with them and then bring them to the resort and oh my God, I had the best crack like it was just it was just really and I think about it now like I look back and I think I really as a seventeen-year-old like I was not I would never consider myself extroverted or", " And I definitely wasn't then but obviously like I had to put a balls going on buggered off with 17, like know anyone nobody and how did you even find out about the job? You just saw they did. Yeah, they did some advertising thing in Ireland and I kind of remember where I saw but I remember I had to go up for a big open day. It was Indulgence was a big thing, you know to go from garbage dump the day. Oh my God, I had to get like a new outfit. I think I wanted to Benetton and I got a new shirt. I was wearing a pink shirt or something, but we had to go off and there was a load of girls there.", " It was 20 or 30 of us and I was just kind of a summer thing. I just thought security fall and I was really bored of being a goal and I always wanted to go away. I was wanted to work overseas always wanted to travel would we've done a bit of traveling when I was a kid and both my parents would have done a good bit of traveling and so it was always kind of in me and I wanted to just you know do stuff do something fun. And so we went up for this big thing and I think they were only recruiting like eight people out of 30 or something. And so we had a group interview and then we had to do a presentation about like we do pick a country.", " Pick a city and do a presentation on that like the best things to see and do to do so, I picked Cyprus because we used to Holiday lot there when I was little and I remember doing that shaking all the way through but it was it was good. I enjoyed it and then we had a one-on-one interview and yeah ended up getting it. I remember I think my parents were like, yeah sure looked letter off to do whatever and then I got the job and they were like, what do you mean you're leaving? I was like, yeah, I'm going so yes, I went I always remember I vividly remember", " A landing the airport. I was Puttin me Orca first we were moved around like different parts of Spain but I was putting the Orca. I remember Landing two or three o'clock in the morning. I didn't speak a word of Spanish at the time. I didn't know anybody and there was only one person at the desk of the company I was working for because it was like the graveyard shift and she just said yeah, you have to go outside on whatever coach to get to the office and then you'll get brought to where you're living and what you're doing and I just want to go out and like trying to speak to this Spanish guy who's didn't couldn't understand what I was saying. I know he was saying", " I just thought my God, what am I doing? Like this was such a mistake and everything, but I got my way around it got there and then I mean over the course of the few years that I did it like I made some unbelievable friends and we're all still in touch now, which is amazing. Yeah, like every he's got married had kids and when I just think back like the absolute crack that we had there was an amazing for more than one Sunday. I did for a couple of summers ago. Did you go back them and go to college? I am no, I did my degree in my 20s. Oh, yeah, so I did all of it back.", " It's you know, my parents were like she's not very academic. I think she just wants to travel and I was like, yeah, so I went into that Gap. Yeah, I know but big gap here and then when I came back and I was working and I thought about going back to study but I didn't really want to stay in Ireland and then I met my husband and we got engaged and married and then we moved overseas and I thought you know, what now is the time if I'm not going to do it now my 20s and they're going to do it. Yeah, so I studied with the University of Derby and I did my degree took me 5 years.", " Was really hard. I think harder I had friends who like done degrees who were like commiserating and like supporting me by saying it's much harder to doing it on your own, you know, like your doom really great. Like I found it very difficult, but I did it and so that was it God. Yeah. And when did you meet a didn't Adrian Adrian and I actually met him when I was 16 stop. Yeah, we met when I was really young and go away. He was in university there and I was you know out on the town he was working in the nightclubs.", " The weekends like as a bouncer and that's how we mesh and then we kind of dated briefly and then I buggered off overseas are two that I was like bye and then we lost touch I didn't see him again. And then I just ended up back at home one. I carry what year it was was good for years later was like maybe five years after we met and I was in my mom's house trying and failing to get on to friends on MSN Messenger who are overseas because that's obviously was all the great. Yeah the time and he", " He added me I could remember I could remember him and and how long were you dating or Worse were like a few weeks. I know that. Yeah, and yeah, and so we got back in touch and that was it. Wow. Yeah. So what year did you get married? We got married in 2008. So we've been married 11 years. Now. Wow. Yeah. Yeah. I'm an owl one now and I'll a free dress up but from the minute you married you just left Ireland gone would actually left before we got married. We moved to England.", " And we were there I don't know something came off by think it was so yeah, something came up for him over there for work, and I thought let's go, you know, and we went and we kind of all intentions to stay there. Like we hadn't really thought about going anywhere else and then an opportunity came up in Singapore and we were in Leeds. I think that's where we're living in Yorkshire. We were there about 10 11 months maybe and this came off and we just thought that I guess yeah, so I think at the time it was about a year.", " Or 18 months certainly away from the massive recession that hit Ireland and everywhere else and we kind of just thought like if we don't go now you knew what was coming. Yeah, and so but it's one of those things we thought we go for two years and sure we were gone for ten. Yeah. And yeah, so yeah. So yeah, so you went to Singapore first then words you go then we went to Bahrain which is yeah tiny little island besides Audi. So we were there for two years absolutely love that like trying all my God absolutely loved it. Yeah.", " Just I just loved it. Like it was I don't know. I can't even like the the expat Community there is small but amazing. Everybody knows each other knows each other everyone would do anything for you because nobody has family. So all you have is each other. Yeah. I just loved the people. I'd like to buy her any friends. I love the culture. I loved I just loved everything about it. Like it was just brilliant. Yeah, we're there for two years absolutely loved it. And then we left there and we went to Dubai and so we were there for the last stretch before we are.", " Okay, and you go back to Dubai. I want you to also go anywhere. Yeah, would you live there for the rest of your life though? Probably not. Yeah. No, probably. I will you can't anyway, unless they to you too. But like no I probably wouldn't I would go back and I mean Charlie was born there and I have a lot of grass for a job. I really do but I probably wouldn't I wouldn't be alive thing. I don't think yeah, but yeah, I would go back I would go I would go I would go back to Singapore. I would go back to wearing like I would to know really where was your", " First out of all of them. Like I I think I liked them. All I think leads was very difficult for us because oh my God, we were so lonely. They're to know anybody we didn't know the city that well and I didn't know it was really hard time for us. We were planning the wedding and all that kind of stuff and it was just difficult and it was nothing exciting about it because obviously it's just like Ireland weather was like nothing exhausted.", " It's just hard and so like we've been back since like obviously we have family there and stuff and we've been back and it's a great City, but it's not one. I look back with like extreme fondness and think I looks great. We're at Singapore. I loved I absolutely loved I loved wearing and I love to buy it, especially because Charlie was born there. And yeah, so like I like them all I couldn't compare them. Yeah, they're all so different in their own way. Yeah, so,", " Yeah, I like them all to be answered in a perfect. Yeah, I was in Abu Dhabi but I think because I was crew I had a totally different experience. Yeah for sure Ian's like was I ever sober? Yeah, we still don't know why so memories I've been wanting for Facebook what I like I think because I didn't have like a proper routine or anything. So in my mind, I'm just like I don't know if I could ever live in the Middle East.", " Properly then I think when people do you have the right routines? I just absolutely love this. Yeah. I mean there is something about I think it's Irish people. We are like affected obviously on some other level by the weather. Yeah, the darkness the clouds the rain and so waking up. I mean this isn't specific to the Middle East obviously, but waking up in sunshine everyday. I just does something to your brain yet, you know, you just get off and you do stuff and you enjoy it you enjoy every part of your day and then you come home you go to bed and you", " Art it all over again the next day like there is something amazing for us having grown up in this climate living in that kind of climate. Then that's part of the reason I went to Spain when I was young as well because I just couldn't just wanted to get away and have a real summer. I mean, I remember flinging open the shutters in the house. I was living in when I was in Spain, which is thinking Jesus like it was just Blues Guys first. Yeah see amazing and I think that probably affected me when I was so young that I just I mean the weather here really upsets me. I'm just", " Ran this is nice. It's like doorman is a lot milder though. I have to say like always gets a trophy yet. But yeah, and did you find it hard working in the Middle East? Like did you find that it was different? Not really? No. I mean I was predominantly like I said in publishing and you know, I worked in a big office with a couple of hundred other people and everybody was Irish or Australian or American or English or wherever and it was just a big Melting Pot and everybody was in the same boat because we're all experts. Yeah.", " And what most of us are experts in those at some people who had well actually no, they were still experts but they've been born and raised in Middle Eastern never left yet. So they've grown up there but their parents were from different countries and whatever but no I didn't it was very normal. It's just very went to work every day did my job callme but like I said, I was in the sunshine and okay sometimes extreme uncomfortable. So I am I was still sorry we met when we were really odd. I just remember being like appreciate it. Appreciate this so cute. I'm gonna go like, oh my God.", " Your insights just little stuff and to me like it's crazy. I know it's on it's on it's great. Yeah Bush know I find it very normal very easy. It's a real. I mean, especially Dubai like they are, you know, very open-minded and open to international business and the infrastructure is just amazing for business. So no it was great. I had a great time there. Yeah. Yeah. I must go back but I think I'll need a while before I can feed get I think it's been like two years since I came back and I'm like, I need another two and then maybe", " I'll give it a go and see. Okay. This is an interesting one. Most expensive thing. You've bought. Okay, when I was 17 the most expensive thing. I bought it was probably my CD player to be honest really like I was really into my music. Yeah time and", " I had a cassette Walkman, you know, we all had those. Yeah, and then after a while I remember CDs came in and so then I bought a CD player that had little speakers and I used to bring it with me like when I traveled and stuff. So I think that was the most expensive like the fact that I remember buying it usually at that age isn't it to ya cause me a lot of money but at Hearst so yeah, I would say that's that was my most expensive thing. And what would you have been listening to? Oh God boys.", " Men, really got Boys to Men Snoop Dogg the Goo Goo Dolls. Oh God Limp Biscuit Boyz II Men thing actually was hilarious because at the time for some reason we couldn't get Boys to Men here or they didn't have certain albums or whatever. Anyways ranking on the ground. So", " Oh my god father lived in Los Angeles at the time and he used to get them for me and post them. Oh my God is to just make my own tooth do that. Yeah, we mustn't be together suppose that they maybe they weren't that big. I remember like Nsync and stuff. I'd be like, please Bruno and thank God they were big as well. I meant they came to Dublin. I think when I was in in six cars or fifth class or was it Backstreet Boys one of them. Anyways, I remember people were just losing it because they were coming to Jonathan's freaking out. But yeah, I know I had very eclectic.", " Music tell you so but I always had music on and so that's why I got the CD player, right? Yeah, which you've got two cakes and stuff. No, not really. No. It wasn't a real. I'm still not one of those really know even if like, I don't know even if one of my favorite artist or something like that, I just I'm not a gig person. I don't like concerts. Okay. I just have never been like that. And then I think when I once or twice I did like for example, I've been a huge life.", " Long fan of Busta Rhymes Like enormous. Okay worship. I don't know huge fun. And when we were in the Middle East I was working for time out. He was coming to Dubai for a gig and the night life and culture editor said to me. It's actually yeah, he said to me do you want to go and interview him because obviously you're you're the fan like no. No, I'm so excited. Yeah and", " Just a disaster like the P or was ringing me saying he's not up. He's asleep. He's something else. He was busy doing something else and then she couldn't get hold of him or something. And then I was supposed to go before the gig to interview them and then she rang me and said can you come after the gig and no later later on and I said, okay and I was just waiting and waiting and waiting and then eventually I went and I was waiting to just be let off because he was staying in the penthouse to do the interview and she said, I'm sorry. He just his manager said he's too tired. You just want to do it.", " And I thought my God. Okay. And so I thought well, you know this these things happen. Yeah, so I went to the gig we were in the club from like 11. I had my friend with me and he was supposed to be on stage at 12 the Club closes at 3:00. He came out of 20 past to onto the stage where and we were stood right in front of it was only small stage and it was just the worst gig it was awful. What's that saying? Like never meet your Idols or whatever? Yeah, it was he had a deejay.", " Who essentially carried the load of the concert on his shoulders he just did most of the work like pasta just kind of stood there paced up and down with his drinks and he kept like cursing and roaring. Like let's get fucked up and this kind of stuff but he didn't he didn't do much. That's what you've been doing all day and like half an hour and I just thought oh my God, this is the end devastated. I know so we left we left already. It was just not great and and they kind of ruined it for me. Yeah, and then I went with friends to see Drake he was in Dubai. Yeah, so", " same thing like it just wasn't that busy. I think they'd picked an auditorium or a stadium or whatever. That was too big. Anyway, right up here though. He is obviously massive. It was only I'd say 1/3 full and everybody around these big over there. Everybody went down like to the, you know, not the pattern, you know the bit that's not it's right in front of the stage. Yeah, and we because we're old women we stayed in the stands and youth are it was just just not great. Yeah like it just and you know, obviously the dawn of the internet we see people all the time on YouTuber concerts and", " With the trailers and then suddenly you're at a concert and you see him come out and he does the same things that you saw him doing YouTube and you're like, oh no and after that I just thought well, I'm not gonna do this anymore. Like I just don't enjoy I'm actually at Coachella. Okay sheís really was the worst person ever got yes. Yeah. It was just the worst sass right? So obviously, he's just not good life. Yeah. Yeah. Yeah. I don't know it was yeah, so I don't as a real now and the thing is in Joplin, obviously, there's loads of great Gates and all three are just come here, but I just would never", " I know just wouldn't I just it's not me. I just wouldn't go you know and the Todd of like oh my God queuing I'll stop after that. Okay. What is number one on your bucket list?", " When I was 17, I think I kind of had achieved it. I wanted to live overseas like I wanted to go and live away and I did that and when I was way I never really wanted to do anything else. Like I didn't really have a yearning to go home or yeah. I just wanted to live away and I did it and so that was my thing. I really like I feel like when I look back when I was 17, I really lived in the moment. You know what I mean? I think when were as we get older were cursed with like", " Progressing and like doing more and saving and what are we gonna do next and you're constantly thinking like ahead and planning because you have to you know, especially when you have kids and things like that, but when I was 17, I feel like I lived every day that day. Yeah, and I never thought about what I'm going to do. What are we to do, you know made no worries. You were just so now I've got all just so that my bucket list was to live away and I did do that what I'm seventeen's yeah.", " Let's go me achieved. Nothing. Great your prized possession. Was it the CD player? Oh God when I was 17 my prized possession. Let me think about that.", " Yeah, I probably like my seat either my CD player my CD Walkman. I'm just trying to think like what was in my room my makeup things like that? No, I didn't really I was probably just my CD walk when I didn't really we didn't have computers or anything then like I stole to an internet cafe to send emails even yeah. I like I didn't have the none of us had laptops like that worked that time. I think our bosses did obviously but it wasn't a thing like none of my friends had laptops or anything. So no, I think yeah, the biggest thing I used to track around with me was my CD Walkman and were you in the city?", " Or were you kind of well when I was 17, I was in Spain for most of us watch. No. I mean go away. I am from like six seven miles outside the city. Okay, push. Yeah. No, I was thinking when I was in Spain, that's a but even when I was in goal is the same as the CD Walkman. That's the thing. I used to slap around with me. Like I yeah, I mean I think about it like there was belts then that you could get to like poke your CD Walkman on it. Remember people in shop Street like with their CD Walkman.", " Isabel on their belt and I be like, wow that looks like every new model, you know, like I saw someone today wearing that though. I wouldn't even blink. I'd be like they work in Urban Outfitters. Yeah retro stuff, but that was the thing like it was you just had this enormous piece of gas like your CDs stop. Yeah. I remember one of my friends we used to go drinking in a field and it's called hole in the wall. So it's kind of all okay, I'm 15, and we'd all just be sitting there next thing. He just walked through.", " Huge field and you'd see the boom box before you feel my God like an enormous. There's like a weapon of - yeah, there's no need we've speakers. I know we have uh, this is totally unnecessary. Oh God the Boombox. I forgot about those. Yeah, you're such a thing. Yeah that used to it with date name and the house party and stuff as I was slowly whipped out. I mean there was no", " only until things are enormous. Can someone help me lift, like clubs and stuff in go away. Were you like into like nightlife for? I don't know. Yeah, like as a rule. I think that's just what you did you went. You know, we were all aflutter about which bars and clubs would be able to get into because we're underage we had some gas fake IDs back in the day like just I had like a German work permits that a friend of mine had given me because we", " Look the same and so her name was grandia. She was like here you can have it. I'm like thanks. Nice to be like Hi, here's my fake ID. Yeah, I'm girl. Yeah and always like a friend would let the cat out of the bag but like roaring I you in the queue like Simone you forgot your and I'm like sure. Yeah, but you still turn around and you're like, hey Ian. Yeah, but now we just did it. I think at that age like when I think back we had the best night out at that age because the majority of us were underage. Yeah, especially in Galway like there's some great bars and clubs and so", " If you've got in the beginning of the night, oh my God, you just knew it was going to be good night because sometimes you just wouldn't get in and then if you'd had success in the Brewers, of course you had to carry on. Yeah and the night always ended in the nightclub. There was no going home after the barriers when you were 16 17. Yeah, so we would always end up in whatever and I killed will take us and always on a real for a night out though. Yeah. Well, it was also good amazing ways to go to like three or four pubs and then we knew all the ones to go to to get the free stamp into the nightclub, you know.", " Get a free stamp in before 12. We didn't care. What was the one on the Square? It's definitely still there. There's a queue mope to the back of it then it's some bar. Oh God, the state has changed names so many times now there was there was the alley I don't know what that's called know. There was Cuba which is also changed names. There was like Boo radleys and CPS and was a big one. I don't know what it's called. Now. I've been there so many times but it was just one of those places they would let you yeah, I'm Ryan. Yeah didn't give a shit.", " They always knew you'd Rock off at like 10:00 to midnight when the camp was empty and they'd be like, oh here they are. You know you yeah, they knew you were underage or close enough to it anyway, but we didn't care. You know, like when you're older you like God, you know, we're not going to go wherever until later because there'll be no crack, you know, but when you're young you just don't care you go and you make your own crop, but first thing and not the other day there was the palace on Camden serese if you went before 11:oo Godfrey in like it was only a tenant, but we were so poor 10 or was enormous tool. So, you know now if someone said to me", " Oh, no my Des. Yeah be in town for half ten. Yeah, like I'll be getting out of the shower then like I won't be in town told half. Well, I know it's so funny, isn't it? You do. Well, I just broke ya want to trick you just drink at home and yeah or drink in somebody's house and then go out and but it's honestly the best time yeah, I don't think I ever I Rarity remember having a bad night then because we were just so delighted to be able to be served when we went to know. Yeah, that's funny when I went to Canada.", " I was 18 and I only went through like four days my friends were over there and the night before they were like, by the way, the drinking age is 19 here. Yeah for fuck's sake I didn't have any idea. My sister had given me one I'd lost it. So I was like, she's not gonna give me another so I rang my friend and she was like, I have a fake ID, it's fine. She's likely the only thing is is that you'll have to be Pakistani.", " You could make it. Let's give it a go. Oh my God. I know I looked up and the guy just looked at me and looked at the idea and he just laughed he was like, yeah God, I think he's just really voice of person like he was just like this is clearly not yell, but work to charge. I know the thank you f sharp.", " Yeah. Okay. What perfume do you wear? Okay. I know this one's super well because I wore the same over years. I wore YSL baby doll. It was in it was a motive is a little pink kind of not a bottle. It was one of those flasher. I can't even describe it just like a flasher shape round but last lap lower very if I remember very like vanilla musk, you know, that was a bit like Angel remember you", " Like that. So yeah, I used to wear that I was at I work for years. I used to buy it any time. I was in Judy free or like in Galway. They had the perfume shop think that was yeah that was all the rage for because he's fighting there. Yeah. So that was the perfume I were like religiously for years and stubble with any no loved it. Really. I absolutely loved it. It's my signature scent. Yeah. I just really like that. I'm only gonna wear that I know such Notions.", " Yeah, yeah. That was my that was my favorite one. I wouldn't fear away from my side baby Jonah Greeley and I sense your thing. Like would she be reading into greetings sir? No, I mean I'm still very set in my way even know and I would I have a few different ones but I always have one always the same one because I just love it. I yeah for years. I was kind of the same then like I would probably try or you know, when you're younger is why people would always get you perfume presents when you're young examine teen 18 and I would probably use them but I would always go back to Baby John. Yeah, it's just one of those.", " Like to add to this doll Maker's I don't know. Actually, I actually don't know if they do. I certainly haven't seen it for a long time. But maybe you can still buy it online. I don't know. Yeah, there's one. What is it? There is a website where you can get like discontinued. Perfect. Okay, right and like I mean, yeah 15 Euro Earth my God, you get them so cheap but they were so expensive as well as especially because we were so young like it was you know, but yeah if I bought the rearview mirror, but even now what kind of kills me to buy perfume because I'm like it is still awesome. Yeah. I try and only by the majority for you to be honest.", " Yes lie because I just couldn't justify wandering into like BT's and buying and it's overwhelming as well. It is yeah, I'm gonna have a look Ray. Yeah, I know. So yeah, I think it's easier to cope with when you know, you want a specific one. You might didn't buy it and leave whereas if you start browsing your like everything's a hundred quid.", " What is your biggest worry?", " My biggest worry when I was 17.", " Oh my God.", " I don't know.", " I don't know what my biggest worry. I don't think I had any I don't think I was very chilled and children were here at college or anything like that. No, no because I'd suck that off. I was not going, you know, Dad you just decided traveling? That's it. That's it. I'm just gonna go away and and my mom was very supportive. I remember she was like look universities and for everyone if you want to work that you can work. Yeah, like she I think my mom's very like me her her parents made her go to university so she went but she didn't she never wanted you to", " I wanted to work so I knew I was kind of like my mom like that and so she was like look if you want to go travel and then come back and get a job and do what you want to do then great. And so I think that if that hadn't happened, yeah, maybe I would have had other worries. I would have been more insecure like what I'm going to do my life and yeah, but no I didn't I was very my mom was great. Like she just said if this what you want to do and I knew when I went away", " That she was upset that I've gone and she must be nothing but she would never show it. Yeah, I wanted to support me. She wanted me to do what I do when I think want to stop you from know and I think about that now like as a Mom myself now, I don't know how she did it. You know. I just want to hold my child to me forever never leave home, but she was great. She was like you have to do what you want to do and figure out who you are. And and so I think around that time I was generally pretty Carefree. I didn't have no worries because I was doing what I wanted to do. Did you think you were really grown up and", " Why? Yeah, I think I was quite independent. Anyway, I'm yeah pretty independent and going away. Like I said, it was a bit nerve-racking but it wasn't enormous stretch for me. I just really wanted to do it. And so I don't know. I just it's just mad when I think about it like how headstrong I was then yes because I didn't have a lot of worries. We don't anyways, most of us, you know, when we're if we're lucky like at that age. You don't really they're not real worried now.", " No things that are never, you know, you live in your mind. It's just it's you know, I'm really glad like that. I lived my best life then I guess I'm to one of my friends but that she actually lives in Kuwait now, but we work together overseas. Okay when we were young and we were talking about it and I was saying God, I'm so glad we live the lives we did then because that's what it's all about because then you get older and then you've got the responsibilities and then the worries and everything coming up that's life. And so", " I'm really glad we had that life because I know some people don't and they do have worries that age and you know, obviously then they grow up and it gets worse. And yeah, so I'm glad that we had no cares completely heedless more like, but anyway, were you ever like were you sensible but money? Yeah, I would I would say like 95% of the time I was sensible. I remember one time I had to call my parents and ask them for money because I'd run out and they were just appalled and all I wanted was something like 50 euros until it was a couple of days.", " Or payday, you know and I just remember like I was so wounded by how disappointed they were. I swore I was like it's never gonna happen again and didn't after that. Oh my God. I wish I was pretty good. Right? I was just really focused on like this is my money for food that he be alive. And then this large portion is for my alcohol. That was my budgeting, you know? Yeah, and then this little bit as for Miss Selfridge and like buying my few bits or wasn't boots. What was it? There was a big chemists we used to go into", " In Galway camera, it was boosted by my bits in there and it's not as pretty good when the last I was pretty good. So I was woefully by the way I've set up a nightmare.", " Working underneath break and she was like a grounds but looking back it was because I'd started drinking. I was like, they're giving me I was only working four hours on a Sunday. That was it looking back. It was just because I was like, I'm too hungover. Yeah, sounds like so bad. Yeah, and then she just did for me out money. Yeah poor thing. I know I'm going to be a dick at home. I'm going to be like I fuckin know the sauce here. I know you're well then I know yeah.", " Yeah, I'm so bad. But anyway, I've kind of learned kinda not can I have that Vault? Where will you be in 10 years? I think when I was that age, I thought", " I thought I would be living away. I thought I would be living overseas. I would be somewhere I would not be in Galway. I would not probably even be in Ireland. I would be away somewhere not not knowing specifically what I would be doing, but I just always had a feeling that I would be living overseas doing something because I just never I do know I never wanted to stay in Galway. Yeah, you know, I just I always remember when we're doing our leaving cert. I just couldn't wait to get out. I just couldn't wait to go.", " All somewhere. Yeah and was Dublin ever not ready? No not running. I just wanted to go away area something else. I wanted to travel and just why did I just wanted to like do something new and cool. And so I think yeah, it's 17. I think if you'd said to me we're going to be 10 years, I would say overseas. Yeah, I no idea where or what I'd be doing but away Adrian always want to go overseas as well or was it just a work thing? Yeah. He led you to he had lived overseas himself on and off when", " We'd met and even when he was a teenager like he'd worked away a few Summers and I think anyway, like most people I know at home. We you know, it's kind of enough. So I think it's Irish people like we all do stuff. We all travel we all have people who've gone to Australia or Canada and states or family who have emigrated or whatever, but I know it's kind of the done thing now, it's very you have to take the year at some point. Yeah. I'm not sure when you do it, but but yeah, he suppose we're quite like minded like that. So he liked traveling and doing new.", " - so did I and so just kind of wasn't a big thing when something came off and we started to live away. It was like yeah cool. Let's do it. Whereas obviously like I remember telling my mom we're moving to Singapore and she was like, where's that I know but where it's gonna take me 24 hours in a flight and I'm like no, it's only 12. Yeah. Did she go? Yeah. She did she come out a few times. Yeah, but it you know people at home and they say just the shock of a yeti mean why but it's nice when you move away because then your parents actually go then", " Because of visits things and yeah, you know and yeah, it was great like oh God excitement when somebody was coming to visit as well. I was just oh my God. Yeah, we'd be there like none of us could come. Yeah Darby and we'd all be like, right. We'll have a roast. Let's show that we're actually doing okay everybody wash. Did you not find it hard though? I haven't Charlie on your own with just the tube. Like I know you had friends and everything. Yeah, but like being in a different.", " Country without scare me so more. Yeah it let mean I know on paper it was very hard. But I think when you're in a like we certainly didn't have time to think. Oh my God poor us. I can't believe this is happening to us. I can't believe we're here and we've no family and we just got on with it. I can certainly wasn't what I had envisaged. I had. I mean we were supposed to not be in Dubai in the first place just work and different things have changed. We ended up going to divide the last minute. I was supposed to", " To have Charlie in Bahrain. I had my guy knee and the hospital and I my mom was supposed to fly out the week or two weeks before he was born and it just all went wrong. Like we ended up in a different place different hospital. My mom broke her foot a few days before she was due to fly out. She could come out and so this like series is chain of events occurred in the home. So you must have been like, yeah, we just yeah, but it was weird because I mean you really do just go into this.", " You know, it's fight or flight like you just go into survival mode. Like this is what it is. I was very aware of, you know, the impact of stress on babies and this kind of stuff and so I was very calm and we just got on with it and we had him and I had him in the hospital by it was just the two of us and my husband had to go back to work like straight away. Like there was no he just started his job. And and so we were just alone and you know, but but the thing is when I say these things like I don't", " I don't know having a baby any other way. Yeah, you don't know what a difference that's just yeah. I know I can talk to people or read in a magazine or whatever about people having their kids with their family around this and I think I was not nice, but I have no experience of that. So, I don't know. I don't have I don't have any other you don't have regret or jealousy or Castle just like because I don't visit it is what it is. That's what happened. You know, we did our best I think obviously when things like that happen to people there's a lot of benefits in that you become very", " You know tough and you're able to do whatever and you just get on with it and obviously there's a lot of downsides as well. But like I don't know I think we just we were brilliant when I get back like we just flew through it and we did what we had to do and I remember like when my mom came out, I think the first time she met Charlie he was six months. I think the first time she could find I remember she was very upset because my best friend had been out before her to see awesome and you know, just the way it was and I remember any show my best friend saying to me like your poor mom. She's so upset. She brought over stuff for me for my mom.", " - I know but you're not this is life. Yeah, it's just it is what it is. You'll see him at six months. He's like no need to reach out and he didn't know it was fine. It was fine. And you weren't working that because you just moved over. Yeah. I'm sorry leave was Grand. I had gone we were living in Bahrain and I was working for grazia the time and I got a maternity leave like people do and I had planned to go back at whatever point and then we moved we", " We left we're hurrying and we ended up in Dubai and I thought my God like because nothing went to plan. Basically we weren't supposed to be where we were and nothing was turning out. Right? And so I had to go back to work. I think three and a half weeks after he was born or four weeks after he was born and that was hard. Just trying to do childcare and like in a city that we didn't really know like when we were in Bahrain we used to visit to buy but it was like for fun, you know, yeah, he would go over for a night out or to see friends or do something but almost yeah.", " Yeah ever. Yeah, it wasn't like normal life stuff. So yeah, I had to go back to work very early and that was kind of hard but in another way, you know again, we just got on with it. Like I never remember sitting and thinking this is so unfair. There's no other option than to do upstairs. Yeah, you know, I certainly never remember thinking like God. I wish we weren't here. I wish we were at home or I wish I had my mom or I wish you know, it just it just was what it was and we just got to stay strong. I would be in self-pity mode.", " Stopping people on the screen now, but the thing is you have a tiny baby. Yeah, and so you just really it sounds cliché, but you really don't have time. You just don't have time like he has to nap two or three times a day has to be fed needs to be changed and you're worried all the time about you know, is he sick as he would temperatures if you go here and there and you just don't have time. Yeah, you know you sleep when you can and you try and look after yourself and and that's it. I could just that just became normal. And so yeah. Yeah, but it's funny like I", " I suppose when I hear myself sometimes like I talked about this on a different podcast like a couple of months ago and I remember to sit back and thinking kind of such a hard-ass like the way I was saying it like it was fine. You know, of course there was times where I was upset and things like that, but we just didn't have any other. Yeah way to go about I suppose it was like the long time ago Naomi that it you kind of, you know, yeah, it does feel I mean I do remember obviously, I remember everything very clearly, but it's not something that", " You look back differently now. Yeah, it just it's just one of those just a stage of our life that we went through and then that was it. Yeah. Yeah. Yeah. Yeah, Jesus no smell into the deep strawberry you ever think you're like your mom Jeffrey like do stuff in your like? Oh jeez. Oh, yeah all the time really all the time. Yeah. I love it though. If I ever do things I'm gonna call that so my God's Not not hear myself say something or I'll do something, but see my mom like, you know, it's funny.", " Younger you're like I'm not gonna be like my parents was going to be my own person. Whatever. It's just crap. You just can't get away from it. It's your DNA guys. I mean it's you know, but the older I got the more I appreciate my mum and the way she you know just gets on with stuff, you know, like she's had some tough things happen to her as well and she just gets on with that. She's just a real she's a person that does very well in a crisis. It's just great for that. She's really she is there she is helping", " She is the person that you can ring off at any time of the day or night and say this has happened. Yeah, and she just is brilliant like that. That's just how I told her she's coming at Ya, so I think I have a little bit of that. Yeah, just in terms of what happened with us from your way and having charity and everything kind of learned that for my mom. I think it was probably in me, but I didn't know I had it or that I would have to utilize it. Yeah, but you do because you learned it from somebody else and so yeah as I've got older like I'll hear myself saying", " I think we're doing something and I think my God, that's exactly what my mother would have. Yeah, but now I like it. Yeah, I don't think I could ever I notice things I'm like, oh, that's actually I like that. Yeah, you know, yeah, she did a good job. Exactly. Yeah, exactly. Yeah go moms, but she loved you to go back to go away. Yeah, probably I mean, you know, we love God we both of us because you know, I grew up there Adrian spent a lot of time there and it's such a cool City. We've all got friends there. Obviously. My mom is there and my brother is there and Charlie loves going back and", " It's a lovely city. I would like to think at some point that I would live there again. Yeah, I don't know when that'll be maybe it never happened. I've no idea but I mean, yeah, she would love if we were back there. I would love it. I know I would love being back there. I don't know for how long but I don't think we've been away for so long. Now. They've everybody's just used to us not being, you know not being around or you know, yeah, we're moving here now or I Grange like ever next I think they've just got I think she'd be really surprised if I notice you're moving back.", " Yeah, we should be delighted but she would like no way it's a nice Retreat for now is yeah, it's like oh, I love it. Yeah, and especially in the summer. There's no place like going somewhere. It's magical the countryside in general. I know in this anywhere near I could be welcomed any time the sun is shining and I'm like, isn't this great gorgeous. We get a bit of sun Austin Tickler son starved here. That's the problem. Okay, so I'm going to ask you the same questions, but now answered. Oh great.", " Eight and got the time very juicy. So your favorite makeup product. Okay. I was thinking about this earlier so", " I would say now my favorite product being sensible like a Fail-Safe always have it not particularly glamorous, but something I would use every single day is my Bobbi Brown corrector my under eye corrector really I've used it for years. I would say over 10 years. Now. I never don't have a I always have us I bought it everywhere. We've been I just think it is incredible. Like if I only had one minute in the morning, I would slap that on and a bit of mascara.", " Because it's just fantastic and I can't be can't be duplicated. Still nothing. I've tried other ones. Yeah, I've tried the Charlotte Tilbury one, which is good. But still a bit oilier. Where's the Bobbi Brown was tiny bit dryer and I think that's kind of why you need so it will stay where it is, but I always found like even years and years and years and years ago when I was working as a makeup artist a lot of women that I would work with really didn't need concealer. They were using concealer because they were trying to cover blue veins under their eyes or a shadow in a corner. Yeah. Whereas a lot of the time if you", " Use a corrector that does the job for you. Yeah, I guess Jan Cedar is then kind of like I would use consider for kind of General brightening and stuff like that. I use consider every day, but the corrector is my failsafe free. Oh, yeah, I think they're phenomenal you have you tried the Becca under eye corrector know that's really nice, but I haven't used the the Bobbi Brown one. So, I don't know if this is pink, right? Yeah, the one I have kind of kind of pink salmon color. I don't know if you'd like it actually because it's a bit more oily early. Yeah, I", " Draw your one Leap. I said, I think it's made more to mix with the concealer. Okay, maybe yeah, I might give that one a go. Now there's obviously different shades concealer on me. There's a couple of different shades. And so there are all independently to correct different things. So if you have like blue tones or yellow tones or like purplish red tones, so there's a different one to counteract each tone. So I've always had like blue toned Shadows or blue tone veins under my eyes. So I have this", " Salmon colored it's called light to medium bisque and that just kind of cuts through it and then brilliant. It's just fantastic. That's my that's the product future. I really wasn't expecting that. Yeah, I know be very sensible here getting are getting all the cheese today. Okay on a weekend. What time do you get off bus and seven half six seven. I have a child, you know, this is still guys.", " Oh wait, I'm a mom. Yeah, exactly. That's my life now and I can't like even if I'm away for work or if I'm away in a friend's or would I my body will not show you sleep in no. So even on a normal day. Maybe we have seven I might sleep in until just yeah like normal days like weekdays I get up at 6:00 a.m. 6:00 6:30 a.m. And then weekends, you know Charities are alarm clock. So he gets up at 7:00 most of the times we would at the weekends we would get off at 7.", " Our Christmas is he like upper the crocodile? Yeah, he would be I don't know. He's a good sleeper. Like I mean, I know when I was little I couldn't sleep like when Santa was coming and stuff like that are saying this fuckin Charlie is I don't know. He's great like that. Like we tell him he's very excited, but I think he gets so excited. He just wrecks himself until he goes to sleep with her. So yeah, so I get up at 7:00. I used to change the clock and my mom's alarm clock.", " Okay, I changed it back in a hour and then I would hide it under her bed. Oh my God, you are evil. I had a bear. Oh my God, so my grandparents used to say in those ring the bell and I had a son like I was weird to be and I'd wring it in my grandparents years get up. I wish", " It was a rainy day remember that period of our lives and we were kids like she was nothing like the best day of your lawyer. I know I know. Okay. What is the most expensive thing? You've bought?", " The most expensive thing I bought okay. It's either a pair of shoes or handbag. I don't know. I'm just trying to remember how much each of them were. I think the most expensive thing I've ever bought it was an Alexander wine bag. It's the Rocco. So the bigger one with the studs on the bottom. I think it was I got it in. I got it from that report a a camera for those are saying or if I'd a discount call, but I certainly know I didn't pay full price for a blast.", " A couple of hundred Euro. Yeah, but I still have it. Obviously. I bought it like five years ago. Now I think and I still love us I still keep it in the dust bag. So it's yeah, it's really maintained itself. So yeah, I think that was the most expensive thing and would you be into splurging on one-off items? Are you more like I don't know. I think like I definitely have a few really nice pieces like a couple very nice bags and some nice shoes, but I'm", " I'm really about quality over quantity like I handbags for example, like I remember when mansoureh gavriel first came out a couple years ago. They were real kind of cool small brand and they had these amazing totes these giant like bucket type totes and a lot. I've always loved big tan leather bags that you can just throw all your shit into your laptop and everything and I wanted to get one and so I bought", " One because I knew it would be I just knew it would be good quality because it was real leather. Anyway. Yeah, and I can't have the time. It was like it was it wasn't it wasn't as expensive as they are now because I bought it way when they first came out like maybe three or four years ago now and it was a couple of hundred Euro the to 300 Euro Best Buy ever still have us. I wear it almost every day anytime. I have my laptop with me it goes in that. Yeah and the rest of the year or the other, you know throughout the rest of the time. I don't buy bags like I would never just go", " Browsing and looking at bags. It's always very kind of purposeful. So the man's her gavriel was probably my last big purchase. I remember I bought a clutch couple of years ago as well from there to Port A from Clare V. I don't know if you've heard. I'm sure she's amazing clutch bags and it's a leopard print fold over like a soft clutch. I got it in the sale. I remember it was reduced to like a hundred fifty Euro. Oh my God, that is the only color choices and I go out. Really? Yeah, so I'm really like the bags I think are great.", " Investment. So do I agree? They will always fixed your car chassis under it's real leather and everything. They will last forever especially if you you know, if you look after them as best you can like if you keep them in their dust box, you know, if you can they will last and they kind of look better I think as they get older yeah as well, you know, so I mind I'm always like I'll buy that Chanel because when I passed into my dad was an area that's a different mic.", " Have a like the last bag. I think I bought was.", " Two years ago. I wanted the monster gavriel the bucket bags. The mini ones a black one. I wanted a black cross over bag because I didn't have one and so I bought that and brown hummus and that's the other one that I would wear. If I'm not wearing the big man's bags. I word. Yes, and they wear really well different their bit different. Yeah. So yeah, I would be very kind of strategic. I would want a specific type of bag that I know I would use regularly and so I would buy a really good one.", " You because think about us. Yeah, and I would think about it and because there's no point like a normal or younger you'd buy bags here and there he buys from Topshop you but I'm here and then after a couple months you've been there you buy another one and then if you add it up the money we spent it would might as well hang on and bought because we didn't think like that. When were younger it just you know, but now I would never like I never just buy a bag. I just I'm happy with the ones I have and I think they're all you know doing a purpose right now. And so yeah. Okay, so that that was probably I think the most expensive one was the Alexander Wang on that I bought", " About five years ago and it's nice to say that you have one. Yeah, I'm nice to be mad spit out there like this rose gold studs at the bottom of it. Like it's a real kind of yeah, but that's kind of why I like him. It's kind of cool. Yakyaz for different and and I love it. It's a great big hunk of a bag like it's got a big cross body strap and but yeah, it was it was worth it. Yes worth it. Okay. Yeah. What's number one on your bucket list nail? Gosh, I can't believe I'm gonna say this, but it's", " Travel hold still yeah. Yeah. I really like lived away. We lived away for so long on the other side of the world. Yeah, but I really want to travel around this side. Okay, like I've never been Scandinavia. I really want to go I'd love something. I want to go to Sweden. I wanna go to Denmark want to go to Norway. I want to go. I want to go to Switzerland. I want to go to Iceland like there's so many places. I want to go that we never we've never been to like when we lived in the Middle East and Southeast Asia. We did enormous amount of traveling.", " Went to Australia we went to Thailand and we went Indonesia and Malaysia and we went all over the Middle East and it was fantastic and I loved it. But now that we're in Europe. I want to do more here. Yeah, so that's my and also the state's I would like to get to the states as well. Like I was there when I was a kid good few times, but I haven't been back in adulthood really know. Yeah, and I've never been to New York, which is like a crime. I all my experience in the States was on the west coast so we had family still.", " Some family living in Los Angeles. And so that's where I would have gone. Yeah, but I've never been to these coasts. I think I take it for granted because I'm there like is your crew. I see it as a like the airport code. Yeah this TV. I'm like, oh that didn't know. You know, my cousin actually is a pilot and he's on that roof. Yeah, he does that he's coast and like every time we don't like where were you this week? He's like glass in Chicago and then I was in New York and I'm gonna wear you. Mr. Yang. Like I can't even get over like a weekend but", " It's just planning and like getting organized and but yeah, that's that's my book at this now is to do more travel this side of the world States and you've anything booked or anything at the moment. Not really. We're always bit last minute like depends on you were very now stuck into the school calendar. Yeah and sort of when he's this and that midterm breaks and whatever so and then it depends on work and so you kind of have to wait till all those things Collide to go actually with three days here or yeah, and so and that's how we usually roll", " So and it's fine. It suits us. Yes. Yeah. Okay. Yeah. What is your prized possession? My prized possession is this ring so you can't see it because I'm on the podcast but I said, what a great meeting so delighted you fighting me on this. It's my grandmother's engagement ring that my mom gave me she was kind of threatening to give it to me for a few years and I was like, she's still like what?", " Like oh my God, but then she gave it to me like two years ago when we moved home. I think it was very symbolic. Right? She was like finally moved here is this ring? So yeah, that's my most prized possession. I wear it every day with my wedding ring. And so it's a real like family or a time. I think I think my grandfather bought it in like the 20s 1920. So it's really bought it in Dublin on O'Connell Street from a Jewelers. Yeah. Yeah. So there's a whole like history where it's at.", " Hence the fear Terror but yeah, that's my most prized possession. Oh, that's a lovely one it is. Yeah. Yeah. Yeah. Yeah. Would you ever give it to Charlie to like use us an engagement ring? Don't know. Yeah, probably if she was working like in a few years if I really like the idea like I wouldn't be very young.", " What's the word with stuff? You know what you wouldn't be very sentimental very no. I'm generally I wouldn't be sentimental with things, right? Okay, but I do feel like it is quite unusual or unique to have a family earlier proper one. So and like I remember my grandmother wearing it and everything. So it's real, you know, there's a bit of feeling that yeah, so, I don't know I will be barriers your faith radio.", " You are in a new well, so my favorite perfume for the last I'd say four or five years is why a cell does it? I mean, I can't believe this I'm very loyal to my celibacy is black opium. Oh, yeah, that is very nervous. I know they've brought out different versions of it since then. I don't like them. I like the original. So I always buy it and duty-free. I was actually in the Middle East when it launched. I actually went to the launch priority in the Middle East and I remember smelling it and thinking oh my God, it's like coffee.", " He and Licorice and it's the most amazing fragrance. Yes, and we get like kind of like flour bomb but more expensive and a bit heavier. But in a it's very unique on thickly. We're like in a nice way. Yeah, it does there was certainly at the time it came out Nothing Like Us. Yeah, and I just like we got one of the event and everything how this is lovely and I used it often. I thought I'll just buy another one and then whatever happened now or years later, I'm still yeah buying it and Judy free and I love it. Yeah, it's my failsafe. Absolutely. Love it all.", " I do have I got a bottle of the new why settle on the other day. Oh bleep. Yes do a leaf. I think it's the face of it and that is very nice. So I'm kind of at the moment now, I'm between the two of those both why yourself just mad and I think about it and I was 13 that I also work whites are they? Yeah, they do have lovely Dooms agree. Yeah, and their men's cologne is very nice twice. Yeah, I bet they do it. Well, they do the fragrance. Well, yeah. Okay your biggest worry now.", " My biggest worry now is probably the real adult worried but it's probably just Health. Yeah, you know that we are well and that Charlie is well and he continues to be well and we stay healthy to be around 2, which is really a company of I'm saying that because I'm in my mid-thirties. I know I'm still young and everything but it really is a thing. Yeah, you know, we think about just staying healthy and trying to look after ourselves and and Charlie being healthy and but that's probably my biggest worry is one of us.", " Sick, yeah, or something happening like that, you know, like know the morning like Charlie going to school. It's like a military operation. Like here's your orange juice. Have you had your vitamin? Here's your Weetabix? Like, it's Leisure you like Warner for the other, you know, the face cloth of we have our you actually have a cream that we put on for my dry skin. And like I think we drive mad to be honest like he's the steps yes to go to every morning, you know, but I'm like, I'm just keeping you healthy, you know? Yeah, but yeah that that would be my biggest worry is somebody becoming ill or something happening.", " Yeah, I think that's a natural. I think we all owe total - just got a new job and I was like is their health insurance? I know I can't afford to really that's that's what we do trying somebody gets sick and you don't have health insurance. You know, I don't know it's not even I don't know it's but it is that's what it's expensive though. So it is hard to see but it is worth it. Yeah, it is like we finally have us I'm like, I'm going to book in for a full am I looking up everything I was like this is gonna be it now for your full well", " We're going to find something. I know like convinced in your mind. But I think we do do that to ourselves when were older like you're in your thirties. We all get it now, everybody has twinges and pains and Rhonda makes the come up out of nowhere and you think and you go on Google which is not a good idea and you're basically basically it like", " fucks up your kidneys and they were like and your P will be the color of tar. So every time we got stored on fully thinking I've damaged my kidneys from so fuck you just get so paranoid, you know you do and then also I think you know, we know we're less Invincible now. Yeah, we do see now all the time women that we know are women that that we know to other people or they get sick. They can cancer that die certain things happen or you know, there's always now,", " You know GoFundMe is or trying to help certain people and it's you know, we are getting older like we've lost that invincibility we had when we were young of like gonna live forever, you know that the GoFundMe Tsar amazing other credible, but they're also everyday aware of answering the corner there. I mean, they really are the best thing ever. I mean, I really think they are fantastic way. Yeah for families to get help and a lot of the time I think as well. It's a communication tool. It's a way of letting people know this is what's happening to us, too.", " You can't tell everybody you know or people, you know would help you. You don't people don't have time. Yeah, and so these amazing people step up for people and their family and set these up and say we need help and I think they're fantastic, you know a little donation that you make or I make like 20 year old 50 Euro and then if thousand of us do that like it's not even at a exactly what I mean. So I really I really think they are amazing. That was my resolution this year once a month. Yeah, whenever I get someone like a friend sends me one or", " Ever I will always be could only happen because I just think 2% It's such a small amount in the grand scheme of things. You know, why not? I would hope that somebody would do it for me like that with me. So and that's always how I think about it like Torchwood nothing like that will ever happen to us. But if it did I would hope because all the times that I did I think that other people think I'll just do it. Yeah, you know because it's very morbid order. Thanks for that will end here and that concludes in conclusion always Dopey.", " Article for Nummies Jesus. Okay moving on this thank God. This is an appropriate question. Where will you be in 10 years? Where will I be in ten years? Because it's real theme here. I would probably be overseas. I don't know where yeah, I'm telling you. There's sweet will turn to be in 10 years 17 B-17. Yeah, he'll probably be like, well, I'm not going with you.", " Love you, but by you know, like when I think about when I was 17, I wasn't here. I was I'd gone already overseas. So maybe he'll just do the same. I don't know. Are you might want to go with you? He might never know. I would love it. If I say to her now. I'm like you can live with me for the rest of your life. Like yeah. Mom loved you on like no. No, I mean it you want to get married your wife can live here with us like perhaps gonna be one of those mothers. Yeah now like in 10 years.", " Is I'll be in my mid forties and part of me saying that is because when we lived away, we were very young within the expat Community comparatively. Yeah, so a lot of the people that we knew and became friends with were in their mid Force. Yes, a lot of them had gone at that point. And so I think if we're going to do it again, that's probably when we would go and maybe we would be away already or or maybe we won't I mean if you ask me now, I'm going to say we probably would", " Overseas. Yeah, but plan we will have heard maybe will be 12 years in Dublin at that point and I'll be living my best life and thinking what was I thinking about living overseas? This is the body, you know, so I don't know. Yeah would probably be overseas but and it'll be interesting to see in 10 years. Where would be the place that everyone's going? Yeah, like I certainly at 17 I certainly would never have envisaged the life that I've had. Yeah in the time between 17 and now yeah, like I know I would have", " Traveled and done a bit more but I would never if somebody told me like this is the kind of life. You have lived by the time you're 35, I would have been like no way. Yeah, you know, there's no way yeah, there's no way but of course that's trained by her stuff out of my mouth. So yeah, so it's probably something similar. I'm glad I believe another 10 years of shenanigans overseas. I don't even know I don't know. But yeah, maybe they're open to a moment. Yeah. I think it's in our veins, you know, it's just", " to do stuff and travel and but then equally I'm quite happy where I am as well so like I can kind of make", " I don't know I can kind of make it work wherever. Yeah, like if somebody said to me, okay. So on you're going to stay in Dublin for the rest your life or you going to stay in our own you can lift and go away fine. That's fine. Like a mind. That's that's Grand. We'll do that or if somebody said you're going to move to Australia tomorrow and you can live there for five years. Okay, fine. We'll make it work. Yeah. Yeah just do like I've never been one to cling on to a door frame and be dragged anywhere like, you know, just go with the flow and whatever happens will happen and wherever we go. We'll go God Colors of the Wind.", " Pocahontas to the theme music here. Yeah. So yeah, so that's the answer to that question. Brilliant. Well, thank you so much for coming my God. Thanks for having me. It's brilliant. Hi. I'm like, oh my God, especially the rose a that you provided was wonderful. It's not bad for a while and every time I'm like, it's very pale. That's usually my way of racial. Yeah, so there's one called notorious same thing. Is that Conor McGregor?", " Imagine if he were notorious. Well, I'll get it for the next time.", " I'll go a little Conor McGregor sticker and put it on the back just so we be so funny. Yeah, we had to light it with that now. Yeah, honestly Boston must just be like what is wrong with him every time they see myself. I think that's a great way to buy euros a though. Even if you have if you've only got like three or four minutes and you're running into a supermarket just scan by the color the palest of the nadir it is usually it means the lighter the dryer it is the darker. It's more sweet therapy. And yes European. Yeah. So I usually even if I don't have time to read them, but I know I need to grab a bite.", " I love I would just scan for like the palest one and then get oh, yeah. Yeah, I am walked in the other day and they were doing a rose a testing. Oh, well, I had two little chiffon the dream and I hear lee fucking stumbled. It really looks pretty strong. It just landed. So I was like, I haven't eaten in other words the volume was it must have been high it was I don't know but it was that notorious one so long, that's why it's called. It's very strong. Yeah.", " Fuck dude cinnamon my God. But yeah, thank you for coming in. Thank you for having me. It's been absolutely wonderful order. Let's cheers and laughter cheers tinkling clink."]}