{"showID": "00gQsEcqYYZNDhnsFlPSfi", "show_name": "Nintendo Switch Craft - A Nintendo Podcast", "show_description": "I've been watching the development of the Switch since Iwata announced that it was called the NX.  I've owned and played nearly every Nintendo console. You can expect three episodes every week about Nintendo and the Switch.  You can expect me to talk about Nintendo News I'll be covering Zelda, Mario, Splatoon, and other franchises from Nintendo both played on the Switch and the 3DS, though mostly the Switch.   I also stream on Twitch at Twitch.tv/runjumpstomp Support this podcast: https://anchor.fm/nsc/support", "episode_name": "Cadence of Hyrule is HARD, Mario Maker tips, Switch Giveaway, Tetris 99 X Splatoon, Dragon Quest Builders 2", "episode_description": " https://runjumpstomp.com/2019/07/02/switch-craft-show-notes-359/   ---   This episode is sponsored by  · Anchor: The easiest way to make a podcast.  https://anchor.fm/app  Support this podcast: https://anchor.fm/nsc/support", "duration": 32.29238333333333, "transcript": ["On episode 359 of Nintendo switch craft my in progress review of cadence and mr. Teske talking about some course creation kit tips for Mario Maker. There is a giveaway for a really cool-looking Nintendo switch and new Tetris information is on its way those stories and more on this episode of Nintendo switch craft. This is smash block and you're listening to Nintendo switch craft.", " witchcraft is brought to you live four times a week on Tuesdays Thursdays Fridays and Saturdays tuning live over at twitch.tv slash run jump stomp this", " Sawdust witchcraft is made possible by patrons like you gets Witchcraft and my other content ad free for as little as a dollar over at patreon.com run jump stop before we go any further. Usually I say which Patron it is, but right now patreon is down. I can't get to patreon at all. And then that's really where there's actually quite a few websites. I can't get to I wasn't able to go see Nintendo life.", " I couldn't get to patreon Discord crashed on me. So I don't know what's happening. But it seems like it's the end times. Anyway, I wanted to talk just a little bit about patreon because I know that there's a lot of people who don't like patreon like in general like they are not a fan of patreon overall and I did have somebody who said bill. I want to support the show. How do I do that?", " I don't want to support patreon and I was like, well first off just listen to the show that's enough. But if you're looking for other ways to support the show one way that I don't think I've ever spoken about and that's because I just never got around to talking about it is you can support the show just like you do on patreon but directly through anchor. So if you go to Anchored on FM / NSC that's and as a Nintendo S as in switch and C as in", " Tanker dot f m / NSC there is a button right there that says support this podcast. And if you click on that, it pops up a little spot where you can subscribe for a buck a month five bucks a month or 10 bucks a month. So just the I always forget to talk about it because people ask me and then I send them a message about it, but I never talked about it on the show other ways that you can support Nintendo switch craft, but because I couldn't go to patreon this morning and", " Find the name of the patron for today's episode. I did it just kind of reminded me. So if you want to help out, that's awesome. There's another way you can help out as well. And this one is really important. Okay? This one doesn't cost you anything except for maybe about five minutes of your time. Alright, so if you want to help out and you've got five minutes last year Nintendo switch craft was nominated.", " And for the podcast Awards and it's just very I was like blown away that I was nominated for an or we did not win. That's okay. I was just very happy to be nominated. But the podcast Awards is now accepting nominations again. So, you know, if you want to nominate Nintendo switch craft, it would really like the the they only take the top 10 of P of", " They get nominated and those are the ones that are in the category so nominations, I guess are now open. If you go to podcasts towards.com, that's podcast towards.com. It'll say the People's Choice on there and it's the 14th. Annual People's Choice podcast Awards. It says nominations are now open. So if you click on nominations are now open and then all you got to do is fill out this information and you can sign up.", " Up, and then you can also click this this so they'll ask first name last name email password and confirm your password and it's basically you're just making a you're making a what's the word. I'm an account with their website. And then if you want you can also say please consider me as one of the listeners that will be randomly selected to vote. So then you'll also be able to vote on the the winners as well. So then you check that.", " Listener you hit sign up and then you can nominate Nintendo switch craft for a podcast award and you know, it would be amazing if we won, but I would just love to be nominated again. So that's another way that you guys can help out. It would really really help. So anyway podcast towards.com, but that's not what you're here to listen to your here to hear about Nintendo stuff. So let's talk about all of the things that are going on with Nintendo. But first I want to thank Scott Mayhew.", " And for their five star review on Apple podcast, you get everybody who reviews the show over there. You guys are awesome. Thank you so much. Let's let's talk about Cadence of Hyrule Mario is an Italian plumber who under your control enters the Mushroom Kingdom to fight off killer turtles and deadly Ducks until he can Rescue the Princess Toadstool. All right. That was the wrong clip. It should have played Zelda stuff. It's just random. It doesn't matter Cadence of Hyrule. I", " About last time just a little bit. I got through to the first boss and I was able to beat the first boss. They did it on stream over at my twitch stream and it was awesome. It was really really fun. I am now at the second dungeon, so I have been I've continued playing and I've worked my way through and now I found the second dungeon and I am running into a problem. Like I just can't seem to get past it the difficulty of", " Cadence of Hyrule is really really high and it's high enough that I've even considered turning on. I haven't done it yet. But I've considered turning on the mode where it you don't have to do it to the beat of the music everything just kind of moves when you move so you can like move link or Zelda or Cadence and or whatever the the necrodancer 's name is you can move those characters.", " And every time that they move every other monster on the level moves and then you can stop and look and say okay. This guy's got his arm up. So he's going to swing and this guy is about to cast a spell and you know, all of those that like that kind of stuff like you can make all of those decisions and then decide where am I going to move next in move move to that next square and I feel like that kind of takes away a lot of the", " The charm of the game so I don't want to play like that. But right now I am just absolutely slamming my head against a wall trying to figure out what am I doing wrong? Because I can't like I keep missing beats or they'll be too many monsters clustered into an area and so I can't find a way to dance around them so that I can get my attacks off without getting hit myself. I was talking to somebody about this they said bill", " Leave the dungeon and just go look around and try and farm diamonds and farm other stuff go find extra hearts and things like that so that you have more life because that's going to be that's going to help you quite a bit. So I may end up doing that but I I gotta say I love this game but it is it might be beyond my skill level which is too bad. But you know, I finished the first", " And you can do the dungeons in any order. So I finished a dungeon. Maybe I just finished an easier dungeon. And this one seems harder. It's the ice dungeon, by the way, so I'm having a lot of trouble with it, but I'm going to keep plugging away and keep trying and I'm going to resist the urge to turn off the fixed beat mode so that I return on the fixed beat mode so that I don't have to worry about dancing to the beat of the game. I think that that", " That I think that that kind of defeats the purpose of playing this game and if that's what I was going to play then I would just play some other roguelike even though this one has noodles and Oodles of charm. Okay, let's let's let's talk about Super Mario maker to I have to cough real quick. Just a second.", " All right. Sorry about that. So I want to talk about Super Mario maker to that game game is awesome. Yeah, I can't wait until we can play with our friends, but I'm having an absolute blast playing Super Mario maker to now just so everybody knows if you go to run jump stop.com. Mmm as in Mario Maker you can submit your levels that you make to this.", " Spreadsheet which will have a bunch of people's levels on it. I don't know. How many are in there. Now. Let's actually check. Let's go run jump stomp stomp.com. Mmm. Sorry for the typing sounds and what you'll see when you get there. You'll go to my website and it'll you'll scroll down and we'll have a big picture that says Super Mario maker to you click on that and it's going to take you to a Google form where you can submit your information right now. We've", " Five only only five things in there, but that's okay because we're going to get more and you can also shoot I didn't mean to do that. Let me click home. I screwed that up. / mmm. I didn't mean to close it. And then what you can do is if you go to MMM you can bring up the list and it has all of the level IDs listed right there. I will tell you this one the first one level names stuff by Johnny link is", " is really really difficult and you're going to have a hard time finishing that one but it was fun to try Johnny link also said that his next one was going to be easier. So, you know, hopefully more people get in there and post their favorite and it doesn't even have to be one that you made it could be one that you just played and liked and you are sharing it with the community. So like that might be something that I do as well where if I play one on I really like it then I'm going to", " It into the Google form so that people can access these levels and have fun with it because Mario maker to it is just improves upon Mario Maker one in every possible way outside of the fact that there's no amiibo. Like I like the idea that you could put an amiibo in there and it would give you access to play as you know, the Splatoon kids or whatever. I thought that was cool that being taken away I think is", " Kind of lame, but at the end of the day, it really doesn't matter. I've been playing mostly As toad because what you can do is you can go in I think yeah, I think on every type of game you can go in and you can say I want to play as either Mario as Luigi as toad or is Toadette and I've been picking towed his little 8-bit Sprite is hilarious and I like playing as him, but Mario maker to is fantastic. I", " It's so much fun the hundred course chant or the endless course challenge. I think is beyond me. I like I always get like three or four into it and then I just hit a wall and I have this there's a problem with my brain where it's like you can't skip I mean if you skip then you're giving up and I don't like to skip if you didn't know you could just hold down the minus button on the controller for 3 seconds, and it will skip you to the next level I", " Eight skipping. So I end up not doing those endless course challenge where it just keeps giving you random courses, but I've been having a lot of fun just going into the core spot or another core spot the the course selector course world. That's what it's called and scrolling through and looking at one that has had lots of plays that it has lots of hearts on it and selecting it and going through and trying to beat it. I've just been having a blast with it the community", " Is very very good at making Mario levels. They're so much fun. And there's like the one of them that I did and I should probably try and find this and post it to the Run jump stop.com. Mmm, and I'm going to try and do that later on today. I'm pretty busy today though. I'm going to try and do that later, but it had this awesome boss fight where I got to the end and I had to fight Bowser.", " But the only way for me to defeat Bowser I was I was trapped inside a little box. Right and Bowser was off to the to the right and he was breathing fire at me and it just kept shooting mushrooms out to keep me alive. And then I had to do this weird dance with p-switches or I guess not piece which is just switches which kept turning blocks on and off in order to get like turtle shells.", " Has to fall down on Bowser in order to defeat him. It was incredibly clever and it came out of nowhere and I was really surprised when when it happened. I was just like that wasn't a fantastic boss fight and I did that over on my twitch stream and I think I think everybody was pretty impressed with that particular level. So like if there's more like that out there we are in for a real tree now my question is", " Are there levels in Mario Maker? I'm sorry Mario maker to that came from Mario Maker one, and I haven't really thought about it until right now in the middle of telling you about it. I was just curious like I got the game on day one and I loaded it up and there are already like a bunch of levels. So", " I guess I'm wondering how did those all these levels get created so fast and I'm sure there's lots of people who have Mario maker and they you know, they started making levels right away. But do we have some levels from Mario Maker one? And if we do that's really really cool. I also I'm very happy with the filtration system. So you can go through and filter out. You know, I don't want to do these music levels right don't want to do speedrun levels. Although the speedrun levels are have turned out to be my favorite swear.", " you go through and I didn't know this but you can say OK, you'll get 20 seconds to finish this level go and you keep going through and the first one that I did I didn't realize it was a speed run level and I went through and I got right to the end and I wasn't fast enough and I died and I was like, oh my God, I'd had no idea the speedrun levels might be my favorite levels, but you can filter out the stuff that you don't like and just focus drill down on in into the stuff that", " I really do like and I just think that that's fantastic Mario maker to is a treat. It is an absolute treat. I can't wait for us to be able to play together. Once we get that patch, you know, who knows when that's going to happen. Hopefully sooner rather than later. Mr. Tezuka. He has five course creation tips for Super Mario maker to if you want to follow a link in the show notes, you know.", " Some of them are okay, whatever. He's like come up with a title first. It's really not that compelling content. But you know, you know, this is the guy who he's been making Mario levels for a very very long time. So the five course creation tips from mr. Tezuka as over on Nintendo's YouTube channel, and if you just go to run jump Stomp.com and this is episode 359 you will see a link in the show notes for that. Let's thank our sponsors and when we come back", " We're going to talk about this giveaway. Not a give away from me. But a giveaway of a really really cool looking Nintendo switch be right back. Hey everyone. I want to tell you about something that I like. It's anchor if you haven't heard about anchor it's the easiest way to make a podcast first off. It's free doesn't cost you a dime. In fact, it can make you money. There's creation tools that allow you to record and edit your podcast right from your phone or your computer. In fact some episodes of Nintendo switch craft have been completely made on my phone anchor will distribute your podcast.", " For you so it can be heard on Spotify Apple podcasts and anywhere else where you would download a podcast. This one's huge. You don't need a minimum listenership in order to make money from your podcast anger will sell the ads for you you record the ones that you want and they go on your podcast. It's everything that you need to make a podcast all in one place. So if you've always wanted to start a podcast but never known where to start now you do download the free anchor app or go to Anchor dot f m-- to get started today.", " Right. Now you're listening to a podcast. I know it comes as a huge shock, but that's what you're doing. Did you know that you can listen to podcasts on Spotify you can also do a lot of other stuff on Spotify as well on Spotify. You can listen to all of your favorite artists and podcasts in one place for free. You don't even need a premium account Spotify has a huge catalogue of podcasts on every topic including the one you're listening to right now on Spotify. You can follow your favorite podcast. So you never miss", " an episode premium users can download episodes to listen to offline wherever you are Spotify allows you to easily share what you're listening to with your friends on Instagram. So if you're already using spotify do me a favor and share a Nintendo switch Craft on your Instagram page if you haven't done so already be sure to download the Spotify app search for Nintendo switch Craft on Spotify or browse podcasts in the your library tab. Also, make sure to follow me so", " Never miss an episode of Nintendo switch craft.", " It's two player pond on the split screen.", " We just don't know.", " All right image and form games. They make some really really great games. They make the steam world games. So steamworld dig steamworld dig to steamrolled Quest steamworld Heist. Is that everything they make awesome games and I'm a fan of image inform games. They have become one of my favorite developers on the Nintendo switch our or just in general just this cool Indie developer that they're putting out.", " Really really good content and they tweeted out today. They said it's summertime and we're giving away this custom golden steamworld Nintendo switch retweet and reply with your favorite steamworld memory will choose a winner and when we're back from vacation in August will pop on social media every now and then happy summer and if you're watching the video, excuse me.", " Then you get to see this and if you're not follow the link in the show notes so that you can check out the tweet from them. But this thing looks really really awesome. So on the left Joy con you can see the character from the first steamworld dig game on the right Joy con. You can see the character from the second steamworld dig game and on the back you can see characters from steamworld Quest and", " I don't think I see any steamrolled Heist stuff on here, but that's okay. Even then he said Nintendo switch logo has been changed on this. So it looks like we're there. You know how it's got like the black Joy icon in the white Joy icon and then they have the opposite colors in the and the switch logo. They've replaced the joy cons the like the thumbsticks the circles that are usually there with little Cog Wheels. It's just really cool and it looks like it's done.", " With metallic gold paint just really really awesome. I I am of course going to enter this contest and I'm sure that I won't win but somebody's going to win this thing. And I you know, if it's you I hope that you message me and let me know that you won because that thing is just so cool. And honestly, if you haven't played any of the steam World Games you're missing out on a some fantastic games and they're from all different genres. So", " for instance, if you're looking for a game that is a tactical game turn-based tactical then you want to check out steamworld Heist. It's basically like XCOM or Mario plus Rabbids, but in the steam World Universe where you are like these robots who are on a spaceship and you're going from place to place and fighting against like space pirates and stuff like that. It's really awesome. If a metroidvania game is more your jam then check out steamworld dig in.", " Steamworld dig to those games are ridiculously good especially steamworld dig to it's one of my favorite metroidvania has of all times. So definitely check that out. And then if you're looking for an old-school jrpg where they kind of Base the combat on having cards in your hand, you're like, okay. Well, I've got these cards. I'm going to use this card and it uses up my Mana then steamrolled Quest is going to be something that you're going to want to check out and if", " If any of those games sound cool just go to my YouTube channel youtube.com slash run jump stop and I bet you if you type in Steam world. I don't know if I've done stuff for all of them, but I've done stuff like I've done videos on some of them. So if you just type in Steam World on my YouTube channel, you will find those videos and you can check out what the steam world games are all about their they all have a really cool aesthetic. I love the art.", " And there are also just really good examples of the genre that they're in so that's image inform games there, you know, hopefully, you know fingers crossed. I hope I win but I doubt I will but anyway, let's talk about something else that I'm never ever going to win. And that's Tetris 99 the highest place that I've ever gotten on Tetris 99 is second place and I was very happy to get there but they keep having these Tetris", " 99 online competitions, which I think are very cool. The last one gave you the ability to unlock like a Game Boy style theme for Tetris 99 and all you really had to do is at worst play a play like 50 games.", " Nobody's going to have to play 50 games in order to unlock that or nobody had to that would mean that you had to come in last place every single time.", " What was it? Oh, yeah. Yeah. So the higher you place the more points you get and then though you once you earn a hundred points, you unlock the whatever it is in the case of last time. It was a my God. My brain stopped working. It was a theme for for it via Game Boy this time. It is a instead of a Gameboy theme. It looks like it is a Tetris or I'm sorry, not a Tetris theme.", " Splatoon theme. So this is coming to us from a tweet from nin switch news, which was actually talking about something from Nintendo everything but I followed it to the original source. And this is a Nintendo's Japanese website and I'm scrolling scrolling scrolling and here it is right here. So this is the fifth Tetris Maximus cup. It's called the splits.", " Tune collaboration festival and it says Nintendo switch on in this is automatically translated. So it's going to be really broken English and stuff. But it says Nintendo switch online for member on love limited software in commemoration of the final Festival, which if you didn't know we're coming up on the final DLC for Splatoon to which I think is July 12 are no", " Yeah, I think it's July 12th. They're also doing a collaboration with Tetris 99 During the period the in-game graphics will change to splatoon's style and the theme of Splatoon collaboration will be will be presented to all those who earn a hundred points that can be earned according to the ranking during the rank period so please try it again. This is auto translated. So it's really hard to get.", " You're saying but the I already kind of covered the gist of it if you like Tetris 99 if you're a fan of Splatoon, and if you want to try and earn that then you're going to want to do that and it happens on July 12 starting at 4 p.m. I'm not sure if that's it's probably Japan time and it goes until July 16th when looks like 350.", " Nine PM. Also Japan time. Now are we going to be able to do this in the states or in Europe or in in the other areas? I don't know because I don't I haven't seen anything about this from Nintendo Europe. I haven't seen anything about this from Nintendo America. However in the past from with Tetris 99, they've kind of duplicated their efforts they call them different things, but they duplicate their efforts and", " Same all over the place. So I fully expect that. We will see something from Nintendo of America about this. However, it's free to make a Japanese Nintendo switch account. So all you had all you would have to do is log in with a Japanese account and then you could probably play this part and it's not like you have to be able to read anything when you're playing Tetris and my guess is you would probably be able to unlock this. Anyway, I'm definitely going to try because I love touch.", " There's 99. It's a fun game and you really don't have to play that many games in order to get those 100 points that they're talking about. Okay, Dragon Quest Builders to it has a demo out last time. I just mentioned that the demo was out and now I have played the demo. I did not play the entire demo. I played up to the point where you can save and you know, there's a lot of people who are confused about this.", " I wanted to address it and I think I could be wrong about this. But I think that they there's a good reason why you can't save Beyond a certain point. I think the game is generated procedurally so that when I'm playing and when you're playing we will have a different experience like the you all have all the same stuff but it would be in different places. At least that's what it seemed like from what I read when I was playing the demo because", " Cuz you start out you're on a boat with a bunch of monsters and the monsters are like, hey, dummy, go do all these things and it's basically teaching you how to play the game, which is great because I didn't play the first one and it's really cool. The thing that one thing that surprised me is you can go into first person mode and play in first person mode, which I thought that I would really like because I played a lot of Minecraft, but I actually prefer to play this in third person mode. It's much better the cameras up higher you can see more of the world and you", " Turn around faster as well. Because if you're playing in first person mode and you want to turn around like the character has to go to to to to to and turn all the way around. Whereas if you're playing a third person mode and you just point your stick the other direction your character just spins around instantaneously, but you will break stuff down you'll build things in a little crafting table like Minecraft you place blocks. It's basically Minecraft in a dragon.", " The universe and its really fun the the the quests and the text dialog is all super cornball, but it's also really charming and I liked it. So I had a lot of fun with Dragon Quest Builders to I'm not going to get it right away because I've just got too much to play but it's definitely something that I'm going to be watching to come out on a like on sale or something. Let's let's", " Going to skip this story about Layton and just let you know that the that there's a latent game called catch real the millionaire conspiracy deluxe edition coming to switch on August 11th. No, no, or is that November 8th? Yes, this is November 8th because that's Nintendo UK. So they they put their numbers backwards for that. So I just want to let you guys know about that. Let's I was going to do feedback. But what I'm going to do is I'm going to take that feedback and I'm going to throw that in a", " a light switch tomorrow instead just because we're already approaching a half an hour and I don't want to I don't want to go over time. So let's let's wrap up the show and we'll get out of here. Don't forget to nominate Nintendo switch craft by heading on over to podcast towards.com. That would really really help out. Thank you to everybody who did that last time. Let's see if we can do it again become.", " Part of the community over at run jump stomp.com Discord. You can also watch the show live at twitch.tv slash run jump stop. You can get a hold of me by emailing me run jump stop at gmail.com or shout at me on Twitter at run jump stomp use the net the hashtag Nintendo switch craft. If you're looking for ways to support the show stopped by and in run jump stomp.com. Thank you. For more content like this check out my other shows at run jump stomp.com shows the music you're hearing right now is corneria Starfox room.", " Mix by noteblock. It's awesome. They're awesome. You're awesome. You guys have an awesome day. I'm out of here. Bye. Bye."]}