{"showID": "00h18NlParejEuFrdCf5dC", "show_name": "Only Looking Up", "show_description": "Welcome to \"Only Looking Up\", a podcast by YouTuber Dearly Bethany and hosted by me, Bethany! So this podcast is not your oh-so-typical podcast that focuses on one subject and never strays from it. Oh no no no. This podcast is a place where I talk about almost everything. A little of fashion, beauty, art, history, books, self-development, my relationship and more. I want it to be a friendship between you and me. A place where you can ask questions and I can give unqualified advice because in reality I'm also just a work-in-progress navigating this world of adulthood.", "episode_name": "5 Fashion Essentials To Invest In – Adulting 101", "episode_description": "I started over on my personal style a little over 2 years ago. Before that I didn’t have anything to wear that I felt confident in or that matched. I felt like it was holding me back as a petite woman in a design field. I started over with a basic color scheme and really a capsule of just the most basic items I needed to survive that season. Each item was made with fair-trade practices and quality in mind, so I spent more on those initial pieces that I ever had spent before. I had to tell myself that I’m paying for quality and craftsmanship, and I felt pride in what they made. I took care of those pieces and I still have most of them today. I started taking my OOTD photo every day on Instagram for a full year, and since then I’ve developed a closet that works together well. EVERYTHING matches. I no longer have cheaply made jewelry or fabrics that just fell apart on me anyway, and I did that with intention. So even though naturally I’ve expanded my collection over time, I’m never flippantly buying things that I’m going to throw away. So 5 fashion Items I’ve started investing in:   High Quality Fabrics  Gold or Brass Jewelry  Higher-end Lingerie  Versatile Shoes  High Quality Purses and Bags  These investments are almost all accessories. Invest in daily higher-end items that people won’t get sick of seeing you in. If you will be interacting with many of the same people every day, then I would avoid wearing anything easily recognizable like “Oh you’re wearing the polka-dotted hoodie with the bunny ears again”.  Investing in the right parts of your closet is important. Hopefully this is a good direction if you’re not sure where to begin. Hopefully it helps you find the best return on your wardrobe investment. ", "duration": 30.79923333333333, "transcript": ["Hi guys today. I am going to post it to my podcast again. And I just love doing these video podcasts where you can find like the video version here on YouTube. But then also I've got the audio version through different podcast platforms. So I'm sure that whatever is sort of like podcast platform that you listen to is where you can find me and it's called only looking up because I mainly talk about Petit things. But yeah, it's been a few months since I posted there.", "And time has just flown. So I'm really excited to start today with a series maybe just like a miniseries that I want to put together ideas for called adulting. Basically anything that I've started doing as an adult that has really transformed the way that I look in my fashion or beauty or whatever that is. So today. I wanted to talk about five fashion items that I've invested in recently.", " So that's kind of what I'm going to be discussing today. It's going to be really chatty. I've got my coffee. So hopefully you can just sit back and let this roll and I don't know it's just going to be a really fun topic. It's close to my heart for those of you who maybe are new to my Channel or new to me. I just started a couple years ago on my personal style Journey meaning I found myself in a place where I was really", " It just strapped on my budget. I really didn't want to put a lot of money into things like clothes or anything like that. I wanted to just focus in on my finances and that worked for the time especially and it's always important and I never want to say anything that would be a reflection of what you should do with your finances is very personal, but for me, I found that clothing it was just last on the list as I was also.", " So faced with this career of being a designer, I found that I wasn't at a point in my career where I should be making those cuts on my wardrobe because I wanted to be taken seriously in things like meetings or you know, I've talked to other people who are faced with kind of the same thing in their career if you maybe are taking care of someone's children. I know some person some one of my friends that she was faced with that too. And she wanted", " You be respected by the parents. So instead of dressing to take care of the small children. She started dressing to impress the parents and give trust to the parents. So that was just one example of how clothing can impact that so I approach this topic delicately because I find that it's super important and it will have a big return on investment, but I know that not everybody is at a place where they want to", " Best in their wardrobe at the time. So that's kind of where I'm at. Today is discussing where you're going to find the biggest impact on your higher-end purchases of your wardrobe. So if I was just completely Starting Over Again day one, you know, that's where I found myself a couple years ago. I ended up investing in just a few small things to build rebuild my wardrobe from the ground up instead of having everything.", " Kind of mismatched or just bought out of maybe an Impulse even though it was more on clearance or whatever. I wanted to invest in just a few items. That would give me the longest impact meaning it was more quality than I was used to paying for. And then also it just had a big impact on the versatility of the pieces. That's pretty much it. I'm going to just going to go into it. But again, I think that this really", " We will have impact for anybody who wants to be taken more seriously, and maybe it's just for a few key moments in your life. Like maybe you're buying a car selling a car. Maybe you're going in for a job interview. I've been on both sides of the table for that. I've been the one being interviewed. I've given interviews So This Is My Jam, I love talking about this. I love talking about how to dress to impress and then do doing that with versatility. Okay.", " Now further Ado, these are the five things I would say to invest in as an adult one is the right Fabrics. So to me, that means high quality neutrals. I find that that I really goes the furthest like when I first started I looked for what Sal button-down that I can wear like a white button-down would be such a classic piece maybe a black dress. So these are neutrals. These are things that you could blind.", " Ali go into your closet maybe with the lights off and it's you know, really early in the morning and you could just pick out a couple of things from your closet and they match that was my goal with when I first started it's still my goal. I've built my closet which is now bigger than it was when I first started but I can still reach into my closet and things match like I can mix and match anything really and it works so doing that intentionally, especially just with neutrals if you want to look more mature", " This is a great way to do that is just to find you know, black white brown neutrals as far as like maybe a linen without any dyes is so pretty it is like the prettiest color in the world I think but then also I really like things like a good pair of jeans like a good pair of blue jeans. So blue is in essence still a neutral genes. You might need to dress up a little bit for the sake of this conversation, but that would definitely be something", " Thing to do, but then also if you're going to buy something that you're going to wear frequently, it's helped me to be able to buy higher quality Fabrics. So instead of buying five shirts, like, you know, I just did a video on white t-shirts. It might be better to buy something that is a higher quality that you take care of and that will last longer than if you bought, you know, eventually five of them.", " Throughout the year because they keep getting dirty or whatever. And so there's things that you can do to protect white garments for that conversation as well. But I think that when I have bought something from Elizabeth Suzanne, which is much more high-end than a lot of the other things that I by then her Fabrics have lasted so much longer than a lot of the other Fabrics that are just like it. So in line with that silks high quality", " Eric you can't really buy that cheaply and if you do buy it cheaply it tends to kind of pick and not last as long maybe rip at the seems a little bit but when you do buy quality, it will last longer and you really do get what you pay for if you're looking for the right Fabrics. Another one is linen. I love linen, especially for this time of year where it's kind of warmer out where I am and just having something super breathable and I've", " And all sorts of different winnings from different companies and I would say that some are perhaps a little bit more see-through than others some might have a little bit more wear and tear and the weave might come a little bit looser. So that that's something to consider especially around the seams. I find the most use the most like deterioration if I'm not buying quality. So those are things to consider if you are going to invest in something that's a pure basic like a button-down shirt.", " Shirt or a black dress a black dress could be something that's hanging in your closet for years. And so instead of buying several throughout those years. You could buy one really good one that you feel confident in and when you go in for that handshake when you're about to have some sort of like car sale for instance or a job interview super important, then you're going to feel so much more confident knowing that what you are wearing. I don't know. It's like wearing a cape, you know, we just", " Feel empowered like a little kid who's wearing a superhero cape. And so that's kind of the idea behind this high-quality neutral Fabrics. They go forever you'll use them forever. And that is definitely something that has gone the longest for my personal style journey and being more mature and what I wear so one last note on that. I literally have some pieces that have lasted three years and they're still going", " Going they're not going to go out of style their higher end as far as the fabrics and their neutrals. So, you know, there's sometimes where a teal or whatever might be so on trend for the moment and that might be better on a statement piece or a more affordable piece that you can add on top of a basic but when it comes to Basics man, I am so particular about getting quality and something neutral and Timeless the next thing that I did when going through my personal", " Style Journey almost right away. I started adding jewelry and specifically gold jewelry can be something that will give you the biggest impact on how elevated your style is and day one for me. You know, I wasn't out there buying Linton gold jewelry necklaces or anything. I built my collection of jewelry over time and I'm still working on that. I don't have just, you know, Treasure troves of jewelry or anything.", " But one thing that I started with was brass jewelry, and of course you might find if you getting brass Rings or anything that might have a little bit of green around your fingers and stuff like that. But if you're careful with them, if you take off the Rings before you're washing your hands doing dishes whatever then that could be something where you're going to find that it's going to elevate your style and make you feel more confident as well like it right now. I'm not wearing many of my rings and", " It's kind of driving me batty because I just love to stack jewelry and have my rings on. I don't know. It's just something that makes me feel really comfortable. You know, I think that one of the first things I did was add a couple of brass necklaces and my friend she runs a company called windblown jewelry. She is a Powerhouse like she runs her whole business out of a closet and her pieces are just perfectly crafted by", " her and she's got a small team and it's just fun to take part in that and I also just really like her design. So I'll leave a link down in my description where you can find her jewelry and her pieces are very affordable to so that is where I would definitely go to to begin my jewelry collection. I also really like to now work. I like to work with Pamela card because I love her pieces so much. They're very artistic. They're inspired by", " History they each one is uniquely Handmade by really old ancient practices. And so when I wear her jewelry, I just feel like I'm part of that craft. So her pieces are a bit more expensive, but they are gold-plated. And so they aren't going to cost as much as it would cost if they were pure gold. So that's kind of how I make amends on wearing gold jewelry is that they might be sterling silver.", " Ernie 'The the gold and otherwise I really like to wear like bracelets that are very small and those ones will be pure gold but they are dainty. So anything that is pure gold that I wear usually is just you know, very small or like very thin Rings. Otherwise, I like the gold-plated effect for that as well for Rings. The Signet ring is really beautiful. So that's kind of my idea for jewelry and maybe gold isn't your", " I know some people just absolutely love silver and that might actually be more affordable to if that's what you're drawn to if maybe you have like cool tones to your skin. I know a lot of people who do love silver and that might just be a preference but I think that whenever you imagine someone who's just wearing a black outfit with jewelry, that's something you could wear when you're 20, that's something you could wear when you're 80, and there's just a timelessness to that.", " That and really you don't have to invest very much in your wardrobe. If you're wearing very neutral like black or Chic colors that are just elevated by everyday jewelry and the beauty of having jewelry and accessories is that you're not going to get sick of them. You're not going to get sick of wearing them as much or maybe you feel like other people are sick of seeing you in something that's not going to happen with jewelry as much as it would for", " Or you know, I've got a pink sweater that I absolutely love to wear but I can't always wear it because I'm thinking well, they're just gonna say the girl that wears the pink sweater. So that's kind of my thinking is where something every day especially if you're going to see the same people every day. That is timeless that maybe won't Define you as much as you define you maybe you should shine through more than the clothing so that's kind of my", " I thought there. Okay. This next one's a bit spicy, but I just absolutely feel like it is so true to thinking about how to mature your outfit how to adult and what I really think is true is wearing higher-end lingerie has made a more of an impact on my everyday Style on my confidence on knowing that my whole outfit is put together while and this is kind of a tangent. I actually", " Had someone just recently think me fervently for recommending nippies skin adhesives. So it's not really lingerie but it will make you feel more confident in what you're wearing and you don't necessarily have to think about that particular bra that will work just right for the outfit that you're wearing. So I had to briefly mention that because I do think that investing in something just like that has made an everyday impact not only on me, but other", " Oil so had to throw that in there, but also just wearing higher-end lingerie. I really like Florida mall, and I'm probably butchering how to say that but I just love the idea of having confidence with the things that I'm wearing. So if I was to wear something beautiful on top that I invested in and then I went to like The Bargain Bin and got a bra that didn't fit me just right maybe wasn't quite my size.", " Those are things to consider and I've got a video that more explains lingerie and my thoughts they are so I will link you guys over that way, but in a nutshell wearing higher-end lingerie that I'm confident in that makes me feel like I look my best when I'm wearing clothes or without is just what I think builds a confidence in me and there's nothing that I found that's given me more immediate confidence than when I go into my closet in the morning and I'm like, yeah.", " This is what I'm going to wear. And I don't know I just feel like I've got my life under control when I feel like from top to bottom from inside to out that my Alpha is put together well, and there's a sexiness to that there's a beauty to that and so investing in that was something that I didn't do day 1 of building my personal style, but afterward I'm like, oh my gosh, this has made such an impact on me and even my marriage so", " there you go. So higher-end lingerie was number three and number four is wearing versatile shoes. So the first thing that I did was I bought a pair of mules and they were basically my one pair of shoes when I first started they were from the solo and I actually did a video in back in the day just about that which was about how versatile they are and how they go with everything so I can link you guys to that video.", " But what I liked about this one pair of versatile shoes was that they were a neutral color. They were seasonally appropriate for the next couple of see maybe three seasons. I would say like starting early spring was a good time to begin my personal style Journey where I live because I could wear the same pair of shoes every day through spring summer and fall and I know that's not necessarily the case for where everybody lives but a good pair of closed toe.", " Neutral like sand colored mules was absolutely perfect for starting my personal style journey, and I still own a pair of those. I wore the first pair to death and I just loved getting to wear a pair of shoes out enough to where I had to go repurchase them. Like that's a sign of a really good pair of shoes. And I also think that adding a pair of shoes to my collection that had a very unique", " Look that could go with anything was another win. And so that's what I would say to invest in when you're going to invest in shoes, you know, people can pay a lot of money for shoes and they might not be the most versatile things in the world. They might not be the most practical if you have to walk a lot or go to different things maybe an office. I keep using the office example for this because I do think that it's where you find yourself needing to look the most mature.", " And be taken seriously and wearing something that's not completely a practical shoe is a good idea as well for that environment. And so finding a good pair of shoes that you feel confident in that elevates your personal style everyday is a absolutely great idea and there's been a few different pairs of shoes that I've worn just for fun and they are super fun to wear but they might not get me as far as I want to in my return on investment of what I'm buying.", " I feel like when I say things like return on investment that I'm totally killing the vibe of what I'm trying to say. It might sound like completely nerdy but that's really what I want to communicate to you guys today is if you're going to invest in a few key pieces in your wardrobe, what are the ones that have the biggest return on what you've actually spent money on and in my experience buying things like a good versatile pair of shoes or jewelry or, you know laundry that you", " Feel most confident in or just high-quality Fabrics that maybe you know, they aren't even high quality but ones that are more neutral or tone down can make you feel more mature. I want to also just briefly mention when I did work at Starbucks. You guys know that I worked at Starbucks when I was like 19 and I just loved having the the uniform that they made us wear. It was like back then it was like just blacks whites and khakis. That was it like", " Could not wear anything one time I actually had to go home. My manager was like no you can't wear those paired pants. They were a little bit velvety so they looked gray. I had to go home and change my pants. It was super embarrassing. Don't be like me. We're good pair of like black pants. Anyways, that's the tangent.", " For anyone who wonders if my necklaces ever get tangled. Yes, they do all the time. I just like to untangle them. It's kind of a hobby. Anyways, the last one that I wanted to discuss with you guys today number 5 of the things to invest in in your wardrobe is high-quality purses and this is something very recent to me. I really went as long as I could without investing in purses because I just felt like they were so much of an", " Mastery maybe something I could get by without maybe I could just you know carry something small or my outfit was doing good enough. I don't need to actually invest in a purse too. But since I've done that, I found that it has been a really great thing. So some of them have been gifted to because I waited so long in my career as somebody who talks about fashion online that I was able to actually reach out to companies and be like please sir. Can I have a purse?", " So that is kind of where I'm at now, but I have to say that I now get more compliments on my whole outfit by wearing one purse then I ever did before and it's just because I feel like if I wore the most basic t-shirt pair of jeans flip-flops, and then I added an absolutely amazing purse with it. It would be like completely acceptable and impressive.", " Just by adding the purse. So just like adding jewelry really had an impact on my personal style. I feel the same way about purses now and I don't really have a large collection of purses especially compared to some other people possibly, but I really just feel like adding one good black purse and one small beige. Purse is really all I need to get by and I feel like those pieces I could wear them.", " Every day and again, it's not something that I'm going to get sick of wearing. It's not something that other people will get sick of seeing and everybody's happy. And so I think that that's really a great thing because I could invest in just the most basic outfit and then again like jewelry purses will get you there. They will make your outfit look so elevated you will look so Chic and I think that's why a lot of people do invest in things like Louis Vuitton. I mean those bags are", " Everywhere and people can be on vacation and wearing completely like gym clothes would they've got their Louis Vuitton bag and I think that the thought behind that is that it is luxury and you can be more casual in your everyday life. But having that one thing that is more luxury elevates your style. I personally don't wear a lot of bags that have logos on them or anything like that. I like them to be a little bit more understated and that's my personal preference, but I also think that", " That by making decisions on my purse choices. I am trying to make them like intentional so ones that I can wear with anything that will be timeless that I could pass down even like purses are something you could pass down and they're vintage at that point. They're just absolutely amazing. Like oh this was my aunt's lovely purse name brand whatever but I do think that wearing something that is more understated even with your", " That are Chic will make them look more mature. So again, I think a lot of that is preference. But whenever I'm going to make a decision on what I'm going to get for my closet, I am thinking about does that actually look intentional is that an intentional design decision or am I just checking the Box me and my friend were discussing that because I came from a place where everybody in the town had their boxes checked.", " Meaning, you know, they had this type of car. They had this type of purse and you know, I came from a place where I mean, my family definitely could not check any of the boxes. So to me it was more like I when I got to a point where I could buy a box then what that meant to me was I want it to be something super intentional something super Timeless something classic and so that's kind of", " The box that I check is not one that everyone else is checking because what happens is they find that that one box that they checked is now out of style and they throw the Box away and then you're left with this box that you spent a lot of money on and it just doesn't it doesn't get you as far in your investment as it could and so that's kind of my discussion today is talking about. Peace.", " Isis in conclusion that will give you the most impact on your investment and the longest the longest amount of time as well. So if I bought a purse today, I wanted to look amazing, you know in 20 years when I give it to my niece like that's kind of what I'm thinking and I want to look amazing today without having to spend a lot of money on an outfit. And so that's kind of where I found myself a couple of", " Years ago, it's something that I'm very passionate about talking about because I love even now as I've indulged endeavored into all of these different things involving fashion. I can have a little bit more fun. Now. I can buy a few other pieces that are perhaps more fun a little less Timeless in sometimes they're not always Timeless, but they're always something that it's going to blend well with the closet that I've built. I was reading a blog post a couple of", " Years ago that was about how this one girl. She was in college. She really didn't have a budget at all for her clothes. But one thing that she did do is and her clothes were all just like neutrals her, you know exactly what I've described today, but then she bought one purse and one pair of shoes that could work for everyday use and she got compliments every day. She was able to go out and feel confident and these pieces weren't something", " Anyone got tired of and that was an inspiration to me.", " I don't know if you guys can hear that. It's a car alarm. But anyways, that was just such an inspiration to me and that has really been my goal. I even as a little kid you still love when Oprah would talk about stuff like this where she would say. These are the things that everybody needs in your closet and she would go through each one. Like the little black dress is obviously something that you'll always need or a white button-down or a good pair of jeans, like one pair of flip-flops one pair of heels one pair of", " Sneakers and I used to always have that up in my closet and make sure that like listed out that I had each one of those things that were essential to my closet so that I wouldn't feel lost. You know that feeling when you wake up in the morning and you just are looking at your closet and you like I have nothing to wear today ever since building my personal style. I haven't felt that feeling and it's so refreshing to be able to think I've built a closet.", " That meets my needs and I've talked about this a little bit but I think that my major key with this is to build a color scheme and I won't completely make a whole nother video segment to this video podcast, but I was saying building on a color scheme has been the most important thing to do. So when I say things like finding Fabrics that are neutrals, I really do mean it like if you can find your color scheme, maybe it's not neutral.", " That one is the most timeless the most mature then you will be able to extend the life of your clothes. You're going to be able to build on that so much in your own capsule wardrobe, which can be a capital of maybe a larger size. I don't have any definition there. I don't have a capsule wardrobe necessarily. I never really did except for when I first was starting over on my style. But I like the idea of everything just blending together working have", " being a purpose and I hope that that's that my heart of this conversation is coming through because that's really my goal is to set you up for success and to be able to have the best impact on what you're investing in. So that was a really chatty video. But I really hope that you like it so much if you're listening here on the podcast, please rate it and do all those things. I am not the most experienced podcaster in the world, but I", " Absolutely love to be able to post these out for you guys. Hopefully you are I don't know maybe he's stuck in traffic or something. And this is just major life a little bit more peaceful. Maybe it's given you some insight that perhaps you hadn't had before and I just love being able to talk with you guys. So doing these chatty videos. I mean having a podcast is just an excuse for me to be able to just like completely go off the rails and", " and speak my mind about these things. So I hope that you're able to get something out of it. So again, the five things that I would invest in fashion number one high quality neutrals. Number two gold jewelry. Number three higher-end lingerie that I'm confident in number four is versatile shoes, and the fifth was high quality purses. So I'll leave you guys with that. I hope you're having an awesome day. Don't forget to like subscribe rate, whatever it is wherever you're listening.", " Ting and I'll see you guys next time. Bye."]}