{"showID": "00HHtj8tNmu8rquP1R4u9F", "show_name": "The Hawg Talk Podcast", "show_description": "Jacob Davis,Ty Hudson, Porter Hayes and Kyle Sutherland come to you weekly with the biggest news in Razorback sports. If you like our show hit that subscribe button and share us on social media!  Support this podcast: https://anchor.fm/HawgTalk/support", "episode_name": "The Hawg Talk #31", "episode_description": "Jacob and Ty share there thoughts about the Razorbacks game versus Auburn, keys to the game and more.   ---   This episode is sponsored by  · Anchor: The easiest way to make a podcast.  https://anchor.fm/app  Support this podcast: https://anchor.fm/HawgTalk/support", "duration": 29.62015, "transcript": ["Razorback Nation welcome to this episode of the hardtop podcast. If you liked what you were listening to make sure you hit the Subscribe button and leave us a review while you're listening on your Apple device. You can also catch us on Spotify Stitcher anchor iHeartRadio any popular podcast platform. You can also catch the hog talk daily following us on Facebook Twitter Instagram Snapchat this court in our website the Hog Pen dotnet. We hope you enjoyed this episode of The Hog talk.", "Yo, what's going on? Everybody? Welcome to episode 30 freaking one of the hardtalk podcast Jacob and I were just talking before we went live before we started recording that is flown by and it's been a lot of fun Jacob sir. How you doing? Man? Doing great. How about you man? You know, not that great considering my Cardinals laid an egg against the against Washington little embarrassing.", "Good wasn't good. But hey, at least y'all made it in your competed. I didn't I did not have them in fact, you know something else we're talking about before we started recording. I told you that you know, the MLB app At Bat app I had they did a postseason pick them like a tourney pick them right playoff bracket and I had the Cardinals getting swept by the Braves that that's what's funny about. This is like they turn around and then when they took on the Nats, I", " thought Washington's not that great. I mean, yeah, they're okay. They're I mean, they're decent enough to get to where they're at. And it shouldn't shock anybody that they're playing for the pennant but like the Cardinals the way how well they played against Atlanta for the most part still inconsistent at the plate. But for the most part, you know, they played pretty good ball and advanced. I thought they would get past Washington and I was so wrong that it's it hurts it got to the core of me it was", " Air hissing man. That was I don't know. It's one of those you here often like the way that you lose you would rather just not been in the situation begin with because of how you lost and that's exactly the kind of how I felt with the Cardinals.", " In that in that matchup against the Nats to play for the pain and it was just embarrassing but it is what it is. Hopefully they make some moves in the offseason get some hitters get a little bit. I don't know what they got to do about hitting they're hitting the season was so wildly inconsistent, but it is what it is. So like I said episode 31, it's been fun. It's been an absolute blast Jacob. I wanted to give everybody a real quick update.", " On the pig trail Network. Yeah, go ahead. We had we had kind of briefly mentioned this before about maybe renaming the pig trail and maybe they're going to be some changes coming. What what I'm going to do with the picture. OWN Network YouTube channel. It's going to stay there. I'm still here at the hog Talk podcast. Nothing with me is changing. If anything you're just getting more more of me stretched out so thin and not getting paid a dime for it, but I'm here.", " And I love doing it. I love talking with you guys. I love the hog talk and interacting with fans on the live streams on the YouTube channel. So I thought you know what I've had I've had enough people tell me that they really wish that I would format those live streams into podcasts form. And that's what I'm going to do. So I will have I will have the live shows starting this upcoming Monday. I don't have the calendar in front of me. Whatever what the Monday following Halloween. How about that?", " We'll have that show and from then on every live show that we do other than the post-game shows the post-game shows will not be turned into podcast. But the Monday and Friday shows will be turned into podcast. You'll be able to listen to them on iTunes and wherever I can wherever I can get it to I'll keep you guys up to date there, but I want to thank everybody for following me everywhere. I've gone whether it was with the pig trailer coming over to the hog Talk podcast. There's some people who still follow me back when I used to stream on Twitch.", " Part of the digital fire podcast. So I really do appreciate every single one of you so that's what's going to change I guess or what's going to be added to the to the roster of things tie Hudson is doing so I've got a I've got a pretty loaded down plate, but I'm really excited about doing it and there's still a conversation to be had about whether or not I'm going to do a middle of the week show for the for the for the podcast but it will be called the pig trail podcast. That's where you can find it and that should be up and ready for you guys to go.", " Oh that following Tuesday after the live stream. So let's move on Arkansas hosting Auburn. Oh my we're coming off a disappointing loss against Kentucky for the Razorbacks. We can all talk about a hundred year check once too kind of brag a little bit about how all their last three losses have been decided by a touchdown or less. It's funny that he knew he completely neglected to mention the fact that one of those losses came to a damn near an FCS program in San Jose State, but are", " Saul's going to host Auburn there Jacob. They're not too bad Gus. Malzahn is Auburn Tigers. They're actually they're okay, even though they're coming off a close loss to Florida. What are your thoughts here with this game going in? What is this? A must must compete kind of game or is it and it doesn't really matter because they're ranked and everyone expects you to lose kind of game. Like, what's your how are you gauging this upcoming match up what the meaning of it?", " So the last year the game was pretty close until about the fourth quarter in Arkansas surrendered to special teens scores. I don't know if the game will be closed. The good thing is it's played at home. But how many fans are going to be there? It's a big big weekend with visitors and stuff and I think it's a crucial game top. I think it's crucial that that Arkansas place close and at least keeps them keeps it within maybe 14", " It's I had I mean Arkansas has it been blown out in the game this year except the Ole Miss game where it was like a 31-17 lost. I was only about 14 points. So I mean you can say the Improvement being made but you can also see that certain players and may regressions. So I'm not going to say Arkansas is gonna compete but I'm not going to say they're going to lose by Twenty One or Twenty Eight at all, either even though I picked up the last week to win. I'm not pick them too.", " With another game this season that gonna cause I'm tired of hearing the proved wrong. So I think you know with it being a big weekend and Auburn's starting running back being out I think Arkansas if they can stop the run and force bow Nixon to some mistakes Arkansas can compete in this game. What's interesting is, you know, Auburn they beat Oregon to start the year off number and at the time I forgot where they're ranked. I think they're they're ranked still in the top 20, but", " They beat Oregon. It wasn't a convincing win or a you know, a blowout, you know, they won that won 27 to 21 and then they went on to continue a five game win streak until they lost against Florida on the road 24 213. I said that was close maybe to them that's not close. I'm sure to Auburn fans that might as well just been a blowout but you know losing by 11 points to Florida, but you got to consider, you know Flores pretty good. Although I'm going to admit I completely thought Florida where I thought they were Pretenders happy they're going to get", " Throttled last weekend LSU and they see they stood ground man. They stood ground. Yeah Florida's Florida's look pretty good.", " So the line is it is right. Now, of course the ESPN football power index has Auburn to No Surprise overwhelmingly favored at 93.4% Arkansas 16.6. Yeah the line what's interesting to me is the spread is at 19 and a half and I don't know like this to me is one where I don't I don't know. I don't think aubert is is that fantastic on offense? I just I", " know that they're definitely way ahead of Arkansas. Like you said Arkansas has not been blown out by anybody and I think you could you could chalk up a you know, I guess you could chalk up a 19-point game as being a blowout or 21-point. Yeah, that's definitely a blowout but I don't know that that happens here. But the line or the money line is that plus 900. I don't know what the hell that means. I'm just going to say it because it's here in front of me on the screen. I don't know what that means the money line, but the over unders it fifty five and a half again the spread is", " 19 and a half obviously in favor for the for Auburn. I asked it every week. Do you think Arkansas covers?", " Yes, I think they cover long pause. Well, it's a 19-point 19. So I mean they better I mean if they don't lose a game by 14 points or more. Yeah, I mean 19 I think manageable if they can if they can I mean the plus side is it's at home. So you're in you're in friendly confines whether or not Arkansas fans will you know show up? I mean, you just don't know.", " So I think they've happened a my cover. I think I'm going to be real. I think this is the first time all year since I've been asking the question. I think I'm gonna take Arkansas to cover. Yeah, I don't you know, we talked about it whitlow's out there starting running back. This guy is averaging, you know, he's averaging what 5 plus yards a carry. He's looked okay in conference play 544 yards. I think he's seven. I think it's seven total touchdowns on the year. I'm not sure if he has any receiving touchdowns or not be at 7 at least rushing. They don't really", " We stretch the field, you know, they've got Williams their leading receiver 21 catches three hundred eight yards. He does have five touchdowns, which is nice. I think for the most part Arkansas is pretty healthy. It's at home. I do think fans show up. I don't know how many I I mean what I guess what I'm getting at is I think that more fans will show up than first expected. I really thought that's all would probably I said talking to my dad. I said, maybe 40,000 I'm", " Might actually find a way to get 55 55 60 thousand people in Fayetteville. Look if you get it just a little bit of electricity going to that place. It can be real markets loud. It gets loud there and we've had two former Alabama quarterback say that that is the most hostile territory they've ever played in and I think that if you get enough people there if it's loud enough, I think they cover because of that. I think that's the fan Factor, you know first SEC game in Fayetteville. Am I right about that? Is that first sec.", " See game in my car. Yeah, it is. Yeah, that's right. We only have two. Yeah, when you look at Auburn here's what here's what's crazy rushing yards allowed per game a hundred and one yards per game on the ground in this day and age that's that is unbelievable. Everybody gives up like 140 like everybody even the decent or the great s easier a really good SEC defense has or given up, you know.", " More than that, I think they've got to be it's got to be the best run defense in the SEC their defensive line. There's no doubt about their defensive line is arguably one of the best and not just the SEC West or just the SEC but maybe even in the country these guys give up 18 points a game to Arkansas is 27. They still manage despite their offense having some some on-and-off-again some inconsistency there according to Auburn fans that I've talked to they're still get they're still getting about four hundred twenty yards a game 193 through the air and", " and obviously they're doing everything on the ground with Whitlow and Company but he's not going to be there. So you wonder if they could contain Nick's I don't know. I think you and I both are pretty skeptical there. What is with Whitlow out. What do you expect this defense to maybe make a jump of the right direction this week. I know everyone's rolling their eyes hearing that but you think there's an opportunity here to maybe two at least at least make some effort where we didn't see against Kentucky this week. You can file born in front of a home crowd I think there", " Could be I mean you get a couple of stops early on in the Ballgame when cam Martin and running back and I think Arkansas, I mean if you start off the game, okay with a couple stops. Yeah, I think I think they might smell blood early. I think they'll be hey we can hang with these guys. Yeah, I think so.", " When you when you look at where our bird is as far as numbers on offense, look they're passing offense is near the bottom of college football. It's like a hundred and I think a hundred and fifty hundred and tenth something like that and passing, you know, they only averaged right around 33 points a game the there's no doubt this team if you wanted to say they had Kryptonite it would be the inconsistencies. They've they've had on offense their defense is their strength without a doubt 18 points.", " Game is absolutely incredible and I'm gonna always mention this day and age because I've I have a I just have a belief that the game of football so geared heavily and favorably towards offensive, you know swords off its a foot. Yeah, and it's probably more so ever than all of the history of football whether it's college or Pros. It's just it's rigged for offenses to succeed if you want my opinion. So if if you're only giving up 18 points and", " Game, that's incredible. Even in this conference where you know, I do think the SE c--'s take a little bit of a step back over the years. They're not what they were five six seven years ago, but it's still a tough conference. And so to have a defense. This is good as there is it's especially when you consider who they've already played, you know, they've played a ranked Oregon team that played a ranked am team and they've played a ranked Florida team and they're still giving up really good or they have great numbers on defense. So yeah.", " This is the question that I think we it's another one of those that we asked week in and week out.", " What are they going to do a quarterback this weekend against these guys? Are we going to see more Switcheroo or we going to see someone step up and be consistent and maybe keep the job through four quarters or do you think it's going to be another it just another week two-headed quarterback situation. Look you have to stick with a quarterback and role within because this week six you're about to this it and Texas A&M and and Kentucky anymore. You're moving into Alabama LSU Auburn this weekend, Mississippi State.", " A Missouri. These are the guys that you have left on the schedule. You better find a guy and stick with them no more musical chairs at quarterback. I mean, I know NYX dark will hasn't played as great as he I mean he had been playing. I mean there's good as he had been playing but look he still completing 60 percent of his passes. I mean, he's not been terrible, but I don't think he's been a Super upgrade over been Hicks who's come in and played admirably in", " In relief Stark of the past couple of weeks, you know, what's interesting that we've seen every week when they've had a swap at quarterback. The guy that guy second half the quarterback that comes in to finish the game looks better. Yeah, is that not strange like and it doesn't seem to matter who it is whether it's starkel coming in for Hicks or vice versa. There's a real there's a real belief that now they're going to have to do something with John Stephen Jones and KJ and you wonder if we see more of this", " More the inconsistencies the mistakes made by starkel and Ben hates not being able to stretch the field and really limiting the offense if they shouldn't just go ahead and throw KJ and that's all local radios been talking about that's about all anyone talks about anywhere whether it's in my live streams on YouTube or on Twitter or Facebook. I really think it reminds me so much of the Mitch mustain during the Casey dick years when our year sorry not plural because obviously Mitch's only here for", " Year, remember the pressure that was put on Houston that to bring in to bring in Mitch Mustang. Oh, absolutely. I was at USC game when when we turn the ball over like 15 times and obviously they beat the crap out of Arkansas in Fayetteville and went on and did great things and Arkansas turn around and found a way to win 10 games, but I can remember the crowd chanting for Mitch to come in and I think it started like in the third core of the second or third quarter and eventually they did they put Mitch in and you kind of", " Wonder if that's not where we're headed with KJ. I don't know in that was going to be my question. I can't remember if I've asked you this before do you think it would is it smart or when you talk about putting KJ in what does that what does it do for him? Does it get him prepared getting him in live-action it gets an SEC opponent or does it may be hurt his chances moving forward because at this point if you play him this week, you don't burn his Redshirt. He's got four games. So maybe it's a smart thing to do.", " What is your opinion on bringing KJ and Jacob?", " I don't think it would be a bad thing at all. I mean Casey dick him. He came in and played as a true freshman as well. Oh and Casey was I mean no offense to him, but he wasn't nearly the quarterback that came out of high school is what K Jefferson was and yeah, this is a different time. You know, this is 14 years later can exudate came in completed 53 passes for 99 or out of 99 was 53 percent completion percentage had seven touchdowns of for", " Pics, that's the I think if you're going to bring KJ % into play quarterback at any point in this year as a starter you play in the last four games that way you can store Redshirt him. Yeah and plus your you only have I think LSU you have LSU Western, Kentucky, Missouri and Mississippi State those last four games. That's not bad. It's not that bad schedule to you know, put into the fire. I mean those are those are three winnable games if you can still consider, Arkansas,", " A 4/5 when team and you play him at LSU, obviously, that would be where his career starts at for Arkansas. I mean, it didn't hurt too bad last time Arkansas put out a freshman quarterback. The last four games of the season is running out Brandon Allen against Alabama. Yeah, but but the thing was Tyler Wilson ended up coming back and finishing finishing out his career he did but I guess the point I'm making is that they did still there.", " The men they put him in, you know through his feet to the fire and and it didn't it didn't hurt his career. And I think I'm one of those who believe that Brandon Allen was a pretty damn good quarterback in Arkansas. I know he was leading up to his senior year. His numbers were very not monitoring their modest their modest and then his senior year he goes off but yet for whatever reason he's still one of the most, you know, you mentioned the last name Alan and people are like that was the biggest mistake to ever happen at Arkansas and it's like well actually if you look back,", " He's probably one of the better quarterbacks right or his senior season was phenomenal. So you wonder if maybe he got a learning experience out of that. Maybe that benefited Brandon to go in against Alabama. I guess it's kind of my point with KJ maybe putting them in against Auburn. Yeah, I'm with you. I think you put them in against against Mississippi State on November 2nd, you know, you've got Mississippi State in Fayetteville just set up perfect. Then you've got Western Kentucky at home. Again that's on the 9th and then you've got on the road against LSU and", " You're down in Little Rock for the Mizzou game. So you get three chances at home in front of a non-hostile crowd. Well, you know until you're getting blown out then the crowd might kind of turn on you a little bit but you have an opportunity to he's gonna miss you. I don't know if it'd been at the thing is is I guess it depends on where you're at in the year to if if you're still fighting and they will because they have two wins. You're still trying to fight you believe Chad Morris doesn't buy into the fan rhetoric. Okay, that would be the dumbest thing on earth.", " To do these players are bought in and believing that week in and week out there still competing to make a bowl game. That's like I don't see them doing that with can I don't I I kind of hope that that we at least see some of KJ I hope we get to see him in four games this year. So he doesn't burn his Redshirt. So we get an opportunity to see maybe just where he's at as a true freshman. I don't I don't see them starting KJ though because at that point you're still fighting for an opportunity to go to a bowl game. And even though I think you and I are on the same page. I feel like they go.", " 3:9 to finish the year off, but I don't know what starting KJ does for you other than get him on the field experience against you know quality opponent. But yeah Auburn this Saturday 11 a.m. Kick off in Fayetteville. Auburn is all of you most of you know there to 1 in conference, they're five and one technically third in the SEC West somewhere you obviously if you're doing a power pole, you've probably got most people have Auburn in the top five behind.", " Bama and LSU believe it or not. You should I mean other than Florida over in the East you've got Mizzou sitting at two and oh in conference play five and one overall record, which really if you look at their their schedule that shouldn't shouldn't I be shocked you? Yeah, they're share their schedules an absolute joke. I mean their upcoming mizzou's upcoming match up at Vanderbilt at Kentucky, but then they got to play Georgia and Florida, but then after that, it's Tennessee and Arkansas, they've got they've got 9 and 3/8 and for kind of written on them, but that's going to be", " Last opponent to close the year out. So I guess I don't know if we're forgetting anything Jacob I guess speak now or forever hold your peace, or at least until the next podcast. We have anything else we want to talk about or is that going to wrap it up? You think how I think that'll do it? Okay, you did want to mention earlier before the show about what Hunter you're a chick said today.", " Yeah, you brought that up about but he said it's quote about the three wins 3 losses. Did I can't remember if we recorded that part or not. Now, we didn't know he put out a on his what do you call it the from the desk of your ad is the name of this little column that he does for our kids are Razorbacks.com. And in there he mentioned, you know, he kind of brings he's it's obviously", " about football", " and what's our excuse me basketball rather, but in there he mentions that you know, Arkansas how nobody's really excited about the three losses. I'm trying to find it verbatim but I can't find it the what he had said, but he had mentioned the three losses and how they were decided by seven points or less and it's like why I get as an ADD and you're trying to address the fans. You can't come off to negative because then it's like you're not buying into", " Going on with Chad Morris and it's obviously.", " You know, I guess I guess what I'm saying is he actually probably did exactly what he should do. Here. It is. I found it. He says in this article says clearly our win-loss record at this point in the season is not where anyone would like it to be a loss is a loss but I am encouraged. I am encouraged. He says that in each of the of our last three games all decided by one score less at the Arkansas or that the Razorbacks had chance in the later stages of each to earn a win. I can assure you that no one is more disappointed.", " I need that. We were unable to do that than the young men and the coaching staff who have to put in countless hours in preparation for the season. I that's not what fans are upset about if anything if you change who one of those losses, you know, maybe turn that into an SEC opponent and I'm talking about San Jose State then that's a different conversation. Like yeah, we all we agreed Hunter but the the conversation has to be had at some point that you just lost.", " Us to an embarrassing a damn near FCS program in San Jose State. That's who one of those three losses are two in front of your home crowd. That's there's no even at a neutral site or on the road. There's no excuse for that losing to someone like that. Now, I know we can't I don't want to beat our fans over the head with that because we've kind of bitched and moaned about that a lot here about that San Jose State lost but for I think 400 a kind of put that out in neglect to put in something about San Jose State, that's the problem that people have", " Yeah, it's the fact that you lost to San Jose State period that's what people are concerned about and I wanted to point that out really quick. I did tweet it. I'll put it out on the Twitter. It's not getting a whole lot of traction, but I wanted to mention it here. I don't know. I don't know what the right thing for him to do. There is if he should have mentioned San Jose State maybe I think you probably should have to some extent like yeah, we lost his hand has a state that's a gut check but you know, maybe you could put in I have", " We could turn this thing around, you know, the typical kind of AD speech but I don't know. I kind of felt like he shot. He should have included San Jose State. That's the thing that we have the the most concern with not the other losses. It's the San Jose State Los, right? Yeah this definitely disheartening but I don't have anything to add to that because you already know how I feel. Yeah, we've beat our fan and really the point wasn't to continue griping about the San Jose State lost. It was the fact that you know, I I like it. I", " She ate the hunter brought up football, you know, and I guess some of already made the argument on Twitter that he didn't have to although I kind of feel like he does. I kind of feel like he's been mostly a little too quiet can all things considered this happen and but for him to at least, you know, give a little hint to the you know to what's going on with football. I guess I guess we'll take it. You know, it is what it is. So, all right well for episode 31 here in the hawk podcast. Thank you guys so much for tuning in as always download these episodes. What are we at total downloads?", " Good like 11. We're at 11,000. Yes. Wow, 11,000. So keep that keep at it guys. Absolutely spread the word spread the word. We appreciate of course as always don't forget to leave the star power behind leave us a written review anything helps. We really really do appreciate go ahead Jacob. Yeah. I want to mention make sure that you tune in during basketball season. We're going to have some blowout coverage of men's and women's basketball this season to that's all I wanted to say to close out the show.", " As well so stay tuned to our Facebook our Twitter our live shows our podcast. They're going to be heavy on basketball. So looking forward to that. Oh, they're doing the unveiling this Sunday. That's right. Yeah. Yes. They are. Hmm. You think it's going to be slobbered hog? I don't I don't think it's hot. I don't know what it's gonna be. It may be similar to what's on but the Barnhill Arena's floor. It looks like that's what I was thinking if I swear to God if it's that forward-facing hog. I'm going to lose my mind.", " I'm not lose it man. I hate that Ford. What's the name of the Lion King the is it Pumbaa or whatever? Yeah, like that's what that is. Let's do away with that. That better not make its way onto the court. I'll be so pissed. You'll be dishonoring Nolan Richardson's name. Anyways funny for the heart Talk podcast episode 31. Woo Pig. Thanks a lot guys. We'll see you on the next show.", " If you haven't heard about anchor it's the easiest way to make a podcast so hear me out. It's free. My father-in-law always says the only thing better than cheap, it's free. So take advantage of it. There's a creation tool that allows you to record and edit from your podcast Rock from your phone or computer anchor will distribute your podcast for you. So you can be heard on Spotify Apple podcast and all the podcast platforms out there. You can make money if you were podcast with no minimum listenership.", " Is everything you need to know to make a podcast in one place? So download the free anchor app or go to Anchor dot f m-- to get started."]}