{"showID": "00i4t4ifo0QAz95oZlnUiV", "show_name": "@ToyPhotoCast", "show_description": "The community of incredible artists that populate the #toyphotography group on Instagram, have a passion for storytelling. Listen to some of the most renowned Toy Photographer’s, along with newcomers, discuss important topics and share insight into one of the most influential movements in Instagram history.  Support this podcast: https://anchor.fm/toyphotocast/support", "episode_name": "Episode 4 - @WorkMoreorLess", "episode_description": "Jason Yang (pronounced yong) is one of the Toy Photography Community's brightest minds and is truly a super-human. We break down his journey and just exactly why he loves this hobby. Join us as we have an incredible conversation revolving around toys, photography, community and everything in between. - @Dagobah_Days  ---   This episode is sponsored by  · Anchor: The easiest way to make a podcast.  https://anchor.fm/app  ---   Send in a voice message: https://anchor.fm/toyphotocast/message Support this podcast: https://anchor.fm/toyphotocast/support", "duration": 86.35153333333334, "transcript": ["The toy photographers podcast we are storytellers. What's up everybody? This is dig a bit dazed with a toy photographers podcast. We have an incredible episode prepared for you guys. We have the one the only mr. Jason Young on the other line. What is up Jason?", " Dakota how's it going man? It's good. Is it is good man. It's good to have you on I know this is a this is actually one of my personal anticipated episode. So I'm glad that you're able to come on the show and I just I can't wait to get get started here. Yeah, me too. Obviously we've known each other for a while. So it's just like kind of having a regular conversation, but it's really fun to be a part of the podcast and I love everything you're doing the last few episodes of just been awesome. It's cooled.", " Like hear more about community members, but from their perspective and hearing their voice. So it's an honor to be part of the group. Thank you so much, man. I it has been a joy to have everybody on the podcast so far and just the community support has been amazing having everybody be able to throw in their their opinions and their Insight. It's been a real collaborative process. So I'm so grateful to everybody is enjoying it and once more content like", " like this, so we're going to keep doing it as long as people are listening. Absolutely your Instagram account man. Let's talk about how you started your Instagram account and where you kind of dip your toes in the toy photography initially. Sure. I mean, I think it's funny like even going back and listening to some of the other episodes. I think some of our stories are similar in terms of you know, a lot of us are like Star Wars fans and with the force awakens that came out and new", " Wars toys and all those things they kind of reinvigorated kind of the kid in us and at that point I was on Instagram and I started seeing some accounts actually posting toy photography was like leaking into my design, you know account my design world and I was just kind of Blown Away like that's pretty awesome to kind of back up I do as invisible element. That's my company my business. I do animation which call motion design design illustration.", " Branding so I live in that creative space and so I've been in the in the kind of production world, but most on the on the post side, so I'd work with editors and you know create these great shows and then I would package them with graphics and so never kind of behind the camera, but it's something I've always was interested in learning how to use use a camera doing photography doing video and kind of around the same time. That's when all this stuff kind of hit with with Force awakens and toys.", " Okay, people are doing this. Maybe it's okay. If I do it too. I'm an adult but I still have still love it. Right, right. Exactly. And it's so funny man that you started around the force awakens because I feel like a lot of people did I feel like a lot of accounts started around that time. Do you agree? I do I think if anything, I mean there are a lot of guys who've been doing it way before that. I mean we're talking like five six ten years before that even kind of cropped up, but I'd say it's kind of a Resurgence. It was just becoming more well known and I think Instagram", " Umm, you know helps out with just being able to share imagery along with story. I think that was just like the perfect platform for more kind of eyes on it totally and so I got ended up getting a camera which I'm still using my Canon 6D does about like, I think it's 2015 like December of 2015 and really wanted to kind of learn how to use it again understanding kind of conceptually how it works in my video production, but never really doing it myself. So I got the camera.", " And then really was interested in trying to figure out how to do low light photography and I had some figures that I received the first black series figure was the Boba Fett like at that point that I got that for Christmas along with like Darth Maul and some of the OG like original Black Series figures, which I love to this day and I had those and like it try to you know, seeing what people are doing on Instagram with toy photography. I'm just going to do it and see where it goes and", " Just learn as I'm kind of playing with the toys and you know had a couple shots and like this is this is really fun because one I'm around toys and that kind of reinvigorating my creativity. But then also I'm learning as I'm doing it, you know kind of adding something else to the the the tool belt of just, you know, creative tools that I use everyday so nice. So when you first started out, did you have anybody that really?", " Inspired you to take it to the next level. I know that you when I first came across your account you really seemed to have a grasp of toy photography from the beginning and like you said you had that you had that background in media and marketing. And so that kind of gave you a step up on you know, your your journey as a toy photographer. Did you have anybody that you kind of tried to emulate or model your toy photography after and the beginning?", " I think most of it was just like kind of Discovery at first. So I mean obviously, you know, there's there's a lot of guys like everybody I think everybody's mentioned. Sorry bananas for the most part Johnny he was as far as like doing like Star Wars toy photography. He was kind of the first where he already had a kind of his his foot planted in the ground. He's been you know sharing stuff and that was some of the stuff that I had seen that kind of to begin with Captain Chaos five models some of those guys were some of the original ones that I remember,", " And it was cool seeing how they they approached taught photography for myself. I'm like man. I don't I don't usually go. I don't want to go outside. I don't really have these beautiful locations. So I thought what if what can I do indoors and again doing compositing doing that type of stuff for video kind of was like, you know, I can actually do this with a computer screen. I don't need to like print out a background even though that works. Well Ram I can pull up I can choose right now. I can go and find", " Find like 10 images or screenshots from movie and then figure out which one works best for this figure which you know, I like the lighting on this or whatever and then kind of just worked on using kind of the screens for my backgrounds because it's just one less thing. I had to think about I didn't have to build a diorama. I didn't have to go and find an image then print it it was just right there. And so kind of I was trying to just figure out how can I do things efficiently in quick and get something that still looks pretty pretty professional pretty solid so nice.", " Did you coin that phrase did you Rama digital diorama? Is that something that you coined or did someone else kind of coin that because I know that like you said that that's something that you kind of specialize in. Is that something that you made up at the time? I mean, I don't I don't know at the time. I was trying to figure out a good you know for myself a name for like what I could call it and that just kind of I like wordplay. And so that kind of felt right? I think when I used a hashtag.", " I think there might have been like maybe less than 10 people who had done it, but I don't really know there wasn't any kind of like overarching like context of like this is using a screen for background. It just seemed like it was kind of random gotcha, but I kind of started using that because I was like, okay this makes sense and it sounds good too. Well, it's Anonymous. It's synonymous whenever I think of your work always think of well, he's got some sort of digital element involved somehow even if it's a you know, you have the practical", " Dioramas involved you do have that digital effect. And I love that. I do enjoy your your digital dioramas that you do and it's amazing how you seamlessly incorporate those backgrounds into your photos. And I think one of the first ones that I really just stared at for a long time was the Jango Fett and you had him just placed on your table is either desk or table and you had just a lamp positioned over head and he was like had a blaster he was pointing down at the ground.", " I was just amazed. I was like, wow, that just looks so real it looks so it looked in scale and looked able to be understood but it didn't look like a toy if that makes sense. It look real right look like an actual, you know a performer or an actor on a screen. So yeah, that one's that also like exactly everything you're talking about. I think that's what I find so but like I get so much joy out of with this hobby is like how do you take a figure that may look amazing? Like a hot toys figure or", " or you know mezco stuff or really anything Black Series take something that already looks pretty good. But how do you kind of sell this this shot or how do you sell this concept and doing things like trying to marry a background with foreground elements with the you know, the subject in the center and bringing in lights that match the background color. Once you kind of get all these of like kind of elements together you can really", " The the visual pretty pretty easy. I mean because even if you've got something in the foreground, it's going to give you it's going to give you more depth if it's blurred out. It doesn't really matter. It's just something there and it makes you feel like you're actually within this scene in that it also helps with scaling to of course, but yeah, it's so much fun and in for me every time I set something up in my head. I'm like, okay, I think this will look pretty cool. But you don't really know until you get behind your you know, the camera like if you're looking at your display.", " Say or looking through the lens or even getting it on your on your computer to edit. You don't really know how that's going to look until you you see the shot and that's what super exciting even if you set it up, you know where everything is, you know, what elements are are being used. It still feels kind of like at this surprised when you actually get that that final shot that you can kind of work with so, it's fun. It's addicting man levels. It is so addicting.", " Do you feel like you have improved your process and your workflow since you first started out do you feel like that time frame that you have? I know both of us have time constraints on you know shooting. Do you feel like your workflow has kind of changed the way you approach toy photography. Are you more methodical? How do you feel like that's changed? Yeah. I think it's that's a real that's a good question. And I think there's a lot of things that have kind of ebbed and flowed from the beginning, you know, really dialing in kind of the did your drama technique and then", " then from there like at the beginning it was just like mostly using maybe a floor and in the did Rama image on the screen and then the figures but then I kind of started pushing out a little bit more maybe using more kind of physical props just kind of fill out the scene and then you know while after that maybe it was more about hey a lot of these guys are using physical dioramas and they just look really good in that being more the focus with the subject. Maybe still using the screen for a sky", " Or just to cast some color right? And then then it's like well, I really want to do an all you no, no no screens want to try. What is it? What can I get with just a full diorama pieces or you know, it's fun to kind of just kind of play around with different different techniques. I'd love to kind of do more, you know, kind of outdoor explosion type stuff, that'd be fun. But it's just a little bit more difficult to actually make that happen. But yeah.", " Yeah, it's so much fun. You guys they do that. Sorry. Go ahead. I was gonna say it's just so much fun to play with different techniques and again being inspired by all the amazing guys here doing other things that I'm not focusing on. Yes. It's incredible it is and you know with the people that are able to go out and do the outdoor photography and you know versus the people who are not able to do that, you know, it's it's a different workflow like people that are able to have that, you know,", " environment where they can manipulate every single and you know setting and every single every background, you know, like you were saying, yeah, you're able to control the end product so much easier versus going out in the elements and you really have to have a feel of how the day is going to go when the lights going to be there and it I feel like, you know, not saying that one is better than the other because they're they're two entirely different types of shooting but I feel like when", " are able to go out, you know outside in the elements that you you know, it's almost like it's almost like painting, you know, like painting a portrait but you have no idea where it's going to go. You know what I mean? Like, yeah, you don't have you really have an idea you want to feel you have an emotion that you want but you really don't know because there's so many variables when you're out in the elements universe is shooting indoors and having those shots you're able to you know, you're not be like it control exactly and people that are able to do the outdoors.", " And able to control and master it. It's amazing. It is really is it's a different level for sure. I've tried it many times and I don't feel like I've succeeded so far but I definitely enjoy doing it. Yeah, I feel the same way sometimes honestly, so those guys props everybody who goes outside and shoots. Yes, you're incredible and inspiring so keep it up incredibly inspiring for sure for sure. So do you approach toy photography for the enjoyment?", " Enjoyment aspect of the process or do you do it more for the posting? Because I know a lot of people enjoy the process of toy photography more than they enjoy like the community aspect and then some people love the community aspect more. What do you feel like you enjoy more the nice thing is that I actually enjoy both sides of it. I'll gladly answer your question. But know the process to me is exciting again being more kind of creative minded. I", " Of to I mean just the whole process and trying to figure out how do you how do you get the shot? Trying new? Like I said tick Trips Trips tricks and techniques or even just new new tools. So if you're using like practical like fog or smog in a can or things like that seeing seeing how that changes what you can produce I love that side of thing. I love the creative like being the", " Creator and in bring it all together and seeing what you come up with but I would say what keeps me in to a photography is the community not necessarily posting the final shot and getting you know comments and likes and all that stuff. But it's this type of thing where you and I we met over our love for toys, right and we're talking about it and it's something that I think everybody needs something that they're passionate about that. It's not about making money. It's not about getting notoriety. It's about something that you just", " I love to do and knowing that there's another you know, there's a ton of people who come from different walks of life that do this and we have this really great Community who loves to share and who loves to be inspired by one another lift each other up. That's what keeps me in it because I mean it at the end of the day if you're only going off of what your return on investment is, like if you want to put it that way sure there are some shots where I'm", " Like hey, this is a great shot and it gets like 230 likes Ryan some other ones get over a thousand or whatever it is. It doesn't really matter the numbers. But if you're just basically kind of going off those metrics then at a certain point you can be like, okay. What why am I doing this? Yeah, and the reason for me is the community in the relationships. So I love that. I love that, you know having that burnout kind of happen whenever you're trying to just gain momentum in likes or", " Is it yeah, it's exhausting and it's a never-ending goal. You know, what I mean? Like is 10,000 going to be enough 20,000 30,000. When is it end? And at the end of the day like you said thing that's the most enjoyable aspect for me to is being able to you know connect with people like you like minded people who enjoy the Hobby and who enjoy creating content that's going to inspire and uplift and be able to you know, I love what Jesse said on the previous.", " You know, he does a picture and a help somebody through their day and it just gives them a little boost, you know, and that to me is worth it, you know the investment that I made figured that I purchased a diorama I made by hand or whatever it was that to me was worst, you know that investment. And so that's amazing me I love this community people that don't really understand the toy Community maybe that are looking out from the outside and and I just encourage you just to get in.", " I lived in the people that are out there putting out great content there so accessible, you know, if you want to be able to learn just send us a message and we will help you man. Just be approachable. Of course, you know be respectful, you know, you don't want to yeah, you don't want to foster a community. That's disrespectful. That's something I definitely don't want to have especially on, you know, our personal, you know pages that we like to do like we want to be respected and we will show you respect as well. So yeah.", " Yeah, and that's that's another thing. I would say just in general the community is great at sharing at interaction inspiring uplifting. But also, yeah, you're right. I think everyone recognizes the amount of effort that we put into our own work in so even if somebody's inspired like oh, wow, that's shot that you did was great. I want to try that too. And a lot of times people will attempt it and say hey I was inspired by so and so you go check out their work and so over and over again. I'm seeing more of that.", " Type of attitude versus okay. I'm blurred in this new thing. I learned what looks best as snow like what what is it flour or baking soda? I figured this trick out this technique now, I'm not going to share it with anybody. Like usually it's right opposite. Like hey guys, I checked check this out. This is what it looks like with flour. This is what it looks like a big mess on whatever it is, you know, people are so so willing to just engage and like you said, usually if somebody gets used me a DM and I see it like I'll reply and say Hey, you know that", " X4 reaching out. Even if it's just asking a simple question or whatever it might be. So again, you know, obviously you give people respect then that's how you'll get respect to so exactly love the community love the community me too, man. So I'm curious. How long does it take we kind of talked about this earlier about your process. How long does it really take on the timeline that you have a shot in your mind till you get the shot?", " Ready? Sure, you get the process going and then it's able to be posted. Like how long does it take you because I know it takes me you know, let's just say I have an idea I'm always got ideas. Right? So we're all as toy photographers. We always have ideas and shots that are kind of like maybe a bucket shot or a shot that we've been wanting to do. But whenever I set up and from that timeline, it normally takes me about 10 hours from being able to shoot and edit and then post how long does that take?", " Take for you to do. I'm curious. Yeah, I it's fun because I kind of experimented with it a little bit. Obviously the more you do a certain technique the the more efficient you become or if you're able to, you know, keep things set up overnight or for a few days like you're shooting in a room or something and you can just leave all the lights up that makes the process a little bit more, you know more efficient I guess but you know, honestly, so, I'm sure most people I like this too. I mean, I'm also a collector I love just", " Having the toys and being able to have them in my office like as I'm working. I usually have like a few figures that are on my desk in front of my in front of between am my computer monitor and it might be a few figures that I've planned to shoot next and they're just kind of there and I might if I'm waiting on some client feedback or just need to take a little break take a figure maybe pose. It just see what I can do with the figure and you know, that kind of helps me before I actually get to setting up the the shot.", " That helps me kind of visualize. Okay. Oh this you know, maybe get Spider-Man in a certain pose and see what angle works best. Like, what's the best silhouette if he's you know, all crouched up and he's got his arms out and is one leg is forward and one's kind of bent back behind them. Like what angle provides the best silhouette so I can I can kind of do that while I'm in a sense like during the day like while I'm working more or less good and so I usually will have a figure there that helps me kind of", " Just while I'm coming up with the idea help me feel like once I step into the room when I'm going to start shooting. I've got a couple of options from they're setting up depending on what I need to do. It can take maybe 30 minutes to an hour just to kind of get everything right and then take a few test shots, see how things are looking and then maybe, you know do some adjustments and then after that I'll probably spend two hours if maybe maybe more maybe less depending", " But when I set up I like to get more than like one or two shots, right? I want to use that set up again. I like efficiency. I like to get as much out of it as possible. So maybe even uses the same setup with like the Cantina or the Smugglers retreat but shoot for different figures that work with it with a similar setup or maybe different angle, maybe change the color of the light. So it doesn't feel like the exact same thing. So I you know kind of just depends but I did this all at night after", " My family's kind of gone to bed. So I've got a little time where I can just focus. Nobody needs me. I don't have to you know, I don't do it in the morning where I only have like 30 minutes before I have to take kids to school. So I've got time and it's really up to me like how late I want to stay up to it and it just rains it's the morning so do that get the shots and then once I maybe it's the next day, I'll pull all the shots off the camera and put it on my computer. I use Photoshop to do a", " the editing the raw editing and and adding effects and all that stuff. That's just what I've done for years. So it makes the most sense and I'm I'm fast at doing it and then I'd spend maybe for each one maybe 30 minutes just to touch up most of the time. I'm sure all you guys can can can relate there's always tends to be like dust or Little Fibers or things like that that you don't see until you actually blow up the shot on your screen you like. Oh come on or like a reflection of like the hyper real.", " It's better that I just shot reflections of the ceiling fan in his helmet, you know, like stupid things like that. You don't notice until you actually get it up in your working on kind of the editing side. So, you know spend anywhere between like 30 minutes to maybe an hour on some of the individual shots, but then I've got, you know, five six shots from that session that the shooting session that I can kind of post overtime or save a few and post a few weeks afterwards, but", " Again, just try to be efficient with the time that you're spending because we spend a lot of time doing this. So it's true and I've noticed that you kind of have moved away from your three post theme shots and you've kind of gone more of a individual shot per shot. And when I say that I mean your Instagram layout, so the way that when you look at your feed you used to do the the three-shot themed and is that something that you kind of just over time?", " Moved over just because of necessity or what was the reasoning for that? Well, I it's funny. I still in my mind. I'm always thinking. Okay. I still want to have my rose nice and tidy and actually the last like the Vader in the some of the Power Ranger stuff. I shot recently. I did three of each of those but sometimes what I'll do is so if you kind of go back through once I've completed a row, I'll have like maybe a grouping where it's like to", " on a row and then one kind of straggler and then right above that there will be two more from maybe that session. So there's like a grouping of four and then two that are stacked on each other that might go together or it might be one row that's like completely just random but then I start back up with maybe a full row or you know, it kind of will it will change I'm always using that mindset but I was getting to the point when I was like man, okay, I take shot. I've got to get three shots every time I shoot. Yeah, and it was it was it was just kind of silly and like I don't need to", " This and once people see one shot from the setup. If you're showing the same thing if it's just a little bit different it's not as interesting. So unless they're like really Dynamic and maybe a little bit different maybe the same figure. Maybe I'll just do like one or put now that you can do multiple images in one post you can do that before then you can you know have like five images from the session just in one post. So yeah, you know, you don't want to spam everybody it that can get annoying when it's just the same thing over and", " Over again, so that's true. And I'm glad that you said that because I have attempted to do this three-shot seemed Instagram groupings before and it is exhausting because you know, you do have that one, you know, perfect shot that you had in mind and then you kind of have to frame that perfect shot with two other side shots and it's it does get repetitive. Especially when you're you know, looking through someone's feed and you're like you kind of know, what's the filler shots and what?", " The shots that are like, you know the actor seaside. Yeah, exactly. Exactly. And I think for me I've kind of moved away from that to just being able to focus on I love what Trevor Williams always talks about. Is that quality over quantity. Oh, yeah, and he is a master of that phrase. Like he will only post the quality, you know, he doesn't just post the post and something that I kind of look up to him as a as a", " forerunner and that aspect and you know growing as artists that's something that we kind of have to balance and juggle is like I want to post because I want to put for as my creativity but at the same time I want to put out what something that's going to be enjoyable and something that's my best, you know, because you don't want to just throw something out there that it's just filler, you know, exactly. Yeah. So I mean, I'm always just because of the type of personality I am", " I'm always curating everything I post and thinking ahead of what's going to be next or what my row will look like so people still can see that I feel like I've I've gots there's some intentionality behind when I post versus just like here's a shot post. Here's a shot. Here's one right. I still am curating in a sense, but try not to be as obvious with it. So ain't going back to the Mantra of the toy photographers podcast that we are storytellers.", " Eller's that's something that you kind of emulate so well is that you're always telling a story and your shots. It's not just you know, just shots that you throw up there. You have some sort of element of Storytelling that you're doing and there's a lot of emotion. I think that's why so many people are able to connect and to enjoy your content so much and that's one reason I do, you know is just a storytelling aspect and the imagination just kind of is able to run with your shots and you post you know, like right now I'm looking at a dart.", " All shot. That's a portrait, even though there's not a lot of context the emotion that's kind of, you know emitted from that shot. You know, I'm thinking what is he looking at? What is going on? You know, what is he thinking and the storytelling aspect is what I enjoy so much of it. So that's something that I really appreciate from your content. Well, thank you. I mean that's that's what I wrote. That's why I respond to as well. There are times when I'm just posting a figure because I think hey, let's if this was like a product shot.", " But how would that appear? You're not surely focusing on? Okay. What is this this character thinking so there are those that are just nice to kind of like I just want to take a picture of this photo are take a picture of this character and you know set that up and I love that but also, you know that can get kind of dull for me. And so I like being able to take it takes more time, but I like being able to think more conceptually of like, okay, what would be what would be funny to?", " Put this character like what situation would be funny or interesting or how do you bring a couple characters from different universes together in that? Ultimately? I think one people respond better to there's so many people in the community taking amazing amazing shots, and they may just be like, hey, there's the figure beautiful scenery, you know action pose Action Shot whatever and it looks amazing, but I think it's really the stuff that stands out are the things.", " Is that have a little bit of thought and concept behind it? Right? Because it just it's just different from what you know, what a lot of people maybe tend to lean towards but again not taking away from from their craft at all. But I'm just drawn more towards like you said kind of the storytelling or the the thought behind what the scene is I suppose and you know, it's proven that emotion, you know is kind of the key to Long.", " Her memory. So if you have an emotion tied to a shot, you know, you're going to remember that shot and I love when you're able to either get a laugh or a maybe even a contemplatively shot where you're thinking Hmm, you know what's going on here? And that's to me the most compelling, you know content is when you're I'm not the best personally at the at the funny shots. I I tend to deline more dramatic serious. You sure hero pose or", " Or you know Batman standing over something and brooding or right, you know what I mean? But but the people that do the people that do that, you know, the funny shots like you've been doing a lot of great content with that that hyper-real Darth Vader which is so funny with the the little things that you included in those shots. Do you do you feel like there's some people out there you want to give a shout out to that you love that are the more humorous Instagram accounts. Yeah. I mean, I think obviously there's a", " Two guys that I kind of run run with quite a bit. So every day I'm talking with Spencer with sweet pics Isaiah Takahashi. Yeah, but look sirs. I joke, I sometimes will I call on black seriously? But yeah is that it's good. Yeah. Let's see Richie Sonos rain and Jack's plastic action.", " I mean everybody if you're in the community, you're familiar with those guys. I talked with them regularly like probably every single day those guys each one of them they inspire me and again, I think so much. It's not really even like one person or you know, three people if you asked me to tell you what are the top three people that inspire you or whatever that I stress out even thinking about that because there's so many people who I greatly admire greatly.", " Who are doing such great work and even people who are building their own dioramas and focusing more on that people who are building little props Dwayne shoots toys recently. He's been doing it at he's always been doing really elaborate setups, you know, you can you know, printing out the wallpapers and posters and all these making these little little props that are just they're gorgeous like", " Again, that that's inspiring to see there's people who are doing Lego toy photography that are just insane the amount of time. It takes to build like a Lego diorama. I know in in light it and that type of stuff or like I said, even the Practical going outside and figuring out how to shoot with fireworks or indoors with diorama. So there's there's so many guys doing it and I think there were call it speaks for itself.", " So the ones that are humorous the ones that take it more seriously the more that a indoor versus outdoor, there's just there's so many great talented folks that might get to talk to and and kind of been our estimate so an inspired by so nice I tend to I guess I don't put people in boxes. I wasn't meaning that at all should not sure what I meant was just really when I ever whenever I think of people that are you know,", " No humorous. I think of like the hot Kenobi's or like yeah, I think of you know, like you said you mentioned plastic action. He's got some great shots that always crack me up with his plastic Ballers shots that he does and you know, when you when you Branch out and start doing different themed shots, you know, it doesn't really put you in a box because toy photography is Limitless. There's just endless amount of creativity that you can put into it and", " For me personally, you know, I you know, I toured a gravitate towards the more humorous ones because sometimes you know, you may be having a tough day. You may be having you know, something serious happened in your life and seeing a shot that's going to crack you up is take you away for a second and from reality and you know, just lighten your mood a little bit and then you're able to get back into the day. Yeah, that's something I enjoy so I'm curious just kind of", " of changing topics here shortly. We mentioned in a previous conversation between you and I you know, our our love of Star Wars the Black Series that lined the a figures do you consider that to be your favorite line of figures to shoot or do you have another favorite line of action figures and you know, what is the reasoning behind that? I'm curious? Sure. I mean, I would probably I would have to say the Black Series line has been my favorite it kind of got me.", " Do it Star Wars is my favorite IP and there's there's there's so much content that you can shoot around in the Star Wars universe. So I've got a lot of those figures. I mean, I've got almost almost all of them got slowing down a little bit. But those those are just fun to shoot at the price point, you know, 20 bucks a pop. Sometimes you get them cheaper than that and you know, you find good deals. It makes it easy to kind of expand your collection.", " Even without like completely breaking the bank. I wouldn't be able to shoot just like strictly hot toys or 1/6 scale like some of these mazing other guys jobs to those that can right, right. Yeah. I am blown away. So the six-inch line the Black Series. I've got the most of that. So as a collector those are fun to shoot but you know over the years just being in the community and seeing other people. You know, what", " Love I mean, I know you you love all the mezco stuff. Like that's you know, the 112 you love you love that and so seeing guys like you shoot that stuff. It's inspiring because of being in the community. I'm was aware of it. I've got I've all I've got only got three of them. So I've got the Spider-Man homecoming Spider-Man The Wolverine the brown and yellow and then the Gomez and there they are incredible. Obviously, you know higher price point.", " But they are incredible figures so they are as much as I love just like the black serious stuff.", " And Marvel Legends, there's so many lines that are just they're inspiring and again, I don't like doing just one thing. And so if I'm in, you know, just shooting one line of toys. I get bored with that easily. So kind of branching out doing other things outside of Star Wars. I mean, I love Ninja Turtles growing up and I the the 1990 NECA stuff that they put out those figures are incredible. They're just like the", " Perfect sculpts and Recreations of the figures and I don't shoot them much but I have them and I love them because of what they kind of do for me in my Nostalgia and what I remember but you know again like the mezco stuff so highly articulate highly detailed I should say. Yeah that they just look amazing in shots. So I like variety but if you were going to say like what's you know, what's the thing? I collect most it would be definitely Star Wars Black Series stuff.", " Gotcha. So you're more of a 1/12 scale kind of guy versus the 1/6. I know you have a few hot toys. Yeah figures. So do you prefer to the shoot? The 112 versus 1/6, I would say yes, because a lot of it kind of logistically with having scaled, you know scaling up.", " Sometimes that could be more challenging than having more like diorama set pieces that are to 112 even if you need something like a little sofa or whatever might be like, there's like 112 like scale dollhouse accessories, you could buy or you go to the Hobby store and grab things. So sometimes it's easier to get that type of stuff and I'd say it's kind of the primary line that I collect one for price, but also kind of availability of", " Other like other props and things then also it's just it I feel like you can you can either go really tight and get some nice like medium or tight close-up shots of the figure at that scale or you can go really wide and see more of the scene when you go up to like 1/6. I feel like you're kind of in maybe a little bit tighter, but you're able to see more details and they look so good so but yeah one 112 is problem my go-to for sure.", " Nice nice me too, man. I love the 1/12 scale and I've kind of you know gone back and forth. And I tend to have a rabbit Trail mindset whenever I'm looking at figures or pre-orders and I'll get excited about a certain line and then I'll remember. Oh, yeah, there's this coming out to and it's as a collector. It's impossible to be able to keep up with every single line and every single series of characters and I think that's one of the more enjoyable aspects of the", " Photography Community is being able to see other people pick up figures that maybe you were interested in but you just didn't pick up because of budget constraints or whatever. It may be and then you see them doing those shots that you maybe you had in mind. I've seen that happen many times. I was like, oh I wanted to do that Shawn. I'm glad they did it and it's not like I'm jealous at all. I'm actually happy that they made the shot that I wanted to make and so I don't have to in my mind go out and purchase the figure because someone did it, right exactly. So it's", " It's funny to look at it from that aspect and enjoy photography as a community and as a creative collaboration. Yeah, it really is. It really is. Well, we're going to take a quick break and we will get right back to the toy photographers podcast. Stay right there.", " What's up, everybody? This is Dakota from Dagobah days with toy Federal cast. I'm telling you about anchored the program that I use to make this podcast first off it's free. So there's no charge. All you have to do is just go download the app or go on the website and they give you tools to actually record and edit your podcast directly from the app. They are incredible. They actually distribute your podcast for you. So if you want to be heard on all the platforms available, they", " Do it for you for free and greatest thing of all is that you can make money from this thing and it is no minimum listenership required. So if you want to make a podcast if that's your thing go out there. Try it on anchor download the app or go to Anchor dot. F m-- to get started and remember everybody. We are storytellers piece. Welcome back to the toy photographers podcast. This is the second part of the Jason. Yeah.", " Young interview get your cup of coffee ready? Because this is going to be an invigorating interview my friends Jason Young your back. Yes. I am in actually going to flip it around a little bit. So all right everybody welcome back to the toy photographers podcast. We were with Dakota Spicer. Welcome. Yo, yo, yo, what's up how much actually I was interested for some people they know that you're there go to Dagobah days customs and so", " Something we have been able to work on together, which has been a blast is a little project. You've been working on for the last few months, right? Yes, let you tell us a little about a little bit about what it is that we collaborated on together. Okay? Well, I'm gonna have to go back to the very beginning so man. I was working at a factory couple years ago and was just kind of I saw this post and my friend and you know, she's like an", " Little person and was like, you know, if you want to like move on with your life like you really just need a dream yourself out of the old season and into the new I know that super-spiritual maybe people who aren't like into spirituality whatever. I'm just like, you know, just ignore this segment, but I was like, okay, how do I do that? Practically speaking? How do I dream myself out of my old season and into a new season, so I was like, okay. I love toy photography. I love action figures. I love dioramas boys. Wanted to make dioramas and I", " Just grew up in a very creative household always creating always making things by hand and I love Star Wars 2. So I just kind of started just daydreaming while I was working at this Factory and I was like, what could I make, you know, maybe be cool to make a Star Wars, you know diorama that people could you know, not only recreate certain scenes but use as you know multifaceted experience to be able", " all to you know, create scenes like with the black series figures are figure arts. And at this at this real quick at this point, you've already kind of been a part of like the community so you'd see yet people doing tweet ography and probably building dioramas as well. Right I had and I was you know, at the time I was not as involved in the toy photography aspect. I was more in the to the creative aspect of creating things and so it kind of you know,", " Goes back and forth and that process and so what I did is I had reached out to you and I think I've reached out to a couple other people. I've just kind of picking their brains about you know, how do I do this? If I want to do this? What do I do? And you had hooked me up with was figure works and he let me just say is the most incredible dude hands down really it is such an incredible guy. So humble so approachable and I just reached out to him. I was like dude I have", " this idea. I want to make a diorama that's based off of you know, the Cantina scene in A New Hope and he was like, okay. Well, this is what you have to do and you just started laying out all the framework and you know, you know, long story short. We basically started brainstorming and we had we had a product that we could be able to create and so he gave me the scene specific dimensions for for the scene and I was so grateful because he", " All of this knowledge and I was able to just take that knowledge and be able to create and you know, I went through a couple of different processes and creating there's different versions that we made along the way and we came up with this modular version of the Smugglers or treat man. It's just it was so much fun to be able to do that process and now so moving into the process of actually pre-orders and everything sure that was that was a learning process.", " Is that was annexed random that was extremely fun. But also taxing learning process because I had to just be glued to my phone for every DM and every single, you know opportunity to respond to customers potential customers. And you know, I'm I was learning I was you know, learning the process of how to be able to be an independent diorama maker. And yeah, so so if I may I would say the other the other thing about that is that when you started and we started you know you", " You sent one to me. We started shooting it along with a couple other guys and really it kind of opened our minds up with it being modular and kind of creating these different scenes taking those shots giving them back to you and it helped you have things to actually put forth important to come in the community and say hey building this together kind of collaborative, you know with with all of us and people could see what they could do with it. And I think maybe part of it was like maybe the", " ation in everything you created was such a high quality. I'm not saying like toy photography just the piece that you created such a high quality that people responded so well to that. I think I mean you it sounded like you got quite a few people who actually purchased and who were just really excited you get reposted several places. And so you just from the beginning you were making a solid product and doing that, you know, and it's", " Thinking, you know the collaborative way that was that was pretty cool to see and be you know, honestly be a part of I was I'm so grateful for the opportunity to be able to work with you guys and the C3 Bros and being able to send you guys those prototypes and you guys gave me some great feedback and I was able to adjust in like some of the things that you had mentioned like for instance the in inside wall. I had left unfinished on your guys dioramas. And so you're like, hey, it'd be a lot better if you went.", " It back in and just kind of made the whole thing, you know have that texture in that field. So that way you could have more opportunity for different shots. And so that was a great feedback, you know learning from my mistakes learning from little things and I make all these by hand. I don't have any instruments like that are writing and everything's by hand. So it's a one-of-a-kind exactly. Each one is unique. Each one is painstakingly created and crafted for each customer. And so going to the do the", " I said the pre-orders, you know, I didn't realize when I took on this project how I was going to really do it, you know, and that's kind of my I wouldn't necessarily call it a method but it's kind of my way with all of the things that I do I just jump in and I figure it out along the way you don't have to really know everything to know to be able to do something and you know people are willing to work with you when they know that you're learning and you're approachable and so my customers, you know.", " I'm still I'm still crafting orders instead of still shipping out orders. You know it originally I was slated. I wanted to finish the entire project by summer, but it's kind of I've had some family issues come up and it's pushed back by its pushed back a lot of orders and you know being so involved in my family and my wife's mother actually got cervical cancer and that really, you know, kind of basically halted a lot of production because she moved in with us and we were you know,", " Care of her and so not to get too heavy but just draft process alone for like learning it is and learning how to manage and juggle all of the orders along side of doing a all my other things that I'm doing, you know, it's definitely been a process, but I'm so glad that I never gave up and I never I never threw in the towel because at some points it really was stressful because I want I want I can hold myself to a very high standard and I think it comes from my upbringing.", " Me and my family and I have you know, my grandfather was in sports journalism for 20 years and he's just a master at speaking and and someone that's very influential in his craft and I hold myself to a very high standard because of because of his influence in my life and all these other aspects of my history my family history. So when I whenever I don't feel like I'm you know performing and creating at my best, you know, I get very stressed.", " So it's been it's been a learning process has been a you know, there's for instance like even the little metal bars that go behind Han Solo's head when he's sitting on that scene. Yeah, you know I had no idea how I was going to do that whenever I put the actual pre-order process up and I didn't actually have that because I remember I had done a different version of it. Would I what I had done was using wood wooden dowel rods right? And those were you know, they were worth", " They were but they were the nice to upgrade what you figured out like all those little details that you added and then some of the 3D printed pieces that you worked with bigger works on like it just again like you're talking about you continue to push yourself and elevate your craft. Listen to feedback and ultimately all that does is just kind of like with the community ultimately we're building each other up and you can see the difference from where you started and where you are now and I imagine", " Your heads going for the next thing, you know, I can see that you're just always paying attention to those details and winning just improve things. And so that's that's another reason why I think even though all these things, you know life happens to all of us it does. You've always been really good at communicating with your obviously the clients but also the community to like, hey, I'm working on this stuff, you know, kind of got behind on some things just telling people like hey, I've got to put this off for a little bit.", " If you're if you're just communicating and letting people know and being cool about stuff you get a lot of Grace back and I know that's probably stressful for you as well to feeling like oh no, I've gotta tell everybody that I've got a delay it by a little bit a little bit but I think we all understand that life is the first thing we got to do and then we do this kind of for fun and enjoyment, but I've always appreciated about about you that you you genuinely care about people you care about providing.", " You know a great product and great service. And yeah, I think that's another reason why you are also a great pillar of this community as well. And thank you so much. Do you I really appreciate that. It doesn't always feel that way and you know, our minds can sometimes be you know, the worst down worst of critics. And so I appreciate you saying those things. It's something that I love to do and when I'm doing it when I'm creating those dioramas I get such Joy.", " And I know that when that person gets that diorama and they, you know are able to create or maybe you know, some of the people that have gotten these dioramas just strictly use it for display and that's great. That's true. And it's something that I just have a deep appreciation for all of my customers and I want to make sure that they feel taken care of and you know, they're appreciated and you know anybody that wants to get anything personally designed and made by me.", " Your figure works, you know, we take it seriously, you know, we really do it. It's an investment. You knows. It's an investment and you know, it's not something that it's not something that we want to you know, just put out product. It's not enjoyable because I want to enjoy it if I'm enjoying it and I feel like maybe someone else will enjoy it. So definitely definitely well. It's like I said it is so fun to work with you and I know there's some other things that you're working on I think so anything that were able to kind of collaborate.", " On in the future is always just a blast. So I'm excited. I'm definitely a proponent for you and everything you're doing for the community. Thank you, man. Thank you. Yeah, I will give a little teaser. If you're if you're give if you're a fan of Han Solo and you like the Star Wars the Black Series stuff look out next year pending everything gets finished with the Smugglers Retreats. I want to open up a pre-order hopefully in February and it's going to be", " Turn the Jedi theme so I'm not going to get any more specific. He's like NW something. Yeah Return of the Jedi Han Solo. So you might understand what I'm saying? Okay, okay, but and then I'm also get that one an eye on ice for a little bit. Yes. We'll put that one on ice. And I also I want to do a batman-themed diorama like a big project and it's going to be limited. So I'm you know, when I started out to smuggle to treat I just kind of opened up, you know.", " Oh infinite amount of pre-orders. I got 25 orders of the Smugglers Retreat. So I was very blessed to have those many orders, but I didn't realize you know, like I said the amount of time it would take to do those. So I'm going to do a limited run of both the the next to pre-order so it'll probably be anywhere between 10 and 20 awesome. So you'll come with us. We'll keep us posted probably here to have stalkers podcast toy photo cast, but then also like dig of the day is taken", " It's Customs, make sure and keep us updated right I will keep everyone updated there will be plenty of time to preorder. I will probably have a two-month window to pre-order. So that way everybody can get the funds necessary to be able to place a pre-order. Nice. Can't wait to see it. It's going to be amazing. I can already tell so thank you man. Thank you. I'm excited. It's going to be fun. So I'm going to go ahead and switch the mic back around. So now we are going to finish our", " our incredible interview with mr. Jason Young. Hey, how's it going for talking about podcast? Hey, it's good to have you back. Hello. I have a question for you, sir.", " I asked the amazing this and that episode has yet to be released but I asked him this and I wanted to ask you this as well because our curious do you see yourself as an influencer? And how does it really affect you, you know being an artist with that big a following on Instagram. Do you see yourself as that? Is that something that you were constantly aware of if we're talking about influencing? I mean, I guess there's different ways you could could could approach that.", " You sure strictly speaking. I mean, I think there have been a few times when people will send me DMS and say what do you think about that like the hyper-real Vader and I might talk to them or or they might send me a had a couple people who sent me messages that okay. I'm I was on the fence, but now that you, you know, did the unboxing video you took some photos and I can actually see with my eyes how things could could be if it's you know with with them they can kind of Envision it you you", " Me over and I'm definitely going to buy that so there's been a few times when I know specifically people have his said okay, if you if you love that that figure if you love that died or whatever it is then I trust you and I'm going to do it or hey tell me about those lights that you got that you've used for the you know, the last setup or grass mats or whatever people might reach out and I can say oh you should hear I got him here then a couple minutes later. Alright, I just purchased them. So from a from like a strictly like it.", " Influencer doing what you're supposed to do to get people to buy product. Maybe I that's happened a few times but I do the same thing with anybody who who has something that's interesting and I can say oh man, that would make my process better or make my shots better and I think in a sense everybody's kind of an influencer, it's always hard because obviously I've got I've had a good relationship with Hasbro and you know some other some other companies and like your toy link and", " Towering toys and you know some other people that I've been working with over the years that it's just had good relationships with and so from an outside perspective people might say, oh, well, he's working with these companies and getting product to shoot and all that stuff. And I mean, yeah, that's that's cool. I don't know if that makes people say like, oh, hey, he's he's a real influencer. He's a social-media influencer. My wife actually will kid me about that.", " I will she yeah, like she yeah. Hey, this is this is my husband. He's a social media and like stop she's proud of you and so funny she is and I love her. Yeah, I mean maybe from accent but again, I just love I'll kind of go back to it. I just love being able to share techniques. I'm using products I'm using you know, and also be honest, so even there's some stuff that I might get like, yeah, I don't really doesn't really do much for me or this thing.", " Immediately out of the box and I'll be honest with people. So who knows, you know, it's interesting that you look at it that way because you know, there's so many people that do look at people like yourself and other people whenever they get the products and from Hasbro or from whom whomever, you know, they do really take your opinion seriously because you're able to get those hands on reviews and I know like I mentioned DM azinger", " Earlier, you know people really take seriously his thoughts on a figure. Yeah and reviews are awesome, man. They're so good. And you know, it's so funny about him is you know, he only reviews the things that he really enjoys and then something that you can kind of, you know, tell whenever he's doing a review and he focuses on the good, you know more than the things that he doesn't enjoy being I guess when I say influence her I don't necessarily mean that in a negative connotation because a lot of people", " I guess see being an influencer as someone that just kind of pushes their opinion on everybody and that's not what I'm saying. I'm okay. Yeah. Well when I say an influencer, I mean someone that is a positive force of spreading basically your thoughts on specific subjects and people taking those and of course you're going to make a decision whether or not you want to purchase something on your own or what are you know, even from a creative aspect you are influencing people creatively, you know through the way", " 1812 the Tog Rafi and you're behind the scenes. So from from here on now anybody is listening this when I say influencer, I mean that as a good thing, I don't mean that as an egg as a negative thing. Maybe it's gotten a bad rap. Yeah, it's possible. I mean but yes, I would like to think I just love I love people. I love talking know I love engaging with people and so I think just with where we are in society. It's so easy to jump on and hide behind social media and", " Really say what you want and be ugly and man it just we need to not do that. I think that's what's so enticing about this community is that we're more I would say we're more positive than we are negative. I hope that when people reach out and they send me messages and have conversations with people. I hope people get that. I don't ever want to come across as you know anything other than hey, I'm just like you as a matter like like, you know, there's always going to be people who have a better bigger following or more more like sand.", " More, you know more relationships or whatever. It is. Like it doesn't really matter. I just hope people just recognize that I'm just part of the community is everybody else's so exactly and there's no like Instagram royalty out there. I mean, of course people like people like to consider followers as something to base a specific type of following. You know, what I'm trying to say is it doesn't matter. It really doesn't and you know people in this community", " I mentioned this before on the previous podcast, you know, if followings they happen as you progress, you know, as your content gets better and more refined you of course that just happens. Yeah, it's just a part of something you can't control, you know on Instagram, especially with today's algorithm and the way that it's regulated and you know, basically it's a money pit if you want to spend lots of money, you could get tons of followers, you know, but it's not worth it. It's not worth stressing about all that stuff. Anyway l so it's not over stressing it at all, and I'm", " Just glad that you do see yourself as someone that you know is able to make positive reinforcing opinions and being able to really encourage and craft a community that's going to be potentially could last for a very long time. I hope it does I think so, I think so. Do you have any wins like when I say wins, do you have any like big moments that you look back on your on your journey as a toy?", " Or do you have any moments that you look back and say wow, I just got to pinch myself real quick. Did that actually happen? I would say the biggest one and obviously because I'm such a Star Wars fan, you know every well they pretty much have done for the last few years kind of open submissions for the Star Wars Fan Awards. Yes, and so it's funny. I had an idea to basically recreate instead of just like toy targeting recreate almost like a kid.", " Ed star like a Kinder old retro kiner TV commercial. Yeah and use the use the products and kind of feature those to make a long story short, you know created like a little 12 second spot, you know narrated it and I actually was taking the figures with my hands and moving the characters around the scene and kind of intentionally trying to be like kind of tongue-in-cheek with it had driveways record some audio for the characters and really I took like about a day or two out of my actual work day to day.", " I do it because I was just so excited about what it could be and you know, put all my client work aside good or bad and created this little piece and ended up submitting It For The Fan Awards and I won for the best or a fan. I forget exactly what it was. But basically one for that that category it's so short short video. And again, it was is interesting because I submitted it and then waited a few months and then they said hey you're you know, all your part of the", " The the voting and then voting went on for a while and then waited a few more months and then got a notification like hey, you actually won but if wait a couple months before we actually announced it and you know make this little video and then we'll kind of put it all together. So it's funny because it would it felt like it was like maybe over the course of like six months when I created the video and then once it was announced so I kept kind of forgetting that I made it in submitted it.", " Was you know part of the kind of the group of winners in an actually announce that I won and so every time it's kind of like it's a little pinch like, oh my gosh Star Wars Star Wars.com. Like I'm I know it was that was pretty wild and what what I really appreciate about that is that it it really is Testament to kind of bringing together what I do full-time as invisible element, but the also my hobby and my love and my passion for photography and", " And also Star Wars is just kind of an IP and it all kind of was represented me and the toys and then bringing my kids into it to help, you know with family and it kind of was just like a really great piece that represented who who I am and to be able to win that along with several of my other friends who won awards in their own categories like this. Just I still kind of look back and kind of incredible. So that was probably my biggest win so far since assuming doing", " Been so for people that want to see that video. How can they access the let's see if you okay. So I've got on my website. I believe I've got a link and I'll go check and make sure it's there but on my website work more or less.com, I think in the about section you can go to there's some links down at the bottom. And from there you should be able to pull it up. But yeah, I need to also update my side a little bit but", " But should be able to see it there or if you screw you want to scroll on my my feed on Instagram. You can see it there as well. It's it's down there kind of buried a legit. But yeah, that was pretty cool and saw silly. That is an I gotta it's so cool work too. So you got a trophy. Yeah. Wow, so, you know being massive Star Wars fans that you and I are it's kind of interesting that Star Wars has you know", " Stickley celebrated the fans in this way and it's nothing more than just, you know saying we are appreciative of you and that's what Star Wars I feel like, you know, I wasn't jealous at all because I didn't even if you know put a submission and I was so happy that you got that award and you know, the other people in the community that one I think Zay one and Trevor one and you know, I can't remember there was a couple other people was there any more in the toy community that that that won an award? Yeah, there were", " I think Chesapeake's TK triple six. I'm tall gosh. Yeah, there were a few other people. Yeah, specifically what's his name shooting the Galaxy didn't he win one? Let's see. I'm trying to remember Matthew did thank you did too. Yeah, it's been a while. It's been a while. Yeah, a lot of people submitted and even were part of even if they didn't win they were still", " Part of the voting and so we had a lot of people who submitted photos and were even just part of the voting round. And so that was a huge win for our community as well and just bringing that into the light. So it's so cool man. So like kind of transitioning from Star Wars celebrating, you know, that sort of fandom, you know, I I love to you know pick the brains of everybody that comes on the show. Like, what do you think?", " Us as a community as a toy photography and toy photographer specific Community. What do you think we need to focus on how can we just be a better Community? How can we practically speaking? You know, just bring this community up to the level that maybe maybe it's not at yet. What do you think? Well, I do think we're off to a really great start. I think like I said in general least the people on run around with I feel like everybody's is pretty respectful when", " I mean, I know that we still need to make sure we're you know crediting each other for reposting stuff or if we've got if you've seen something in your inspired by it, you know just saying hey I saw this and I wanted to recreate it and you know credit the artist, you know, that's just things that I think we should do just in general, but I think the the biggest thing is just interacting interacting in encouraging and lifting one another up because it's such a great place.", " To start off in and I think we can just continue to do more of that and not worry so much about what what you're creating and if it's something that you came up with or you're using a new technique or whatever it is, but just people really respond well to just open open dialogue and being able to share and it's amazing to see I think it's kind of a testament to the community.", " Are just like from when we when I started like in 2016 to now the quality has gone up significant exponentially. So anybody starting off now? I think you guys talked about this and previous podcast somebody who's starting off now can already has like a huge understanding wealth of Knowledge from people who have come before exact kind of the same way. And so, you know people people share people are not and trying to keep you know, the cards.", " Close to their chest but they're sharing and sharing behind-the-scenes content and setups. And this is the the types of tools that I use and this is how I go about it. And I think that's just kind of in itself. That is that's just something that's that's really built the community and made it such a great one to be a part of it really is and you know, when you mentioned the shoutouts, I love it whenever somebody on the Dagobah Customs page Will shout out me as", " Inspiration for their their build and they'll tag me in it or they'll comment and I'll say this was you know inspired by dig of a customs and that to me is the biggest compliment. I'm like, first of all I got to give credit to George Lucas. I didn't make this stuff like, you know, I didn't, you know create this from just out of nothing. I definitely we all aren't we all come from, you know people that are interested in fandom. Yeah, and I'm going to some degree and you know, you got to go", " Credit where credit is due, you know, it's so true and just being able to say you inspired me that goes a long way. So when you're able to just say hey, this shot was inspired by so and so and exactly when you do that you then like you said you create dialogue you able to you know communicate with one another and in able to gives that person those warm fuzzies, you know, and it's a good feeling. It's a good feeling to say. Oh, wow that guy really inspired that person and one of my favorite shots that I've done.", " You know people like to people have said this before that Daredevil shot I had done in my page. Oh, yeah, people will sit there and say that's my favorite shot, you know or just in general and I'm always blown away because I really didn't put too much into that shot. It was just a simple shot and just knowing that it affects people in that way it really it's a it means a lot. It really does. Yeah, I agree. I agree with you and that is a great shot. By the way. Thank you.", " Man, thank you. I I love that show. I really do. I really love the Daredevil. I hope they come back for another season, but they will once we get the streaming going hashtag save Daredevil, I like it comes back. I hope it does. So what is your views man? Do you have any like methodology on healthy living or exercise? Do you have like a pretty strict schedule on how you kind of keep up your mental Fitness? And how do you kind of use?", " You I know toy photography. It really does affect or photography. But how do you view yourself as a human? Like, what do you do in your routine? I think like over anything because it's easy to say. Oh, well, I need to be eating better. I need to be working out. I don't have like a workout routine. I don't do that as much as I should I mean for me, I think for the most important thing you can do is just be mentally healthy. So there's always things you", " Can improve upon yourself like physically just routine stuff like that, but if mentally you're you're struggling with things and you don't have a space where you can just kind of disengage and just kind of reset like that's that's kind of to me. I think that's the most important thing and you know, obviously what toy photography has become for me is kind of that space where I can just say, okay. I know I've got all these projects that are do I know there's stuff going on.", " Our family that you know, I need to focus or get accomplished or we've got all these, you know events that are happening. There's all this stuff going around on in our lives, but toy photography allows me the space to step back kind of reset just get my mind off of things that I can be stressed about and for me that honestly over the last few years has made me feel like a little just a little bit more level out because it's so easy to", " to look at life and look at all the things you need to be doing or the need you need to accomplish and sometimes that list. It just keeps growing right even if you check something off, you've got like five other things that are taking its place and so it's not like doing certain regiments are going to actually solve all those problems. It's just going to keep happening and new things are going to come up that you're gonna have to deal with but you need that any that mental time and that mental space where you can just kind of disengage even if it's just for you know,", " 30 minutes or whatever it is. It's super important and that's kind of it's funny how that's what toy photographies become and that's provided me kind of the ability to kind of just mentally feel healthy that maybe you can it does and you can definitely feel that whenever you post a shot because any time you upload any content. I always feel refreshed and so because you're coming from that perspective and you're viewing this as a", " A positive refreshing Outlook and being able to you know, just kind of create something that's going to inspire and encourage and I always take away from your shot. So I'm like man. I just I feel good. You know what? I mean? It's a good feeling and it definitely shows in your content. So that's amazing. That's so cool shit that that right. There is like one of the highest compliments. I mean just that's what I want. When I do this, I want it to be just an extension of how I feel how my passion and love it.", " For this is so hearing you say that that means a lot. Appreciate it. Welcome in. You're welcome. Do you have any tips for people that are just starting out doing toy photography that you kind of like looking back maybe had you done this you would have either enjoyed it more or maybe progressed faster. Do you have any tips? I mean, I know the other guys from the other episodes have provided some other really great tips, but I'd say just kind of off the top of my", " head don't be scared to to connect with people. Don't be scared to send people messages and just a straight up ask them. Hey, how did you do this or what are your camera settings? Because again people generally are more flattered by that. Like that's a cool shot. How did you do that? So being just stepping out and saying, okay. I want to I want to ask these people questions don't look at anybody is like some kind of legend or whatever. We're all people. So we've got numbers on our on our", " Counts. We got followers. We have likes whatever but we're all just wrong in it together. So just Reach Out Beyond its ask questions. The the worst thing you can do is not do anything. So if you want to get into it, you want to try it don't let anything hold you back like, oh, I really need a nice camera or I can't shoot with my with my phone justjust do it. And you know, if you kind of start getting that routine you can", " Figure out like okay. I really love doing this and let's just take the time and start growing your your tool set, you know upgrading cameras upgrading your process. Whatever it is. Just just take that first step in even when I go back and look at my old stuff like, oh, it's okay I could do way better now because I've taken those steps and I'm I am to the point where I've had a little bit more experience and it's understood, you know different techniques and I've", " Little bit more knowledge. So if I tackled that again now with the three years experience or I could do it better, but it's cool to go back and look at where you started and how far you've come. So even if you feel like you're going to start in your photos going to look terrible. It's still a cool part of the journey going back and looking at where you started and how much you've improved. Let's see what else you know, nothing. I know everyone has mentioned like you got to be passionate about it like if you if you", " You don't love what you're shooting. Don't shoot it. That's a waste of your time. Don't just get something because somebody else made it look amazing and you want to recreate it. Like if whatever it is, you're you love and whatever you have in your house. If you're collecting things, it's pops or Black Series figures or pop toys or anything. If it's McDonald's toys, it doesn't matter if you're passionate about something let that be what you focus on and then everything.", " Your creativity will be will come from that. So don't try to like say oh, I want to be a really great one 6 photographer. If you're not passionate about it, then this not worth it. So do what you do what you love and everything will kind of come from your national natural inclinations and passions. That is an amazing tip man. I I really can say that I have transitioned into that kind of mindset over time because I really struggled you know with the", " Keeping up with the Joneses attitude when I first started toy photography because you know, you see all these figures that everybody's getting and you want to jump in the bandwagon and feel like you're in with the crowd and it you know, like you said is like if you don't enjoy it if you don't find this enjoyable, if you're just doing it to just fit in like man, just take a step back, you know, right feel like okay. This is really something that I enjoy and you know, like like you'd mentioned earlier, you know in the previous segment. I love the mezco.", " Yours and you know, not all the mezco figures are for me. You know, I really don't like horror figures like I If you insane way follow 112 Collective, I really shy away from reposting anything. That's the slightest bit scary because I just don't enjoy it. So yeah, you know, I don't have any sort of hatred towards people that do enjoy it. I just don't enjoy personally so, you know every once in a while sneaking a Freddy vs. Jason just you know,", " For the people out there. They're like man. Why don't you share my you know, Friday the 13th shot and I'm like, okay. Well, I'm just in a wink I'm going to you know wince through this but like you said like just enjoying toy photography finding things that from your childhood that you loved and being able to incorporate that because so many action for your companies now are producing figures on at such a premium and affordable way to be able to do for toy photography and it really does seem like", " The companies are producing it specifically for toy photography. I have a toy photographers. It's no longer, you know, the collectors out there who are kind of dominating the market, it's me. It's the toy photographers and it's the people out there who want the articulation and the companies are responding and they are able to say, how can we make this able to be photographed better? How can we make this, you know able to look more realistic and that's such a enjoyable.", " Nothing, too. So if you're not out there and maybe you don't know what you like. Maybe just I recommend you know, like Jason said pick up a black series figure pick up a Marvel Legends figure go out there. They're affordable 20 bucks. Just go out there. Pick one up pick up a Spider-Man figure pick up a Batman figure and just kind of try. Try it out. And if you if you don't enjoy it, then you can know instead of investing in a hot toys and saying I really don't enjoy this, you know, yeah, right and then trying to recoup that money is difficult, especially", " With hot toys yeah, no kidding. So yeah, man, that's an incredible tip and I just want to just kind of close it out here man, and just say thank you so much for coming on the episode. It's been an amazing amazing episode. I know so many people are going to gain so much from this conversation. And so many people are going to be able to use this as a resource. So just thank you ma'am. That's very very kind of you to say I again I just I love you know you and I could probably go on for another couple of hours just because", " It's against what we love and so yes, it's fun. It's fun to do and be a part of again. It's really the community. It really is. That's what keeps us going. And you know, I appreciate everything you've done and now with with the podcast just listening back to the previous episodes and getting to know these guys a little bit better hearing it from their perspective and through their voice. It gives more value to everything we do. It's not just about what we see on our screen.", " We're scrolling through but knowing that behind every count there's there's an actual person and we get to hear more about who they are what motivates them what they're passionate about and I love it. I'm having a blast. So to be on the show to be here talking with you is is a is a pleasure. So I appreciate it and likewise likewise sure. It's it's enjoyable and you know, you said that no one's Legends, but you know, I do consider you a legend so it's too late it's too", " Too late. Okay. Well, whatever you want to order you want to call it. But yeah, I I'm I'm honored to be to be where I am just within the community and it's it's a blast I yeah, I don't know where I'd be without it. I mean it would be completely different. It's become such a part of who I am now, right and I'm not like embarrassed about it or anything. So it's it's pretty cool. It's pretty cool it is it definitely is so where can people connect with you on social media?", " And the internet sure will at work more or less is my handle on Instagram. That's pretty much where most of my content comes from. I think I've got a Facebook page too. I just kind of post everything from Instagram to Facebook. You can look that up. But I also built a website work more or less.com. And so trying to put a little bit more content that's relating to you know, for some of the collaborations. I'm doing with different companies and things like that having a little", " Bit more you can dive into with some tutorials behind the scenes type content. So I'll be pushing the website a little bit more in the coming months. But already have a few a few things up there now so got some other things I'd love to start making a few products and kind of playing in that space But work more or less is where I'm hoping to kind of build out a little bit more. But yeah, that's primarily where you can check out the toy photography stuff. And if you're interested in what I do with my my company invisible", " I meant invisible element.com and at invisible element on Instagram. You can see what what it is that actually puts food on my table. So nice. Well there you have it and you can find me at Dagobah underscore days. My personal account. You can find the 112 Collective mezco feature page at 1.12 Collective and you can find the toy photographers podcast at toy photo cast and remember everybody. We are storytellers. So get out there go", " Some toys and have some fun and don't forget. This is a community. So reach out send us a message. We'll respond. Have a great day and peace out. Thank you so much. Bye.", " Thank you for listening to this episode of the toy photographers podcast. If you like to sponsor the toy photographers podcast, please send a message to at toy photo cast on Instagram or at 1.12 dot Collective to get started. Thank you so much and have a great episode piece."]}