{"showID": "00iMyJK2hN1jhcpyK2xkHO", "show_name": "Today in True Crime ", "show_description": "Crime never takes a day off, and neither does Parcast. Every day, we flip back the calendar and examine a true crime event from the same date. It might be the anniversary of an important case being solved, the end of a landmark trial, or a serial killer’s birthday-- whatever the date, there’s no ordinary day in true crime history. In each episode, we present a short true crime story, then analyze the impact of that historic day’s events. Today in True Crime is a Parcast Original, with new episodes daily.", "episode_name": "October 13, 2019: Arlis Kay Perry", "episode_description": "On this day in 1974, a 19-year-old newlywed is murdered inside Stanford Memorial Church. Sponsored by Jimmy John’s – Order a $3 Little John at JimmyJohns.com or with the Jimmy John’s app.", "duration": 13.3255, "transcript": ["Today is Sunday, October 13th, 2019 on this day in 1974. Nineteen-year-old Arliss K. Perry was murdered in the Stanford Memorial Church in California for years. Her murder went unsolved. But recently DNA evidence may have finally exposed her killer.", "Hey friend, I want to tell you about the new $3 Little John from Jimmy John's a skinny mini version of any original sandwich for only 3 bucks. It's littler than a regular sandwich, which is perfect. If you're not super hungry, or if you want to try a couple different sandwiches, or if you like bragging that your lunch only cost $3 order a $3 Littlejohn at Jimmy John's.com or with the Jimmy John's app at participating locations.", "shins taxes and delivery fees extra", " Welcome to today and True Crime a par cast original. I'm Vanessa Richardson every day. We tell a timely story from True Crime history then analyze the historical impact of that day's events today. I'm diving into the story of Arles K Perry. I'm excited to provide an update on the case since it was covered in the park asked original unsolved murders due to the graphic nature of today's crimes listener discretion is advised we advise", " Caution for children under 13 today we're going back to October 13 1974 when 19 year old Arliss K. Perry was murdered just after midnight in the Stanford Memorial Church the disturbing nature of her death LED some to theorize that she was murdered as part of a perverse Satanic ritual, but the real killer turned out to be much closer to home.", " The late night air was crisp but Arliss was hot with anger. She hurried down one of Stanford's lamp-lit walking paths trying to put some distance between her and her husband Bruce. She loved him dearly after all she had followed him to California after she graduated from high school earlier that summer but he could be so hard-headed. Why did he care so much about meaningless things like how much air pressure she", " In their car tires Arliss looked back stopping to watch Bruce huff and puff as he ran to catch up to her deep down. She knew his stubbornness came from a place of love Bruce was extremely protective of her and just wanted to make sure she was safe so much so that he had insisted on accompanying her to drop some letters at the post office. Yes. It was after 11:00 p.m. But it was only a short walk from their dorm.", " A few moments later Bruce was backed by her side and they continued their walk home in silence. But even though she was still mad at him. She was glad he was there. Although Stanford wasn't considered to be dangerous three people had been murdered on campus in the past two years Arliss felt much safer with Bruce by her side. She knew there spat about the car tires was the sort of Tif married couples had all the time.", " But she still needed a moment to decompress Arliss stopped walking when they reached a Crossroads in the path. She told Bruce she wanted to go spend some time alone at the Stanford Memorial Church a devout Christian. Arliss always felt better after a prayer session.", " Bruce was hesitant to leave her on her own. But he knew she needed some space. He went on to their dorm while Arliss headed for the church. She got there a few minutes before midnight Arliss took a deep calming breath as she took a seat in a Pew she loved how the moon light filtered in through the stained glass windows some might find it spooky. She thought it was peaceful.", " Back at the dorm Bruce waited up for Arliss. He hated going to bed angry, but as the Clock Struck twelve fifteen am he started to get worried Arliss said she was only going to stop at the church for a few minutes. She should have been home already when Bruce went to the church to check on her the doors were locked. He headed back to the dorm thinking he must have somehow mr. On her way home, but", " Carlos wasn't there either for the next few hours Bruce drove around campus all concerns over tire pressure gone from his head. He wondered where on Earth his wife could be their argument wasn't so bad that she wouldn't have come home. Plus there wasn't really any where else she could have gone arlis had only moved out to California in August and hadn't made any good friends yet. He was certain. She wouldn't be visiting anyone. So", " Into the night Bruce looked everywhere. He traced every conceivable path. Arliss could have taken to get home. He checked all the secluded spots. She could have gone to think after leaving the church. He kept replaying their fight in his mind wishing. He could take back everything. He said he just wanted to hold his wife in his arms and say he was sorry by 3 a.m. Bruce realized he wasn't going to find his", " his wife on his own a few officers went to the church and confirmed. It was locked. They assumed something must have happened to her as she walked back home while the police searched the area a security guard named Stephen Crawford arrived at the church around 5:45 a.m. To open it for the day to Crawford surprise. The door was unlocked Crawford was worried he had", " Lee close the church the night before around 12 10 a.m. He had called out for anyone still inside to come out before he locked the doors. Luckily. It didn't seem like anything was stolen from the church's altar. But as Crawford headed back down the aisle something caught his eye in the East transept just to the left of the altar it was Arliss Perry's body.", " The scene was too horrific to believe Arliss laid spread eagle on her back with a 5 and a half inch icepick protruding from her skull her jeans and underwear had been pulled off and a two-foot altar candle forced inside her Arliss is blouse had also been torn open and is second candle rested between her breasts Crawford immediately called the police and they Rush", " To the crime scene. They were able to collect a partial palm print from one of the candles as well as a semen sample that was found on a nearby kneeling pillow. Although DNA testing wasn't yet available. It was a valuable piece of physical evidence.", " When the police went to tell Bruce what had happened he opened the door covered in blood. He insisted that it was his as he got severe nosebleeds whenever he was stressed nevertheless. He instantly became the prime suspect. However blood type testing showed that it was in fact Bruce has blood on his shirt and not Arliss has the palm print found on the candle also wasn't a match.", " Additionally Bruce agreed to submit to a polygraph test and passed without any issues. Although polygraphs aren't necessarily a reliable indication of Innocence or guilt the police were satisfied enough to cross Bruce off as a suspect the other suspect. The police questioned was the security guard Stephen Crawford like Bruce Crawford's Palm didn't match the partial print found on the candle and he also", " so passed a polygraph. It seemed like Arliss Perry's murder would forever remain unsolved.", " Up next a shocking break in the case now back to the story.", " as the years went by after Arliss Perry's 1974 murder the Cold Case unit in the Santa Clara District Attorney's Office routinely reviewed the case, but New Leads weren't forthcoming theories of who killed 19 year old Arliss Perry ran rampant some suspected that she was killed in some sort of Satanic ritual famed Son of Sam serial killer David Berkowitz hinted that he knew", " Who killed Arliss but he didn't provide any useful information until recently. It seemed like Arliss is killer would never be identified. But in 2018 the police made a breakthrough.", " Due to advances in forensic technology detectives were able to conclusively identify the DNA left at the crime scene in 2018. It belonged to Stephen Crawford the security guard who claimed to have discovered our Lisa's body to be certain he had committed the murder the police conducted several interviews with Crawford throughout June 2018 by the end of the month. They were confident enough to file an", " Just warrant. Once the warrant was granted officers quickly drove to Crawford's apartment to place him under arrest once Crawford heard the police announce themselves. He took his fate into his own hands. He killed himself before he could be arrested. Unfortunately this meant the police weren't ever able to get insight into why Crawford had killed Arliss or understand why he had killed her.", " In such a sickening way.", " Although Bruce Parry never got the satisfaction of seeing his wife's murderer. Go to jail. Finally learning who killed her must have been a tremendous relief to often cold cases such as these go unsolved grieving families. Never find the Comfort they seek but in the case of Arles K Perry, her loved ones can at least take solace in the fact that the man who ended her life in such a brutal way.", " I can no longer hurt anyone else. It's a small justice, but Justice all the same.", " For more information on the murder of Arles K Perry check out the episodes of unsolved murders which go more in-depth into her case. I'm Vanessa Richardson today and True Crime is a par Castor original you can find more episodes of today and True Crime and all other par cast Originals for free on Spotify. Not only does Spotify already have all of your favorite music, but now Spotify is making it easy for", " To enjoy all of your favorite Park asked Originals like today in True Crime for free from your phone desktop or smart speaker to stream today and True Crime on Spotify just open the app and type today in true crime in the search bar at par cast were grateful for you our listeners you allow us to do what we love. Let us know how we're doing reach out on Facebook and Instagram at par cast and Twitter at par cast network will be", " back with a brand new episode tomorrow in True Crime today and True Crime was created by Max Cutler is a production of Cutler media and is part of the par cast network. It is produced by Max and Ron Cutler sound design by Carrie Murphy with production assistants by Ron Shapiro Paul libeskind Maggie admire and Carly Madden this episode of today in True Crime is written by Alex beneden. I'm Vanessa Richardson."]}