{"showID": "00irXoP4wc6yOoC67PyKg5", "show_name": "Your First Million", "show_description": "A podcast by Arlan Hamilton that goes behind-the-scenes and teaches you how to make your first million dollars, get your first million downloads, or find your first million customers. Arlan is the Founder and Managing Partner of Backstage Capital, has raised more than $10M, and has invested in over 100 companies led by people of color, women, and/or LGBTQ.", "episode_name": "Arlan's note 12/23/2019", "episode_description": "A note from Arlan. ", "duration": 49.91781666666667, "transcript": ["Hey, it's Arlen. This is a different kind of episode.", " You might have noticed if you've ever listened before that there was no intro music. There was no intro. It's everything's cool. This is not a sad episode at all. I just had this idea. I'm sitting at my podcast room and in Los Angeles and it's is inside my home office and I was in my apartment a few minutes ago with my wife Anna.", " and just as looking out the window at our view and looking around and sort of", " it's sort of hit me that wow. I said out loud. How did I get here? How did I get here? And she said hard work and talent and patience a little that was the kind of paraphrasing her and", " You know the year has been pretty tough for the most part but there have been some really beautiful moments. And and today is one of those really great moments. And so I thought let me record an episode that is just me talking. I used to do these for another podcast that I hosted called the bootstrapped VC which all of the episodes are still available if you're interested and I used to just every once in a while.", " Just hit record on my iPhone and talk to the to the phone as I felt we're talking to you in a room. And those were like really the most popular episodes even though we produce the rest of them. So I thought I would do that for this because I haven't really done that. Usually I record an episode even if it's a bonus episode. It goes through a great deal of post-production just to get the sound right and and edit a little bit for", " Salter's or stumbles or anything? This is just going to be a raw recording now granted. It's into a great microphone. So hopefully it sounds good. But this is a real recording and I'll tell you the point of it. So the point of it was that this is the holiday season and no matter where your where you live a country you live in what city you live in what state what your religion is.", " It is or your beliefs are because it is such so well known for being a holiday season, even if you don't celebrate the holidays, this can be a very trying time for some people. It can be a very lonely experience for some people or sad or lonely. I think I just hit that or it can just be like a bla kind of feeling not necessarily depressed, but just kind of feeling blah.", " and or there's plenty of people there are plenty of people who are feeling hopeful right now going into 2020 and I would encourage anyone to listen if you want to listen, but this really this episode which I have absolutely zero idea what I'm going to talk about right now, but this episode I wanted to be for those who get it who get that that feeling because although I don't", " Feel that way right now. I feel quite optimistic and happy and almost content. I never feel fully content because I get a little scared. When I do I do I I have felt that way in the past especially around certain holidays, and I know a lot of people can feel that way. So this is actually just like a special episode for you if you if what I've said in the last few.", " In its resonates with you if you can can recognize what I'm talking about then you this is for you. If it doesn't if it feels like I don't know what you're talking about or I don't feel that way. Then I'm going to do something. I don't normally do until you that you probably shouldn't listen to the rest of the episode because it really isn't going to be that interesting. And so I mean it's not meant to be interesting. It's meant to be", " Kind of compare companion for you companionship for you. If you're not feeling well, like I remember when I was like a young teenager like 13 to 15. I was in a Janet Jackson fan club, and I still know a lot of friends from it. And in fact one of those friends Sarah it works for me at Backstage now, I mean, this has been 23 24 years and", " That friendship has lasted and others have Braun and Amy and others but I was in this fan club and it was the kind back in the day where you would write in you would write to pin Pals and and you would get this, you know, stickers and pins and all sorts of things. And one of the things that they had was you could call this phone number and you call the phone number and press one or two or", " three or four and when you press the number there would be like a minute long message from Janet and she would just say hey, it's Janet. Just wanted to let you know that I'm having a great year and I really appreciate you that kind of thing, you know, and I remember I would call that sometimes I call it originally just to hear it and then I would call it sometimes when I was feeling down and when I was feeling lonely or when I was feeling like I didn't have that many friends and", " Really? I still remember being in the my bunk bed had a red bunk bed, and I would I would sit on that and and and dial that number every once in a while and listen to her and it really made me feel better. And I've also been all around the place the past couple of years and especially the last six or so months with this podcast people everywhere I go no matter what", " city country I'm in is there some one or few or several people who will say that they listen to this podcast and they'll quote me from it. And it's like one of those things that's really deeply resonating in a way that tweets and Instagram posts and emails and even like magazines or are things of that nature can aren't and can't be I think the only thing that might rival it is when my book is released because", " The the book itself will be like this thing that you can reference if you get a physical copy or if you listen to it audibly so I know that there are some people who who listen to almost every episode or whoo. Yeah. Whoo, whoo would be getting something from this and again, I'm not going to edit it.", " It so I'm going to probably stumble a little bit and I'm actually responding to a text message right now. So just give me a moment just because this is happening in real time. And this is kind of an important one.", " Okay, so telling you it's real so yeah, I think they're going to be some people who are listening what I said to Anna before I came in here because I just I told her I'm going to come in here and I just said I'm going to I'll be gone for like an hour by and she's like, okay she gave me a hug and she said I'll see you soon. What I told her is that if 10 people feel a little bit less alone.", " Maybe you don't feel lonely. But a little less alone in the world today as you listen to this somewhere in the world. Then I have completely accomplished my goal and with this podcast and it is absolutely worth every minute of my time.", " So which", " Is time time is money and we talked about top just trying to think about what would be interesting to talk about like I'm again, if you're if you're trying to listen to this for anything that will help you with your business or help you succeed in 2020 and all that. I don't think this is the one for you. So you might want to hit the stop button, but this is more like if I called you up and we just start hanging out on the phone. And so it's a", " Bit like ASMR, but not at all.", " Okay, let's see some going to be on I'm on Twitter. It's Monday. It's the day before Christmas Eve. It's like right before noon. I've ordered food from door - and it'll be here soon. I'll go and eat it soon and I'm what I'm reading right now on Twitter is I posted I posted a post about an hour ago hour or two ago where I gave", " Shout out to Mark Cuban the owner of the Mavs billionaire investor who's on star star Shark Tank. I don't know if there's anybody in the u.s. At least who doesn't know Mark Cuban, but maybe outside of the u.s. He's he's not as well known but he he lives in Dallas and I'm from Dallas and we met so I'll tell you what the Tweet was and then I'll tell you how we met. So the Tweet says thank you Mark Cuban this year after learning that I was having trouble raising more funding he", " Quietly offered me a million dollars to invest how I see fit. He also met with backstage Capital Founders remembered my mother's name and did a video Drop for my brother's Dallas Media company and then he replied to that and said that I earned I earned that and that my family is fun and Etc. So there's been a lot of play on that on that tweet and one right before it was kehlani because I was talking to kehlani again. Kehlani is a singer.", " Performer, she's also the co-founder of a company called Flora Flora living and backstage my fund has invested in her company like three years ago. I think now wow, that's crazy. And yeah, I think it was three years ago. I'm pretty sure and she has like a top-five song right now and she was saying like this is crazy and I was like, it's a lot of hard work.", " To come to come to review fruition. It's manifesting itself because", " I'll tell you this quick story and then and then I'll go back to Cuban. So I have a hairdresser in Los Angeles and I found her. She's like Kim Kimble's salon, and I found her because I used to live right across the street from that Salon in West Hollywood. So I lived there for two years and then I moved and I kept her because and I'm not saying her name just cuz I don't know if she'd want me to but I kept her because because she was great and I remember when I was in", " Chair once a kalani's music came on at the salon and I said hey, do you know that person and she's like, oh, yeah. No kehlani and I just was so excited because we had just invested in her. So I told her and she said that years before that so that would have been two thousand Seventeen or eighteen that that conversation was happening. She said that years before that just a few because kehlani is probably early 20s at this point. But when you Kalin was a was a teenager this hair", " A dresser who also does Mary J. Blige is hair does a lot of people's hair has done Beyonce's in the past has done part of her team, you know, because there's several that are needed. She was called in by by a producer to help style groom a couple of up-and-coming artists on that producers label and kailani was one of them.", " And the other was like more more had more heat behind them. They were doing better as far as like people like labels looking at them or getting more plays or however you measure that I just remember that my hairdresser said that the other group was who they were focusing on the most and kailani was being focused on but it was going to be like a slow burn basically. So what she noticed about Kalani though. Is that kehlani she found out that kehlani it?", " Took her like two buses to get to the studio every day. And so she took these two buses and that when she got there. She was always on time. She was always courteous to everyone. She was always ready prepared for what job work. She had to do that day and it really caught the attention of this hairdresser because she was like, this is someone who is doing it, right and that kind of craftsmanship and that kind of attention and", " And dedication usually pays off as we all know as we all know. So today kailani, I've seen her perform a she broke all kinds of records at Pride a couple of years ago where they had like, they couldn't let people in after a while because it was so packed for her. She broke the record for how many people would come to see her at La Pride which was tens of thousands of people it was incredible. And so I've seen her I was upset standing on the stage when that happened and it was", " Just amazing and I've seen are different places and people they don't just come to see her they live and breathe with her is a very loyal fan base. But apparently I think based on just like the momentum. I think this is going to be 20 20 is going to be K Lonnie's year. I really do. I thought that the past three years haven't been her years, but this one's going to be it because it's funny because I see her talking to people like rdb.", " Chief was featured on a cardi B song called ring on the latest album, which is one of my favorites from the album. So she's featured and everything. But you see her talking to cardi B, and it was like she knew cardi back in the day and was friendly with her and helpful to her back in the day and then cardi blew up and then the same thing I'm seeing is happening with Liz. Oh Liz. Oh is saying hey you were there for me back in the day and now Liz I was blowing up in 2000. So 2018 was Cardis year.", " 2019 was Liz's year. I'm going to go ahead and say 2020 is going to about to be kalani's year and it's just really exciting to see and fun to see so going back to Cuba. Mm. So March of 2019 this year. I I met Mark Cuban at South by Southwest which is a major Festival in Austin. It's a all kinds of some music festival. It's a film festival. It's an interactive Festival which is like Tech.", " And Innovation, it's education Festival. It's is one of the largest in the world and it was I was speaking a few times this year there and one of them was at Twitter house, which was a bar big bar that Twitter took over and had different interviews. And so this one was Mark Cuban and I interviewing each other because it was Twitter house. They were looking for people who use Twitter and interesting way and", " they said that the two of us are outspoken and authentic and we'd probably get along and kind of feed off of each other's energy and they were right. I definitely had a great time and it was funny because when we went out when we walked out, everybody was chanting marks named Mark Mark heart. You know what I was like hey, how you doing? Yeah, it's me. No one knows me here. And then by the time we left people were like high-fiving me as I left and saying my name was I walked out. It was really funny.", " But I would I notice then was that Mark was super cool. Here's what here's the funniest thing about this whole time with Mark that that day. So Mark is a billionaire. He's from Dallas. I grew up in Dallas. I've known about Mark Cuban. My almost my whole life because of Shark Tank and but before Shark Tank just because he was this Dallas billionaire and he has a lot of street cred, you know, so my brother likes him and so it's just like that thing.", " So I'm expecting Mark Cuban to have to roll deep to have an Entourage to have an assistant at the very very least, but certainly to have security with him. And unless these people were stealth and they were like hidden on purpose because of whatever reason they did not exist and they probably right now that I think about it. He probably does have security that is that is not seen because that would be the smarter way to do it.", " But anyway, the point of it was like behind the scenes and backstage. He had nobody with him. He wasn't being fussed over and he wasn't making a fuss and I came in with my mom my brother because my mom was visiting. My brother was filming professionally for me my makeup person who also was doing grooming and and then and I", " Security I had security at this place because I had a stalker at the time. It's a whole thing. I don't want to really get into because I don't like to talk about that. But at this particular time I had security so I had like five five for five people with me and Mark Cuban had zero and so it was really funny it to me. It was very it's one of those things that I find great humor in the absurdity of things and that was it. So we go", " go out. We have a really good time really good conversation. And and that was that he talked to my mom a little bit and it was really friendly and got a picture with my brother who is just so stoked about that because he had been paying attention to the Mavericks for half his life. And that was that and then a couple things happened where it it was kind of I had to we had a couple of like investors back out of something this year and", " It's like putting it mildly but I don't want to go back into it and he found out and you know, there was a lot of money that was lost but he got in touch with me because you know, let me just back up a little bit like right after that. I sent him a message on Twitter like a DM and I was like, hey Mark, do you want to invest in backstage? And he is like no, I don't like to invest in funds because I like to have too much fun investing directly into company. So that's not really my thing. I don't invest in other people's", " of funds if I can help it. I was like, okay, you know, that's fair I get that a lot that to me is completely legitimate because people have different structures and the way that like models of how they spend their money and I do too so that wasn't his jam and I could understand it. And so I was like, okay cool. And then I just kind of moved on and then this sort of thing happened with the money not coming through and people writing about it and it was like all these people are kind of coming down on me at once. I felt pretty bad.", " Head and all of a sudden Mark reaches out just on his own he sent me he did he I sent me a DM on Twitter and he's like hey and he didn't ask anything. He didn't like challenge me. He didn't say why didn't you make this work? He just said hey, why don't you invest a million of my dollars and establish even more of a track record with it, and that'll be that and I'm telling you like we basically lost like 30 million dollars.", " But so the 1 million wasn't that but let me tell you it's just like the first time that Susan can ruin an angel investor gave me $25,000 September 2015 when I had been hearing no from everybody for three years about the fund $25,000. I've raised 1112 million since then, but I'll never ever forget the 25 and there will be nothing will be as valuable as that 25 when it comes to.", " Fund so for him to reach out knowing that he does not enjoy investing in other people's funds while he was away. He hacked that was that it's a KO fits a partnership. It's his money. I invested but it's not like a pooled fun. Like the rest of them are so it's under it's under my name. It's called Arlen was here Investments fund one. I plan on having several more in different ways, and I invested in 12 companies from it.", " It this year for five of them? I had already invested in and we just went back and we have the other half. We just were the other two thirds. We just invested in new companies, and I know that it's going to have a return so I know it'll be able to literally pay him back, but I don't know if I'll ever be able to pay him back for that the generosity of spirit that collaboration that what I've said to him and he won't let me kind of like he won't just let me", " Say it he kind of it's not like he has this humility because we all know Cuban doesn't have a lot of humility, but it's more like I won't even let you do that. But basically he took me seriously, they're very so there are a lot of people like I put this tweet out a few days ago, and I said, I'm going to paraphrase. I think I said like beware the people who would have you like lets you let you take hits", " take the hits, but don't trust you enough to be quarterback.", " And for me, that's what I'm thinking when I think Cuban like Cuban he wants me to be in the trenches, which I already have been for years. He had to learn that a little bit. It's like oh, okay. I didn't realize you had been doing all this. He wants me to be in the trenches, which I have been. Thankfully. He wants me to take the hits and and and kind of like, you know, earn my keep and all of that which is cool. Whatever it's like a Miyagi thing, but he also", " so has proven this already to me behind the scenes. He also values my opinion. He values my value if that makes sense. He doesn't look at it. Like he's this white knight coming in to save the day. He's like make me some money make me some additional money and to me that is", " That is worth more than any amount of money. Is that is that taking you seriously part so I kind of measure relationships that way these days I measure them in are you going to get my just here to take your hits take the hits for you? It is is or can I can I make some decisions and the reason I tweeted that by the way, I'll switch gears and tell you why I tweeted that because that one resonated with people too and I think people found their own meanings in it.", " It which was great. It's what I wanted but the meeting that I took it from was there are people who", " I'm not gonna get too specific because there's at I want to keep this pretty light, but there are people who will take pictures with.", " Certain people for the clout but I know that they wouldn't take them seriously business-wise that makes sense. That makes sense. I don't know. I don't know if you can make sense without me going deeper and I don't want to delve deeper into it. So that's what it is. So like don't don't pat me on the back online. Don't give me a shout out online. So there buddy can see it but then when I you know behind the scenes say hey, can you look at this?", " Deal with me there. You don't don't say like oh, well, you know, I don't that's not that's not going to work because I don't trust you to be on my level in your actions were saying that that's not going to work for me. So that's happened. Of course. All right, I'll move on to different topic before I get it myself too much in the weeds with it. But so that's what I was doing. So I was looking at and let me see where the food is. So it's exactly new now and see where that food is. I'll tell you what door - I used or - quite a bit.", " Oh, look The Food arrived I use it quite a bit because I'm always traveling and it's better than Hotel food and I use it at home because since I'm always traveling I get home. The last thing I want to do is cook and I definitely need to like I definitely need to like figure out a little bit better solution but I use it so, you know how Spotify had the end of year or like, you know or end of decade? I think this is this is the this", " Our top five listens and everything well door - if you are door - user you probably got that email that says this is how much you let me tell you what it was called and now felt so attacked it said this is how much you ate this year go God I was like, wow, that is thanks door - come at me. Come at me. Why don't you admit it? And I open up the the number and", " yeah, I think there were trying to make you happy and trying to get you to press something so you could order more but when you send and you kind of show people how much they consumed in a year, I don't know if it has the effect you're trying that you're going for the effect it had on me was I took a break for a couple days and like I don't even want to look at the app. I don't even want to guess what's over there, you know.", " So it's funny that just the kind of psychological stuff that that does but let's look so now I'm going to go to Instagram if you're still listening. I'm glad you are and I'm happy to be hanging out with you. All right? Yeah. So Instagram, I have a couple couple new messages I get like so I got a few like I get I don't know how many anymore I used to count like I used to.", " To know just have an understanding of it but I get like a few thousand messages a per week across email DMS on social LinkedIn slack slack is different because you can't really kind of the same but like the ones that need attention, you know, so combined I get just so many of them, but I pay attention to them pretty much.", " And I got I try to reply when I can and when I can't or when it feels like I shouldn't I don't these are things that you learn at 39 in 38 38. You don't you'll learn them earlier. I don't think because I did not I did not understand boundaries of time before very recently. So don't feel bad. If you're not great at it. Yep, and if you are greeted it good for you and spread it around share that with someone. So, let's see the last thing on Instagram. So Marlon was here on Instagram and Twitter if you're not", " And you'd like to I am on both so looks like okay. So the last thing I posted a couple of hours ago again was that just a screenshot of the Mark Cuban tweet and that has a lot of a lot of Buzz around it. And then the one before that was yesterday. I did diversity stats. I probably post on Twitter I can post up to like 20 times a day anywhere from 2 times a day to 20, I think.", " On Instagram, I post zero to two times per day. I don't usually do more than two and less it's just outrageous stuff going on because I it's like a strategically it's not that I strategically put up anything but I strategically look at how like the pace of Instagram because I don't I don't want to just post anything. That's what the Instagram stories are for. That's what I post a lot of so I'm talking about the timeline when that 0 to 2 on the on the stories. I'll", " A post multiple times are I'll go a few days without posting. I don't have a huge game plan there. I probably will in 2020. I'll probably get a little bit better at that. But what has served me well so far in life has just been to be true to myself be authentic post when I feel like posting post what I feel like posting. Delete what I want to delete when I want to block when I want to mute conversations.", " When I want to mute people when I want to all of those things have really served me. Well, especially in the last couple of years like when I started muting conversations on Twitter and muting people", " You know, I'll block a person real easy real fast because that self-care blocking is self-care quote me, please but muting is a little tough because you like sometimes blocking and people you don't want to block them because you like they didn't do anything wrong. They're just it's just not a helpful to me to have them have their noise in my in my life and I could be that to someone else which I would understand. So I love the mute feature because the mute feature is just like I don't need to hear about what you're", " Wayne or what your opinions are if it's if it's a negative to me and have a lot of people I keep a lot of people who have dissenting opinions who have opposite opinions of mine. I keep them on because I don't ever want to be in a bubble too much but I do want to be protected. I think a bubble and a cocoon or two different things. I don't want to be in a bubble where I'm only hearing the same thing too that I think people are.", " Are preaching to the choir people hate Trump and and that's it. And there's no there's no Nuance to it. No color to it. I don't want that. But I want to be in a cocoon where I don't where I feel comforted where I feel like I'm not constantly being thrown the this visceral that is thrown about in Social and I've had it, you know, the more the more followers you have or the more", " Post that have over a thousand likes or whatever the more you get this incredible disgusting vitriol that comes out from people from Bots from actual people from where it from people you some people, you know, all of that and I'm protect myself from that at all costs and I encourage others to do that, too. Yeah, and I'm trying to keep an eye on things so that I don't ever", " Get to disconnected where I can't feel I can't feel for someone else or I can't relate to someone else. I feel pretty confident that that won't happen. At least for a few years. Give me a few years and I may just become just unreasonably obnoxious, but still got a few years and speaking of 2020 speaking of being unreasonably unreasonably obnoxious in 2020.", " You're going to see a lot more of me. Now. If you think you see too much of me today, which I imagine if you've listened this far you probably aren't one of those people who like likes to tell me that I'm everywhere and to many places. But if you think you see me too much today, hold on to your hats folks because 2020 is when my book comes out and man. You can't you can't get away from marketing for a book and I don't want to I'm so", " cited about it. I have a book. I finished a book co-wrote. I don't know if it's co-writing like it's see what we call it. So it's my book with with a ton of help from Rachel Nelson who gets a credit on it as she should and yeah, it's going to be out there. It's going to be out there. I can't wait. This is what I'm looking forward to because I've had this experience before I know how cool it is.", " I cannot wait to see it pop up at an airport where I'm traveling and it's at the airport. So the way that that happens is that it can be at the airport in general. But usually it's because it's selling well other places. So that is one of the reasons a pre-order is so important and I encourage people to order it early just because then more airports will ask for it and", " It'll be seen by strangers because I'm excited. I'm equally excited to show it to people who have been following me who know me, even my family and friends. I can't wait to see what their opinions of the book will be and everyone that thousands of people have been following this journey for the past few years including you right now. I cannot wait for you to tell me.", " What you think and and most importantly get something out of it that you can use in your life that helps you so I can't wait to hear those stories of how the book helps you do something. That's like the ultimate at the same time. I can't wait to meet new people because of the book. So if you're walking in the airport and you see this cover and it's like it's about damn time. What is that about and you pick it up and you read it or you see me on some sort of", " interview or something and you are at a speaking event at a conference. You never heard of me, but I speak for a few minutes and you were interested all of those things bringing you to the book. I can't wait for because that's going to be I think that'll be super trippy. And so many of my friends are my in my acquaintances recently have released books or have had books out before been giving me great advice and", " Preparing me as much as possible what I don't think you get prepared for this and we'll see what happens to this little book. We'll see what happens. I can't wait. I can't wait and honestly just like this episode if it if it true I know this is so trite but it's not meant to be if it truly helps just a few people if it truly helps you helps you start a company helps you feel like you can ask for promotion helps you feel like you can become.", " The CEO of your destiny basically then I'm just going to be elated so I can't wait to meet people and have those conversations and that's just a little bit about how I'm thinking in those terms. Yeah, so, it's Monday. It is tomorrow's Christmas and I think we're going to release this today. I think I'm just going to upload it and release it which is not normally what I do because I yeah.", " See only I've been rambling. So I have no idea if it's good or not, but I'll upload it today, which is Monday right before Christmas Eve. And then I was supposed to go to the beach with my wife this week, but it started raining and it's supposed to rain a few days this week so we decided not to go so I'll be at home and I'll be watching more monk yesterday. I watched four episodes of Monk the day before that. I watched like five episodes of Monk.", " They're all been like saved on my DVR because it like airs every Thursday or something like that Sunday or something a few of them. So today I'm going to watch more monk. I plan on watching at least two episodes of Monk today, which probably means five. I love that show, I grew up with my mom watching Murder She Wrote and Perry Mason she grew up with my mom watching like Murder Mysteries and", " Westerns and and soap operas. So today what do I love mysteries like monk old school stuff like Perry Mason. I'll still watch that at night every once in awhile. I love westerns love it and Andy Griffin. I love The Rifleman is my favorite Western because it's amazing and I heard Chuck Connors was really cool when he was alive, and it's just a great great show and", " I think he was reincarnated as the lead guitarist on the S&L band Saturday Night Live band for like the 90s and 2000's. It's a whole different story if you feel like hey go search for that person to play guitar at breaks from like 92 2005 or something. I don't even know the dates, but he looked just like Chuck Connors Chuck Connors from the right from it. Anyway, I love that and I love Bonanza and all kinds of", " And then I'll of course General Hospital. I used to watch one hour to live when it was on and because it came on right before general hospital with General Hospital's it it is it and yeah. So anyway, I'm going to watch a bunch of TV. I'm going to eat my food that's already here. So I'm going to go and then check this out and do not send any spoilers once you hear this I am going.", " I cannot wait for this Christmas Eve and Christmas Day. I'm going to show my wife Ana. We got married in August. We've known each other for five more than five years. We've been dating for more than four years and I often introduce her a new movies because she's not a big movie person. She's a TV person. I am going to show Anna.", " Notting Hill for the first time that she's singing it Notting Hill is probably going to be Christmas Eve and Love Actually on Christmas Day for the first time getting to watch those two movies with someone who's never seen them before what more could you ask for? I can't wait I can't wait so we're going to watch that we're both being really creative this week this weekend. We were really creative and just we're not working. I mean, I'm not working. I'm at work. I'm on vacation.", " Get to read a lot and right and plan and watch a bunch of TV and think through strategies and it's just so fun and she's working on all sorts of stuff. She's doesn't work yet, but she's doing like all this creative stuff. So she has like a little lab and a separate room and she has like recording equipment and she can make all these she's making all this music and composing all this instrumental music. It's gorgeous.", " Amazing. I think she's going to be like very successful at that and she will be and she's also just working on all kinds of really interesting projects. So", " I'm going to go back to that world and I gave you about 40 minutes. I hope it was helpful to 10. That's all I'm looking for is ten of you. I know that thousands listen to the podcast would have just ten of you found yourself a little bit less alone.", " During the season and you normally feel that way. Please let me know but don't you don't even have to let me know. I don't need to know I just really want that for you and just know that again as corny as it may be really are not alone. I have been I'm 39 years old and I've attempted I'm sorry trigger trigger warning trigger warning trigger warning. You might want to skip over this for anything.", " I have in the past attempted suicide in my other teenager again in my late 20s.", " And I'm so so so so glad that both times.", " It didn't happen.", " I have been broke for most of my life. I've had no money. I've been sleeping on couches not sleeping staying overnight for days at a time just on the streets but not living on the streets but like walking the streets. Basically, I have slept at the airport as many many many times that's been said, it's true. I slept there for days and days and days and days and days and didn't have any food and was", " So worried and so depressed and literally face to the floor crying wondering when it was going to be over and I'm here right now. I am living in a building that I only could have dreamed of of just a few years ago. I have a view of Los Angeles that I've craved for most of my life ever since seeing it on television I have", " I raised and earned more than five million dollars this year alone for my company not for myself, but for my company.", " And I've raised more than 10 million the last four years five years ago five years ago. I was sleeping at the airport.", " A little less than a little more like a little more than five years ago a little less than five years ago. Sorry little less than five years ago. I was sleeping there for so four and a half years ago sleeping at the airport again, please don't try to sleep at the airport to impress me after do that little thing because you know how I mentioned earlier. There's like a stalker they did that. I didn't like it. Please don't do that, but going back to my point.", " I don't ever ever want to be back there again, but I survived it and you can survive what you're going through. I think I don't know what you're going through and a lot of it's going to be so much worse than what I've just described but some of its going to be better some of its going to be less odds against you and if I can get there I know you can.", " I just held on to hope I continue to work on what I knew I could have control of and there were people around me who came into my life just at the right time and I know they can do that for you. It took 35 years for me to really feel like I was doing something in the world and then I wasn't lost and spinning out of control and not really knowing.", " Self renewing my value at all 35 years.", " And today I feel all those things. I feel like I have control knock wood. I feel like the only thing I can't control this health and they can't other people's health or like things that I can control how I eat and exercise but I can't control things that think like that but to go from so much adversity and I just scratched the surface really scratch the surface with that explanation to go M to here where", " I can control my day. I can control who I talked to who I give time to I can control I was playing Black Santa earlier this week. I went online and I gave away a bunch of gifts to help people do different things strangers. That's so much fun.", " I think you can get there too. And hey if you're someone who has money and that part is not the problem that part's not tough for you. You get to feel down to you're allowed to feel bad, too.", " And I mean so many people who feel bad for feeling bad when they have money. They're not supposed to feel down because they have enough they can eat every day. They're not homeless. They're not this to not that you're human. You're a person. You're allowed to feel bad. Sometimes it's okay as Jessie J says, it's okay not to be. Okay go listen at song right now.", " We're all allowed. We're allowed to brag we're allowed to feel proud. We're allowed to feel shame. We're allowed to feel guilty and guilt were allowed to feel sad down depressed hurt disappointed content. Happy elated optimistic all of us. All of us are", " so I wish you well and", " go listen to some music that you like go. Watch some TV that you like go talk to someone give someone a call.", " If you happen to listen to this and you weren't in a bad mood, you just like my voice call somebody up call a friend up call a family member up even if they are always seeming hmm seems like they're good. Call them up this this week.", " Calma. All right, I'll see y'all I hope you're doing well. And I should say very last thing I should say is this should never ever ever take the place of professional help. If you're feeling really really down and you can't get out of it. Please call one of the hotlines to talk to someone about it or go online to look for a place where you can call actually what I'm going to do, right?", " now", " I know I keep saying by but I don't mean it. I'm going to do this right now.", " Give me one moment, please.", " If you're feeling like you're really really down and you don't know how to go on. Please call the National Suicide Prevention Lifeline at one eight hundred two seven three eight two five five. That's 1-800-273-8255. They're available 24 hours a day, and I know that", " There's another one. I wanted to show you.", " Give me a second.", " There's one called the Trevor Project there for lgbtq people with Suicidal Thoughts, especially Youth and it can be any age though. That's one eight. Six six four eight eight. Seven three eight six one eight six six four eight seven three eight six if", " You you need help. Please get it because we need you. I need you. I need you around. I need you two to tell me if I'm dressed right like you can't have me going out looking crazy. Can we going out looking crazy? You know how my hair gets you gotta be around you got to be around for this the next few months the next few years. We're going to be amazing, and I really want you there with me. So I'll see you everybody on the flip side. Bye."]}