{"showID": "00jdHz1eigCLYp4dLBrBae", "show_name": "Embodied Astrology with Renee Sills", "show_description": "Embodied Astrology and other tools for living in your body and from your heart  www.embodiedastrology.com or reneesills.com for more.", "episode_name": "Gemini Horoscope for Gemini Season (May 21- June 21)", "episode_description": "  These horoscopes are month-ahead forecasts for each sign for Gemini Season in 2019. Gemini Season extends between May 21- June 21 Go to embodiedastrology.com to find short written horoscopes for all 12 signs and to find out more about donating to sustain this work or becoming a monthly subscriber Check out the Embodied Astrology introduction and guided meditation for Gemini Season, Meet Your Mind. In this 40-minute episode I’ll introduce the sign Gemini as an embodied quality and state of being. Everyone has Gemini in their chart and Gemini is a very important sign! This is the sign that governs mental processes, thinking and language. I’ll talk to you about how to recognize Gemini’s influence in your body and behaviors, and offer some somatic resourcing for working with Gemini’s tendency to overthink, compare and get distracted. This episode is a great preparation for the next 30 days of Gemini season (May 21-June 21), and also a great energy to check in with at any point. Get the Gemini Season Month Ahead Extended Forecast by becoming a subscriber today! Find out more here: https://www.embodiedastrology.com/donate Cover Art by Janna Dorothy  ---   Send in a voice message: https://anchor.fm/embodied-astrology/message", "duration": 18.15423333333333, "transcript": ["Hello and welcome. This is Renee seals your astrologer and host of the embodied astrology podcast. You're listening to the audio horoscopes for Gemini season, 2019. These horoscopes focus on what I see as being the most important themes of the season and I'll offer some perspective on how to work with these themes through your embodied awareness Gemini season extends between Tuesday, May 21st and Friday, June 21st, please listen to the horoscopes for both your sun sign and your Rising.", " Assign, your sun sign is the time of year. You were born and is the answer you give if someone asks you what your sign is Sun Sign horoscopes will generally give you more information about what's important in your larger life journey and soul development. Your rising sign is the time of day. You were born and the rising sign horoscopes generally give you greater insight into the current events of your day-to-day life many people also find valuable information in the horoscopes for their Moon signs, which often speak to more emotional experiences or those occurring within the home and family.", " If you don't know your science, you can get a free chart in the horse in the horoscope section on my website embodied astrology.com check on the site anyway to find short written horoscopes for all 12 signs for Gemini season to learn more about Gemini and Gemini season, make sure to listen to the guided meditation called meet your mind. Gemini is a sign in everyone's chart. And in this meditation, you'll gain understanding for how to work with Geminis strengths and challenges and will experience how Gemini functions in your body and", " Experience if your monthly subscriber you'll also receive my extended month ahead astrology report. This report includes an expanded forecast audio recording and downloadable PDF with information on planetary aspects in lunar cycles this month and suggestions for how to work with the astrology for your best benefit. You can subscribe today by becoming a monthly donor at any amount per month when you subscribe. You'll also receive discounts for my online classes other events and month late birthday reports if you enjoy this work,", " Please support it by sharing it with your friends on social media tag and follow embodied astrology on Instagram Facebook and Twitter. Please consider also supporting the work by leaving positive ratings on iTunes or likes and comments on the links. Finally. Your financial support allows me to continue offering this work for free to donate or to find any of the information that I mentioned above. Go to embodied astrology.com or check the show notes. Thank you so much for listening. Happy Gemini season now onto your horoscope.", " Hello, Jim, and I thank you so much for listening. You are listening to the audio horoscope for the month ahead of Gemini season. This is your season. Happy birthday Gemini. I'm wishing you all the best in your season. The sun is in your sign. It is radiating your kind of light. The light of Gemini season is a really interesting and magical light in the northern hemisphere. This is the season when", " We have the culmination of daylight. So the very last day of Gemini season is the eve of The Longest Day in the year and in the southern hemisphere. It's the opposite the longest night in the year. Gemini is a sign that is known for Duality and for holding the complexity of multiple points of view. It is a shape shifter. It is a Wanderer. It's a translator and it is a jokester and for", " are you Gemini rules your solar first house? And that means that this is part of your identity as a person with Gemini in the first house or sun in Gemini. You are a person who is here to teach us all about what it means to have a sense of humor to see multiplicities and plurality xand many different sides of stories to hold complexities with ease and curiosity. You're also a person who needs to learn to live from your heart. Your mind is very active and", " Way that Gemini needs to grow and itself is through understanding that true connection comes from love. You have a very sharp mind and this month as the sun moves into Gemini and your ruling planet Mercury also moves into Gemini. They form a conjunction on the very first day of Gemini season. This marks a time when mental activity is high and you may have a lot going on. There might be feelings of trying to understand yourself or having a lot of", " focus on yourself a lot of internal energy or self reflecting energy this conjunction between the Sun and Mercury is also an important part of the Mercury retrograde cycle and if you think back to March or so, it may be that in these last couple of months. You've been preparing yourself in some ways to be a little bit different in the world how you present yourself. How you communicate how you connect with?", " Is is changing and as we get into your season it's a time to start to experiment with these changes. They'll happen. Naturally. You don't have to intend to them at all, but just notice how your communication is Shifting how your mind is Shifting and the way that you make associations is Shifting again the message for you is always to deepen in your heart to connect with your heart when you get caught up in your mind. It is not good news for you. You are very intelligent.", " Agent your mind is sharp, but when the mind takes leadership or is dominant not good news. If you can connect your heart with your mind good news, and the good news for this month is that you'll have a lot of opportunity to do that. So the first week of Gemini season is a week when there are several powerful aspects that for you are coming into again your personality and your identity, especially as you relate with", " Ideas of yourself in a larger social context. So for some of you this might mean work that you're doing in the world and how you're seeking to affect a larger whole how you're engaging with social or humanitarian causes for others. This may mean friends networks how you feel yourself as a part of a group for others of you this may mean the idea or worry or hope of future outcome and how you are being received or", " of doubt in the world and for some of you it could be all three of these things. So as I said several powerful aspects this week, and there is a lot of energy for you to notice any habits of insecurity or holding back really bring your attention to the ways that you might get bound up with insecurities or that you might feel somehow inhibited or limited by kind of deeper belief patterns that you might hold below the surface.", " Or any kind of trauma that you may be carrying that affects you socially as we move through the week and get into the fourth quarter Square, which is exact on May 26th. You may have several important realizations about how your energy is Rippling out and affecting the world around you and therefore affecting you as a person in the world. This is a really good time just to practice awareness. There's nothing that you need.", " To do during this time except for notice. How are you in your social life? How do you respond to the world around you? What do you feel like you need to give how do you feel like you need to be and then really seek again to come into your heart as we get into the next week May 30th through June 2nd Mercury makes excuse me, Venus makes a number of aspects and this is I think really going to help you live in that heart space, so these couple of days", " Could bring quite a bit of emotional intensity. There may be a lot of openings. You might be feeling some pretty profound or deep feelings. And there may be releasing a feelings that you haven't felt it yet or that have been kind of brewing for some time. If this is true for you ultimately it's positive its allowing energy to move its clearing some space the the main key here in these couple of days in general, but definitely these couple of days", " Again, feel your heart try and really ground in your own truth really pay attention to what is true for you if you get caught up in trying to figure out what's going on for other people or if you get confused about how you should be presenting yourself in the world or if it feels like there are demands on you from your social connections your partners or the folks around you to be something that you're not take a deep breath in tape a deep exhale.", " And let all of that go you're fully allowed right now to have your own process and it's really important that you give yourself space and time to do that. There's a new moon in your sign on Monday June 3rd. And this new moon comes in at 12 degrees of Gemini. The new moon is always a great time to set intentions for a new beginning. And for those of you who are Gemini son. This is your birthday month and it's really natural to set intentions for the next year if your Gemini rising", " In great. Think ahead for your next year. This is a big part of your identity. How do you want to grow? What is it that you are calling in for your own identity. How do you want to see yourself evolving from May of 2019 into May of 2020 around the new moon on the day of June 3rd or a day or two after June 4th or 5th great times to set these intentions and to carve some space and time out for yourself for a little bit of a ritual.", " New Beginning on June 4th Mercury enters the sign of Cancer and it will Transit cancer through June 28th as mercury enters cancer. It meets up with Mars that is there currently and the two of them will move into a conjunction that is exact on the 18th Mars and Mercury will also both be forming aspects to the North Node and they'll be forming several important aspects to other places in the chart for you cancer is the part of the", " chart that has to do with your value and your value systems self esteem self worth feelings of worthiness or enoughness are really big themes as well as your actual value values your valuables your money your assets your relationship to finances and resources Etc. So as mercury and Mars move through this part of your chart, it's a really wonderful time to make some Headway.", " As part of your life to gain confidence to articulate and speak out loud. What it is that you would like to call in or what kinds of affirmations you want to put forward for your own self worth and self development with the North Node here and several Clips is coming later in the year. It's a really good time to call in some new energy. This is a great time to ask for what you want and need again. The exact conjunction of mercury with Mars is anju.", " June 18th and leading up to that point there may be quite a lot of activity if there's anxiety throughout this month. Please do practice with the meditation that I offer for Gemini season, as I mentioned before your sign is one that really tends to overthink and get caught in the mental space and this meditation is for working with the element of mind and the way that our minds compare and separate and in general get pretty turned in and", " Around on themselves. So especially at this time but throughout the entire month. If you just need some support calming yourself on a mental level check that out on June 8 Venus will enter your sign it will Transit there through July 4th Venus is a benefic and a beautiful energy. This is a really good time for you for your self-esteem for your appearance to pay attention to your body to pay attention to your appearance to your identity.", " T and to really kind of commit to self love practices self love is not easy. It's not a Hallmark card and it's certainly not only about yourself as you work to really love yourself you unpack a lot of internalized stories from your family from your culture ancestry Etc to really love yourself. You have to confront a whole lot of bullshit in the world and that's a great time to do it.", " June through July with Venus's support so kind of getting into any kinds of self-limiting beliefs and just seeking to shine the light of awareness on them when you try and eradicate something or separate or dismiss it. It tends to come back stronger. So if you find self-limiting beliefs turn towards them with compassion open your heart invite them in and just notice as they change which they probably will as soon as they're given some loving attention.", " On June 9th. The second quarter square is aspecting your first house of identity and your 10th House of career. There seems to be something going on right now in your future goals and the idea of how you want to be in the world right now. This is a really good day to check in with your spiritual self and kind of let go of any more mental or conceptual goals that you have for your life. Like you're a", " Title or you know the concepts of what you want to be your live-in to put that aside and see if you can connect just to the essence what quality do you want to be an exude and your life and what kind of quality do you want to be an exude in your future? That's something to Anchor in there may be a lot of confusion or opportunity that", " Isn't quite like you might not understand what it is right now in terms of your path and moving forwards. If you're moving forward into your path from a place of ambition and more of a concrete mind and especially if you're moving with a self-serving Focus, you're not so supported. If you move on to your path from a place of sacredness and integrity with your spiritual alignment you are supported in whatever your goal is.", " Be finally on June 17th. There's a full moon in your opposite sign of Sagittarius Sagittarius in your chart is the sign that describes your relationships with other people. This is in general the ways that you relate socially the ways that you put yourself out and kind of how you feel yourself externally in the world. But this place in your chart also has to do with important relationships and committed Partnerships the", " Full moon is often a time of heightened feelings and Revelation. This is a good time for you to just check in with your social self and with any contracts or commitments that you have with important people in your life. The full moon is coming very close to Jupiter and will be amplifying Jupiter's effect and Jupiter has been transiting Sagittarius since last November Jupiter is a planet of learning and growth and there's a lot of opportunity for you to expand and to", " Learn about yourself through your relationships this year the full moon might bring you some kind of expansive opportunity. It may also bring you a lesson that feels challenging trust that whatever is coming up is coming up because you're ready to deal with it and again continue to soften feel into your heart move kind of under and around the mental layers and do what you can to be as present as possible.", " If you would like to know more about your astrology of a couple of offerings for you, I am offering a birthday report for Gemini and that's available now and you can download it immediately from embodied astrology.com. That birthday report is an extended hork horoscope. It's a half an hour forecast and I'll be talking about this big themes of this year. And then you'll also get a PDF that is a year ahead report and I'll list transits and", " Dates so you can look at what kinds of opportunities what kinds of Challenge and what kinds of themes are coming up throughout your solar Year from May of twenty nineteen through May of twenty twenty that reading is available for $15. It's $10 for subscribers. So definitely worth the subscription if you want some other material as well. I do offer also monthly reports and so the Gemini monthly report includes", " An expanded horoscope for this month, you'll have planetary aspects and lunar cycles throughout the month and that comes in audio recording as well as a written format with a calendar so you can plan for your month to use the astrological opportunities as they come in. There's also a guided meditation for Gemini as I mentioned, please use this I think it'll help you especially if you experience yourself being overly mental throughout the month and as always I appreciate your support. Thank", " You so much for listening. Happy birthday if it's your birthday. Happy Gemini season."]}